export const okvedTreeData = [
   {
      id: "Раздел A",
      title: "Сельское, лесное хозяйство, охота, рыболовство и рыбоводство",
      children: [
         {
            id: "01",
            title: "Растениеводство и животноводство, охота и предоставление соответствующих услуг в этих областях",
            children: [
               {
                  id: "01.1",
                  title: "Выращивание однолетних культур",
                  children: [
                     {
                        id: "01.11",
                        title: "Выращивание зерновых (кроме риса), зернобобовых культур и семян масличных культур",
                        children: [
                           {
                              id: "01.11.1",
                              title: "Выращивание зерновых культур",
                              children: [
                                 {
                                    id: "01.11.11",
                                    title: "Выращивание пшеницы"
                                 },
                                 {
                                    id: "01.11.12",
                                    title: "Выращивание ячменя"
                                 },
                                 {
                                    id: "01.11.13",
                                    title: "Выращивание ржи"
                                 },
                                 {
                                    id: "01.11.14",
                                    title: "Выращивание кукурузы"
                                 },
                                 {
                                    id: "01.11.15",
                                    title: "Выращивание овса"
                                 },
                                 {
                                    id: "01.11.16",
                                    title: "Выращивание гречихи"
                                 },
                                 {
                                    id: "01.11.19",
                                    title: "Выращивание прочих зерновых культур"
                                 }]
                           },
                           {
                              id: "01.11.2",
                              title: "Выращивание зернобобовых культур"
                           },
                           {
                              id: "01.11.3",
                              title: "Выращивание семян масличных культур",
                              children: [
                                 {
                                    id: "01.11.31",
                                    title: "Выращивание семян подсолнечника"
                                 },
                                 {
                                    id: "01.11.32",
                                    title: "Выращивание семян рапса"
                                 },
                                 {
                                    id: "01.11.33",
                                    title: "Выращивание семян соевых бобов"
                                 },
                                 {
                                    id: "01.11.39",
                                    title: "Выращивание семян прочих масличных культур"
                                 }]
                           }]
                     },
                     {
                        id: "01.12",
                        title: "Выращивание риса"
                     },
                     {
                        id: "01.13",
                        title: "Выращивание овощей, бахчевых, корнеплодных и клубнеплодных культур, грибов и трюфелей",
                        children: [
                           {
                              id: "01.13.1",
                              title: "Выращивание овощей",
                              children: [
                                 {
                                    id: "01.13.11",
                                    title: "Выращивание овощей открытого грунта"
                                 },
                                 {
                                    id: "01.13.12",
                                    title: "Выращивание овощей защищенного грунта"
                                 }]
                           },
                           {
                              id: "01.13.2",
                              title: "Выращивание бахчевых культур"
                           },
                           {
                              id: "01.13.3",
                              title: "Выращивание столовых корнеплодных и клубнеплодных культур с высоким содержанием крахмала или инулина",
                              children: [
                                 {
                                    id: "01.13.31",
                                    title: "Выращивание картофеля"
                                 },
                                 {
                                    id: "01.13.39",
                                    title: "Выращивание прочих столовых корнеплодных и клубнеплодных культур с высоким содержанием крахмала или инулина"
                                 }]
                           },
                           {
                              id: "01.13.4",
                              title: "Выращивание семян овощных культур, за исключением семян сахарной свеклы"
                           },
                           {
                              id: "01.13.5",
                              title: "Выращивание сахарной свеклы и семян сахарной свеклы",
                              children: [
                                 {
                                    id: "01.13.51",
                                    title: "Выращивание сахарной свеклы"
                                 },
                                 {
                                    id: "01.13.52",
                                    title: "Выращивание семян сахарной свеклы"
                                 }]
                           },
                           {
                              id: "01.13.6",
                              title: "Выращивание грибов и трюфелей"
                           },
                           {
                              id: "01.13.9",
                              title: "Выращивание овощей, не включенных в другие группировки"
                           }]
                     },
                     {
                        id: "01.14",
                        title: "Выращивание сахарного тростника"
                     },
                     {
                        id: "01.15",
                        title: "Выращивание табака и махорки"
                     },
                     {
                        id: "01.16",
                        title: "Выращивание волокнистых прядильных культур",
                        children: [
                           {
                              id: "01.16.1",
                              title: "Выращивание хлопчатника"
                           },
                           {
                              id: "01.16.2",
                              title: "Выращивание льна"
                           },
                           {
                              id: "01.16.3",
                              title: "Выращивание обыкновенной конопли"
                           },
                           {
                              id: "01.16.9",
                              title: "Выращивание прочих текстильных культур"
                           }]
                     },
                     {
                        id: "01.19",
                        title: "Выращивание прочих однолетних культур",
                        children: [
                           {
                              id: "01.19.1",
                              title: "Выращивание однолетних кормовых культур"
                           },
                           {
                              id: "01.19.2",
                              title: "Цветоводство",
                              children: [
                                 {
                                    id: "01.19.21",
                                    title: "Выращивание цветов в открытом и защищенном грунте"
                                 },
                                 {
                                    id: "01.19.22",
                                    title: "Выращивание семян цветов"
                                 }]
                           },
                           {
                              id: "01.19.3",
                              title: "Выращивание семян свеклы (кроме семян сахарной свеклы) и семян кормовых культур"
                           },
                           {
                              id: "01.19.9",
                              title: "Выращивание прочих однолетних культур, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "01.2",
                  title: "Выращивание многолетних культур",
                  children: [
                     {
                        id: "01.21",
                        title: "Выращивание винограда"
                     },
                     {
                        id: "01.22",
                        title: "Выращивание тропических и субтропических культур"
                     },
                     {
                        id: "01.23",
                        title: "Выращивание цитрусовых культур"
                     },
                     {
                        id: "01.24",
                        title: "Выращивание семечковых и косточковых культур"
                     },
                     {
                        id: "01.25",
                        title: "Выращивание прочих плодовых деревьев, кустарников и орехов",
                        children: [
                           {
                              id: "01.25.1",
                              title: "Выращивание прочих плодовых и ягодных культур"
                           },
                           {
                              id: "01.25.2",
                              title: "Выращивание семян плодовых и ягодных культур"
                           },
                           {
                              id: "01.25.3",
                              title: "Выращивание орехоплодных культур"
                           }]
                     },
                     {
                        id: "01.26",
                        title: "Выращивание плодов масличных культур"
                     },
                     {
                        id: "01.27",
                        title: "Выращивание культур для производства напитков",
                        children: [
                           {
                              id: "01.27.1",
                              title: "Выращивание чая"
                           },
                           {
                              id: "01.27.9",
                              title: "Выращивание прочих культур для производства напитков"
                           }]
                     },
                     {
                        id: "01.28",
                        title: "Выращивание специй, пряно-ароматических, эфиромасличных и лекарственных культур",
                        children: [
                           {
                              id: "01.28.1",
                              title: "Выращивание пряностей"
                           },
                           {
                              id: "01.28.2",
                              title: "Выращивание хмеля"
                           },
                           {
                              id: "01.28.3",
                              title: "Выращивание растений, используемых в основном в парфюмерии, фармации или в качестве инсектицидов, фунгицидов и для аналогичных целей"
                           }]
                     },
                     {
                        id: "01.29",
                        title: "Выращивание прочих многолетних культур"
                     }]
               },
               {
                  id: "01.3",
                  title: "Выращивание рассады",
                  children: [
                     {
                        id: "01.30",
                        title: "Выращивание рассады"
                     }]
               },
               {
                  id: "01.4",
                  title: "Животноводство",
                  children: [
                     {
                        id: "01.41",
                        title: "Разведение молочного крупного рогатого скота, производство сырого молока",
                        children: [
                           {
                              id: "01.41.1",
                              title: "Разведение молочного крупного рогатого скота",
                              children: [
                                 {
                                    id: "01.41.11",
                                    title: "Разведение молочного крупного рогатого скота, кроме племенного"
                                 },
                                 {
                                    id: "01.41.12",
                                    title: "Разведение племенного молочного крупного рогатого скота"
                                 }]
                           },
                           {
                              id: "01.41.2",
                              title: "Производство сырого коровьего молока и сырого молока прочего крупного рогатого скота (буйволов, яков и др.)",
                              children: [
                                 {
                                    id: "01.41.21",
                                    title: "Производство сырого коровьего молока"
                                 },
                                 {
                                    id: "01.41.29",
                                    title: "Производство сырого молока прочего крупного рогатого скота (буйволов, яков и др.)"
                                 }]
                           }]
                     },
                     {
                        id: "01.42",
                        title: "Разведение прочих пород крупного рогатого скота и буйволов, производство спермы",
                        children: [
                           {
                              id: "01.42.1",
                              title: "Разведение мясного и прочего крупного рогатого скота, включая буйволов, яков и др.",
                              children: [
                                 {
                                    id: "01.42.11",
                                    title: "Разведение мясного и прочего крупного рогатого скота, включая буйволов, яков и др., на мясо"
                                 },
                                 {
                                    id: "01.42.12",
                                    title: "Разведение племенного мясного и прочего крупного рогатого скота, включая буйволов, яков и др."
                                 }]
                           },
                           {
                              id: "01.42.2",
                              title: "Производство бычьей спермы, а также спермы буйволов, яков и др."
                           }]
                     },
                     {
                        id: "01.43",
                        title: "Разведение лошадей и прочих животных семейства лошадиных отряда непарнокопытных",
                        children: [
                           {
                              id: "01.43.1",
                              title: "Разведение лошадей, ослов, мулов, лошаков"
                           },
                           {
                              id: "01.43.2",
                              title: "Производство сырого кобыльего молока"
                           },
                           {
                              id: "01.43.3",
                              title: "Производство спермы жеребцов и ослов"
                           }]
                     },
                     {
                        id: "01.44",
                        title: "Разведение верблюдов и прочих животных семейства верблюжьих"
                     },
                     {
                        id: "01.45",
                        title: "Разведение овец и коз",
                        children: [
                           {
                              id: "01.45.1",
                              title: "Разведение овец и коз"
                           },
                           {
                              id: "01.45.2",
                              title: "Производство сырого овечьего и козьего молока"
                           },
                           {
                              id: "01.45.3",
                              title: "Производство сырой (немытой) шерсти и волоса козы"
                           },
                           {
                              id: "01.45.4",
                              title: "Разведение племенных овец и коз"
                           }]
                     },
                     {
                        id: "01.46",
                        title: "Разведение свиней",
                        children: [
                           {
                              id: "01.46.1",
                              title: "Выращивание и разведение свиней",
                              children: [
                                 {
                                    id: "01.46.11",
                                    title: "Выращивание свиней на мясо"
                                 },
                                 {
                                    id: "01.46.12",
                                    title: "Разведение племенного поголовья свиней"
                                 }]
                           },
                           {
                              id: "01.46.2",
                              title: "Производство спермы хряков"
                           }]
                     },
                     {
                        id: "01.47",
                        title: "Разведение сельскохозяйственной птицы",
                        children: [
                           {
                              id: "01.47.1",
                              title: "Выращивание и разведение сельскохозяйственной птицы: кур, индеек, уток, гусей и цесарок",
                              children: [
                                 {
                                    id: "01.47.11",
                                    title: "Выращивание сельскохозяйственной птицы на мясо"
                                 },
                                 {
                                    id: "01.47.12",
                                    title: "Разведение племенной сельскохозяйственной птицы"
                                 }]
                           },
                           {
                              id: "01.47.2",
                              title: "Производство яиц сельскохозяйственной птицы"
                           },
                           {
                              id: "01.47.3",
                              title: "Деятельность инкубаторов для птицеводства"
                           }]
                     },
                     {
                        id: "01.49",
                        title: "Разведение прочих животных",
                        children: [
                           {
                              id: "01.49.1",
                              title: "Пчеловодство",
                              children: [
                                 {
                                    id: "01.49.11",
                                    title: "Пчеловодство медового направления"
                                 },
                                 {
                                    id: "01.49.12",
                                    title: "Пчеловодство опылительного направления"
                                 },
                                 {
                                    id: "01.49.13",
                                    title: "Пчеловодство разведенческого направления"
                                 }]
                           },
                           {
                              id: "01.49.2",
                              title: "Разведение кроликов и прочих пушных зверей на фермах",
                              children: [
                                 {
                                    id: "01.49.21",
                                    title: "Разведение кроликов, производство тонкого волоса кроликов на фермах"
                                 },
                                 {
                                    id: "01.49.22",
                                    title: "Разведение прочих пушных зверей на фермах"
                                 }]
                           },
                           {
                              id: "01.49.3",
                              title: "Разведение шелкопряда",
                              children: [
                                 {
                                    id: "01.49.31",
                                    title: "Производство грен шелкопряда"
                                 },
                                 {
                                    id: "01.49.32",
                                    title: "Производство коконов шелкопряда"
                                 }]
                           },
                           {
                              id: "01.49.4",
                              title: "Разведение оленей",
                              children: [
                                 {
                                    id: "01.49.41",
                                    title: "Разведение домашних северных оленей"
                                 },
                                 {
                                    id: "01.49.42",
                                    title: "Разведение пятнистых оленей, ланей"
                                 },
                                 {
                                    id: "01.49.43",
                                    title: "Разведение благородных оленей (европейских, кавказских, маралов, изюбрей)"
                                 },
                                 {
                                    id: "01.49.44",
                                    title: "Производство пантов северных оленей, пятнистых оленей, благородных оленей (европейских, кавказских, маралов, изюбрей), ланей"
                                 }]
                           },
                           {
                              id: "01.49.5",
                              title: "Разведение домашних животных"
                           },
                           {
                              id: "01.49.6",
                              title: "Разведение лабораторных животных"
                           },
                           {
                              id: "01.49.7",
                              title: "Разведение дождевых червей"
                           },
                           {
                              id: "01.49.9",
                              title: "Разведение прочих животных, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "01.5",
                  title: "Смешанное сельское хозяйство",
                  children: [
                     {
                        id: "01.50",
                        title: "Смешанное сельское хозяйство"
                     }]
               },
               {
                  id: "01.6",
                  title: "Деятельность вспомогательная в области производства сельскохозяйственных культур и послеуборочной обработки сельхозпродукции",
                  children: [
                     {
                        id: "01.61",
                        title: "Предоставление услуг в области растениеводства"
                     },
                     {
                        id: "01.62",
                        title: "Предоставление услуг в области животноводства"
                     },
                     {
                        id: "01.63",
                        title: "Деятельность сельскохозяйственная после сбора урожая"
                     },
                     {
                        id: "01.64",
                        title: "Обработка семян для посадки"
                     }]
               },
               {
                  id: "01.7",
                  title: "Охота, отлов и отстрел диких животных, включая предоставление услуг в этих областях",
                  children: [
                     {
                        id: "01.70",
                        title: "Охота, отлов и отстрел диких животных, включая предоставление услуг в этих областях"
                     }]
               }]
         },
         {
            id: "02",
            title: "Лесоводство и лесозаготовки",
            children: [
               {
                  id: "02.1",
                  title: "Лесоводство и прочая лесохозяйственная деятельность",
                  children: [
                     {
                        id: "02.10",
                        title: "Лесоводство и прочая лесохозяйственная деятельность",
                        children: [
                           {
                              id: "02.10.1",
                              title: "Деятельность лесопитомников",
                              children: [
                                 {
                                    id: "02.10.11",
                                    title: "Выращивание посадочного материала лесных растений (саженцев, сеянцев)"
                                 },
                                 {
                                    id: "02.10.19",
                                    title: "Выращивание прочей продукции лесопитомниками"
                                 }]
                           },
                           {
                              id: "02.10.2",
                              title: "Деятельность лесохозяйственная прочая"
                           }]
                     }]
               },
               {
                  id: "02.2",
                  title: "Лесозаготовки",
                  children: [
                     {
                        id: "02.20",
                        title: "Лесозаготовки"
                     }]
               },
               {
                  id: "02.3",
                  title: "Сбор и заготовка пищевых лесных ресурсов, недревесных лесных ресурсов и лекарственных растений",
                  children: [
                     {
                        id: "02.30",
                        title: "Сбор и заготовка пищевых лесных ресурсов, недревесных лесных ресурсов и лекарственных растений",
                        children: [
                           {
                              id: "02.30.1",
                              title: "Сбор и заготовка пищевых лесных ресурсов",
                              children: [
                                 {
                                    id: "02.30.11",
                                    title: "Сбор и заготовка дикорастущих грибов"
                                 },
                                 {
                                    id: "02.30.12",
                                    title: "Сбор и заготовка дикорастущих плодов, ягод"
                                 },
                                 {
                                    id: "02.30.13",
                                    title: "Сбор и заготовка дикорастущих орехов"
                                 },
                                 {
                                    id: "02.30.14",
                                    title: "Сбор лекарственных растений"
                                 }]
                           },
                           {
                              id: "02.30.2",
                              title: "Сбор и заготовка недревесных лесных ресурсов"
                           }]
                     }]
               },
               {
                  id: "02.4",
                  title: "Предоставление услуг в области лесоводства и лесозаготовок",
                  children: [
                     {
                        id: "02.40",
                        title: "Предоставление услуг в области лесоводства и лесозаготовок",
                        children: [
                           {
                              id: "02.40.1",
                              title: "Предоставление услуг в области лесоводства"
                           },
                           {
                              id: "02.40.2",
                              title: "Предоставление услуг в области лесозаготовок"
                           }]
                     }]
               }]
         },
         {
            id: "03",
            title: "Рыболовство и рыбоводство",
            children: [
               {
                  id: "03.1",
                  title: "Рыболовство",
                  children: [
                     {
                        id: "03.11",
                        title: "Рыболовство морское",
                        children: [
                           {
                              id: "03.11.1",
                              title: "Рыболовство морское промышленное"
                           },
                           {
                              id: "03.11.2",
                              title: "Рыболовство морское прибрежное"
                           },
                           {
                              id: "03.11.3",
                              title: "Рыболовство в научно-исследовательских и контрольных целях"
                           },
                           {
                              id: "03.11.4",
                              title: "Рыболовство в учебных и культурно-просветительских целях"
                           },
                           {
                              id: "03.11.5",
                              title: "Рыболовство морское в целях аквакультуры (рыбоводства)"
                           }]
                     },
                     {
                        id: "03.12",
                        title: "Рыболовство пресноводное",
                        children: [
                           {
                              id: "03.12.1",
                              title: "Рыболовство пресноводное промышленное"
                           },
                           {
                              id: "03.12.2",
                              title: "Рыболовство пресноводное в целях аквакультуры (рыбоводства)"
                           },
                           {
                              id: "03.12.3",
                              title: "Рыболовство любительское и спортивное"
                           },
                           {
                              id: "03.12.4",
                              title: "Рыболовство в целях обеспечения ведения традиционного образа жизни и осуществления традиционной хозяйственной деятельности коренных малочисленных народов Севера, Сибири и Дальнего Востока Российской Федерации"
                           }]
                     }]
               },
               {
                  id: "03.2",
                  title: "Рыбоводство",
                  children: [
                     {
                        id: "03.21",
                        title: "Рыбоводство морское",
                        children: [
                           {
                              id: "03.21.1",
                              title: "Рыбоводство морское индустриальное"
                           },
                           {
                              id: "03.21.2",
                              title: "Рыбоводство морское пастбищное"
                           },
                           {
                              id: "03.21.3",
                              title: "Мелиорация рыбохозяйственная морских и минерализированных водных объектов"
                           },
                           {
                              id: "03.21.4",
                              title: "Воспроизводство морских биоресурсов искусственное"
                           },
                           {
                              id: "03.21.5",
                              title: "Акклиматизация морских биоресурсов"
                           },
                           {
                              id: "03.21.9",
                              title: "Деятельность по морскому рыбоводству прочая"
                           }]
                     },
                     {
                        id: "03.22",
                        title: "Рыбоводство пресноводное",
                        children: [
                           {
                              id: "03.22.1",
                              title: "Рыбоводство пресноводное индустриальное"
                           },
                           {
                              id: "03.22.2",
                              title: "Рыбоводство пресноводное пастбищное"
                           },
                           {
                              id: "03.22.3",
                              title: "Рыбоводство прудовое"
                           },
                           {
                              id: "03.22.4",
                              title: "Мелиорация рыбохозяйственная пресноводных объектов"
                           },
                           {
                              id: "03.22.5",
                              title: "Воспроизводство пресноводных биоресурсов искусственное"
                           },
                           {
                              id: "03.22.6",
                              title: "Акклиматизация пресноводных биоресурсов"
                           },
                           {
                              id: "03.22.9",
                              title: "Деятельность по пресноводному рыбоводству прочая"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел B",
      title: "Добыча полезных ископаемых",
      children: [
         {
            id: "05",
            title: "Добыча угля",
            children: [
               {
                  id: "05.1",
                  title: "Добыча и обогащение угля и антрацита",
                  children: [
                     {
                        id: "05.10",
                        title: "Добыча и обогащение угля и антрацита",
                        children: [
                           {
                              id: "05.10.1",
                              title: "Добыча угля и антрацита",
                              children: [
                                 {
                                    id: "05.10.11",
                                    title: "Добыча антрацита открытым способом"
                                 },
                                 {
                                    id: "05.10.12",
                                    title: "Добыча коксующегося угля открытым способом"
                                 },
                                 {
                                    id: "05.10.13",
                                    title: "Добыча угля, за исключением антрацита, угля коксующегося и угля бурого, открытым способом"
                                 },
                                 {
                                    id: "05.10.14",
                                    title: "Добыча антрацита подземным способом"
                                 },
                                 {
                                    id: "05.10.15",
                                    title: "Добыча коксующегося угля подземным способом"
                                 },
                                 {
                                    id: "05.10.16",
                                    title: "Добыча угля, за исключением антрацита, угля коксующегося и угля бурого, подземным способом"
                                 }]
                           },
                           {
                              id: "05.10.2",
                              title: "Обогащение угля",
                              children: [
                                 {
                                    id: "05.10.21",
                                    title: "Обогащение антрацита"
                                 },
                                 {
                                    id: "05.10.22",
                                    title: "Обогащение коксующегося угля"
                                 },
                                 {
                                    id: "05.10.23",
                                    title: "Обогащение угля, кроме антрацита, угля коксующегося и угля бурого"
                                 }]
                           }]
                     }]
               },
               {
                  id: "05.2",
                  title: "Добыча и обогащение бурого угля (лигнита)",
                  children: [
                     {
                        id: "05.20",
                        title: "Добыча и обогащение бурого угля (лигнита)",
                        children: [
                           {
                              id: "05.20.1",
                              title: "Добыча бурого угля (лигнита)",
                              children: [
                                 {
                                    id: "05.20.11",
                                    title: "Добыча бурого угля (лигнита) открытым способом"
                                 },
                                 {
                                    id: "05.20.12",
                                    title: "Добыча бурого угля (лигнита) подземным способом"
                                 }]
                           },
                           {
                              id: "05.20.2",
                              title: "Обогащение бурого угля (лигнита)"
                           }]
                     }]
               }]
         },
         {
            id: "06",
            title: "Добыча сырой нефти и природного газа",
            children: [
               {
                  id: "06.1",
                  title: "Добыча сырой нефти и нефтяного (попутного) газа",
                  children: [
                     {
                        id: "06.10",
                        title: "Добыча сырой нефти и нефтяного (попутного) газа",
                        children: [
                           {
                              id: "06.10.1",
                              title: "Добыча сырой нефти"
                           },
                           {
                              id: "06.10.2",
                              title: "Добыча горючих (битуминозных) сланцев, песка и озокерита"
                           },
                           {
                              id: "06.10.3",
                              title: "Добыча нефтяного (попутного) газа"
                           },
                           {
                              id: "06.10.4",
                              title: "Разделение и извлечение нефтяного (попутного) газа"
                           }]
                     }]
               },
               {
                  id: "06.2",
                  title: "Добыча природного газа и газового конденсата",
                  children: [
                     {
                        id: "06.20",
                        title: "Добыча природного газа и газового конденсата",
                        children: [
                           {
                              id: "06.20.1",
                              title: "Добыча природного газа"
                           },
                           {
                              id: "06.20.2",
                              title: "Добыча газового конденсата"
                           }]
                     }]
               }]
         },
         {
            id: "07",
            title: "Добыча металлических руд",
            children: [
               {
                  id: "07.1",
                  title: "Добыча и обогащение железных руд",
                  children: [
                     {
                        id: "07.10",
                        title: "Добыча и обогащение железных руд",
                        children: [
                           {
                              id: "07.10.1",
                              title: "Добыча железных руд подземным способом"
                           },
                           {
                              id: "07.10.2",
                              title: "Добыча железных руд открытым способом"
                           },
                           {
                              id: "07.10.3",
                              title: "Обогащение и агломерация железных руд"
                           }]
                     }]
               },
               {
                  id: "07.2",
                  title: "Добыча руд цветных металлов",
                  children: [
                     {
                        id: "07.21",
                        title: "Добыча урановой и ториевой руд",
                        children: [
                           {
                              id: "07.21.1",
                              title: "Добыча и первичное обогащение урановых руд",
                              children: [
                                 {
                                    id: "07.21.11",
                                    title: "Добыча урановых руд подземным способом, включая способы подземного и кучного выщелачивания"
                                 },
                                 {
                                    id: "07.21.12",
                                    title: "Добыча урановых руд открытым способом, включая способ кучного выщелачивания"
                                 }]
                           },
                           {
                              id: "07.21.2",
                              title: "Добыча и первичное обогащение ториевых руд"
                           }]
                     },
                     {
                        id: "07.29",
                        title: "Добыча руд прочих цветных металлов",
                        children: [
                           {
                              id: "07.29.1",
                              title: "Добыча и обогащение медной руды"
                           },
                           {
                              id: "07.29.2",
                              title: "Добыча и обогащение никелевой и кобальтовой руд",
                              children: [
                                 {
                                    id: "07.29.21",
                                    title: "Добыча и обогащение никелевой руды"
                                 },
                                 {
                                    id: "07.29.22",
                                    title: "Добыча и обогащение кобальтовой руды"
                                 }]
                           },
                           {
                              id: "07.29.3",
                              title: "Добыча и обогащение алюминийсодержащего сырья (бокситов и нефелин-апатитовых руд)",
                              children: [
                                 {
                                    id: "07.29.31",
                                    title: "Добыча алюминийсодержащего сырья подземным способом"
                                 },
                                 {
                                    id: "07.29.32",
                                    title: "Добыча алюминийсодержащего сырья открытым способом"
                                 },
                                 {
                                    id: "07.29.33",
                                    title: "Обогащение нефелин-апатитовых руд"
                                 }]
                           },
                           {
                              id: "07.29.4",
                              title: "Добыча руд и песков драгоценных металлов и руд редких металлов",
                              children: [
                                 {
                                    id: "07.29.41",
                                    title: "Добыча руд и песков драгоценных металлов (золота, серебра и металлов платиновой группы)"
                                 },
                                 {
                                    id: "07.29.42",
                                    title: "Добыча и обогащение руд редких металлов (циркония, тантала, ниобия и т.п.)"
                                 }]
                           },
                           {
                              id: "07.29.5",
                              title: "Добыча и обогащение свинцово-цинковой руды"
                           },
                           {
                              id: "07.29.6",
                              title: "Добыча и обогащение оловянной руды"
                           },
                           {
                              id: "07.29.7",
                              title: "Добыча и обогащение титаномагниевого сырья"
                           },
                           {
                              id: "07.29.8",
                              title: "Добыча и обогащение вольфраммолибденовой руды"
                           },
                           {
                              id: "07.29.9",
                              title: "Добыча и обогащение руд прочих цветных металлов",
                              children: [
                                 {
                                    id: "07.29.91",
                                    title: "Добыча и обогащение сурьмяно-ртутных руд"
                                 },
                                 {
                                    id: "07.29.92",
                                    title: "Добыча и обогащение марганцевых руд"
                                 },
                                 {
                                    id: "07.29.93",
                                    title: "Добыча и обогащение хромовых (хромитовых) руд"
                                 },
                                 {
                                    id: "07.29.99",
                                    title: "Добыча и обогащение руд прочих цветных металлов, не включенных в другие группировки"
                                 }]
                           }]
                     }]
               }]
         },
         {
            id: "08",
            title: "Добыча прочих полезных ископаемых",
            children: [
               {
                  id: "08.1",
                  title: "Добыча камня, песка и глины",
                  children: [
                     {
                        id: "08.11",
                        title: "Добыча декоративного и строительного камня, известняка, гипса, мела и сланцев",
                        children: [
                           {
                              id: "08.11.1",
                              title: "Добыча и первичная обработка камня для памятников и строительства"
                           },
                           {
                              id: "08.11.2",
                              title: "Добыча и первичная обработка известняка и гипсового камня"
                           },
                           {
                              id: "08.11.3",
                              title: "Добыча мела и некальцинированного доломита"
                           },
                           {
                              id: "08.11.4",
                              title: "Добыча и первичная обработка сланцев"
                           }]
                     },
                     {
                        id: "08.12",
                        title: "Разработка гравийных и песчаных карьеров, добыча глины и каолина",
                        children: [
                           {
                              id: "08.12.1",
                              title: "Разработка гравийных и песчаных карьеров"
                           },
                           {
                              id: "08.12.2",
                              title: "Добыча глины и каолина"
                           }]
                     }]
               },
               {
                  id: "08.9",
                  title: "Добыча полезных ископаемых, не включенных в другие группировки",
                  children: [
                     {
                        id: "08.91",
                        title: "Добыча минерального сырья для химической промышленности и производства минеральных удобрений"
                     },
                     {
                        id: "08.92",
                        title: "Добыча и агломерация торфа",
                        children: [
                           {
                              id: "08.92.1",
                              title: "Добыча торфа"
                           },
                           {
                              id: "08.92.2",
                              title: "Агломерация торфа"
                           }]
                     },
                     {
                        id: "08.93",
                        title: "Добыча соли"
                     },
                     {
                        id: "08.99",
                        title: "Добыча прочих полезных ископаемых, не включенных в другие группировки",
                        children: [
                           {
                              id: "08.99.1",
                              title: "Добыча природного асфальта, асфальтитов и битумных пород"
                           },
                           {
                              id: "08.99.2",
                              title: "Добыча абразивных материалов, асбеста, кремнеземистой каменной муки, природных графитов, мыльного камня (талька), полевого шпата и т.д.",
                              children: [
                                 {
                                    id: "08.99.21",
                                    title: "Добыча природных абразивов, кроме алмазов"
                                 },
                                 {
                                    id: "08.99.22",
                                    title: "Добыча вермикулита"
                                 },
                                 {
                                    id: "08.99.23",
                                    title: "Добыча асбеста"
                                 }]
                           },
                           {
                              id: "08.99.3",
                              title: "Добыча драгоценных камней, кварца, слюды, мусковита и т.д.",
                              children: [
                                 {
                                    id: "08.99.31",
                                    title: "Добыча драгоценных и полудрагоценных камней, кроме алмазов"
                                 },
                                 {
                                    id: "08.99.32",
                                    title: "Добыча алмазов"
                                 },
                                 {
                                    id: "08.99.33",
                                    title: "Добыча мусковита"
                                 },
                                 {
                                    id: "08.99.34",
                                    title: "Добыча пьезокварца"
                                 },
                                 {
                                    id: "08.99.35",
                                    title: "Добыча гранулированного кварца"
                                 },
                                 {
                                    id: "08.99.36",
                                    title: "Добыча слюды"
                                 }]
                           }]
                     }]
               }]
         },
         {
            id: "09",
            title: "Предоставление услуг в области добычи полезных ископаемых",
            children: [
               {
                  id: "09.1",
                  title: "Предоставление услуг в области добычи нефти и природного газа",
                  children: [
                     {
                        id: "09.10",
                        title: "Предоставление услуг в области добычи нефти и природного газа",
                        children: [
                           {
                              id: "09.10.1",
                              title: "Предоставление услуг по бурению, связанному с добычей нефти, газа и газового конденсата"
                           },
                           {
                              id: "09.10.2",
                              title: "Предоставление услуг по монтажу, ремонту и демонтажу буровых вышек"
                           },
                           {
                              id: "09.10.3",
                              title: "Предоставление услуг по доразведке месторождений нефти и газа на особых экономических условиях (по соглашению о разделе продукции - СРП)"
                           },
                           {
                              id: "09.10.4",
                              title: "Сжижение и обогащение природного газа на месте добычи для последующей транспортировки"
                           },
                           {
                              id: "09.10.9",
                              title: "Предоставление прочих услуг в области добычи нефти и природного газа"
                           }]
                     }]
               },
               {
                  id: "09.9",
                  title: "Предоставление услуг в других областях добычи полезных ископаемых",
                  children: [
                     {
                        id: "09.90",
                        title: "Предоставление услуг в других областях добычи полезных ископаемых"
                     }]
               }]
         }]
   },
   {
      id: "Раздел C",
      title: "Обрабатывающие производства",
      children: [
         {
            id: "10",
            title: "Производство пищевых продуктов",
            children: [
               {
                  id: "10.1",
                  title: "Переработка и консервирование мяса и мясной пищевой продукции",
                  children: [
                     {
                        id: "10.11",
                        title: "Переработка и консервирование мяса",
                        children: [
                           {
                              id: "10.11.1",
                              title: "Производство мяса в охлажденном виде"
                           },
                           {
                              id: "10.11.2",
                              title: "Производство пищевых субпродуктов в охлажденном виде"
                           },
                           {
                              id: "10.11.3",
                              title: "Производство мяса и пищевых субпродуктов в замороженном виде"
                           },
                           {
                              id: "10.11.4",
                              title: "Производство щипаной шерсти, сырых шкур и кож крупного рогатого скота, животных семейств лошадиных и оленевых, овец и коз"
                           },
                           {
                              id: "10.11.5",
                              title: "Производство животных жиров"
                           },
                           {
                              id: "10.11.6",
                              title: "Производство субпродуктов, непригодных для употребления в пищу"
                           }]
                     },
                     {
                        id: "10.12",
                        title: "Производство и консервирование мяса птицы",
                        children: [
                           {
                              id: "10.12.1",
                              title: "Производство мяса птицы в охлажденном виде"
                           },
                           {
                              id: "10.12.2",
                              title: "Производство мяса птицы в замороженном виде"
                           },
                           {
                              id: "10.12.3",
                              title: "Производство жиров домашней птицы"
                           },
                           {
                              id: "10.12.4",
                              title: "Производство субпродуктов домашней птицы, пригодных для употребления в пищу"
                           },
                           {
                              id: "10.12.5",
                              title: "Производство пера и пуха"
                           }]
                     },
                     {
                        id: "10.13",
                        title: "Производство продукции из мяса убойных животных и мяса птицы",
                        children: [
                           {
                              id: "10.13.1",
                              title: "Производство соленого, вареного, запеченого, копченого, вяленого и прочего мяса"
                           },
                           {
                              id: "10.13.2",
                              title: "Производство колбасных изделий"
                           },
                           {
                              id: "10.13.3",
                              title: "Производство мясных (мясосодержащих) консервов"
                           },
                           {
                              id: "10.13.4",
                              title: "Производство мясных (мясосодержащих) полуфабрикатов"
                           },
                           {
                              id: "10.13.5",
                              title: "Производство кулинарных мясных (мясосодержащих) изделий"
                           },
                           {
                              id: "10.13.6",
                              title: "Производство прочей пищевой продукции из мяса или мясных пищевых субпродуктов"
                           },
                           {
                              id: "10.13.7",
                              title: "Производство муки и гранул из мяса и мясных субпродуктов, непригодных для употребления в пищу"
                           },
                           {
                              id: "10.13.9",
                              title: "Предоставление услуг по тепловой обработке и прочим способам переработки мясных продуктов"
                           }]
                     }]
               },
               {
                  id: "10.2",
                  title: "Переработка и консервирование рыбы, ракообразных и моллюсков",
                  children: [
                     {
                        id: "10.20",
                        title: "Переработка и консервирование рыбы, ракообразных и моллюсков",
                        children: [
                           {
                              id: "10.20.1",
                              title: "Переработка и консервирование рыбы"
                           },
                           {
                              id: "10.20.2",
                              title: "Переработка и консервирование ракообразных и моллюсков"
                           },
                           {
                              id: "10.20.3",
                              title: "Производство пищевой рыбной муки или муки для корма животных"
                           },
                           {
                              id: "10.20.4",
                              title: "Производство муки грубого помола и растворимых компонентов из рыбы и прочих водных животных, непригодных для потребления человеком"
                           },
                           {
                              id: "10.20.5",
                              title: "Деятельность по обработке морских водорослей, в том числе морской капусты"
                           },
                           {
                              id: "10.20.9",
                              title: "Производство прочих продуктов из рыбы, ракообразных, моллюсков и прочих водных беспозвоночных, непригодных для употребления в пищу"
                           }]
                     }]
               },
               {
                  id: "10.3",
                  title: "Переработка и консервирование фруктов и овощей",
                  children: [
                     {
                        id: "10.31",
                        title: "Переработка и консервирование картофеля"
                     },
                     {
                        id: "10.32",
                        title: "Производство соковой продукции из фруктов и овощей"
                     },
                     {
                        id: "10.39",
                        title: "Прочие виды переработки и консервирования фруктов и овощей",
                        children: [
                           {
                              id: "10.39.1",
                              title: "Переработка и консервирование овощей (кроме картофеля) и грибов"
                           },
                           {
                              id: "10.39.2",
                              title: "Переработка и консервирование фруктов и орехов"
                           },
                           {
                              id: "10.39.9",
                              title: "Предоставление услуг по тепловой обработке и прочим способам подготовки овощей и фруктов для консервирования"
                           }]
                     }]
               },
               {
                  id: "10.4",
                  title: "Производство растительных и животных масел и жиров",
                  children: [
                     {
                        id: "10.41",
                        title: "Производство масел и жиров",
                        children: [
                           {
                              id: "10.41.1",
                              title: "Производство нерафинированных животных масел и жиров, их фракций"
                           },
                           {
                              id: "10.41.2",
                              title: "Производство нерафинированных растительных масел и их фракций",
                              children: [
                                 {
                                    id: "10.41.21",
                                    title: "Производство нерафинированного соевого масла и его фракций"
                                 },
                                 {
                                    id: "10.41.22",
                                    title: "Производство нерафинированного арахисового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.23",
                                    title: "Производство нерафинированного оливкового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.24",
                                    title: "Производство нерафинированного подсолнечного масла и его фракций"
                                 },
                                 {
                                    id: "10.41.25",
                                    title: "Производство нерафинированного хлопкового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.26",
                                    title: "Производство нерафинированного рапсового сурепного и горчичного масла и их фракций"
                                 },
                                 {
                                    id: "10.41.27",
                                    title: "Производство нерафинированного пальмового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.28",
                                    title: "Производство нерафинированного кокосового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.29",
                                    title: "Производство прочих нерафинированных растительных масел и их фракций"
                                 }]
                           },
                           {
                              id: "10.41.3",
                              title: "Производство хлопкового линта"
                           },
                           {
                              id: "10.41.4",
                              title: "Производство жмыха и муки тонкого и грубого помола из семян или плодов масличных культур"
                           },
                           {
                              id: "10.41.5",
                              title: "Производство рафинированных растительных масел и их фракций",
                              children: [
                                 {
                                    id: "10.41.51",
                                    title: "Производство рафинированного соевого масла и его фракций"
                                 },
                                 {
                                    id: "10.41.52",
                                    title: "Производство рафинированного арахисового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.53",
                                    title: "Производство рафинированного оливкового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.54",
                                    title: "Производство рафинированного подсолнечного масла и его фракций"
                                 },
                                 {
                                    id: "10.41.55",
                                    title: "Производство рафинированного хлопкового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.56",
                                    title: "Производство рафинированного рапсового, сурепного, горчичного масел и их фракций"
                                 },
                                 {
                                    id: "10.41.57",
                                    title: "Производство рафинированного пальмового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.58",
                                    title: "Производство рафинированного кокосового масла и его фракций"
                                 },
                                 {
                                    id: "10.41.59",
                                    title: "Производство прочих рафинированных растительных масел и их фракций"
                                 }]
                           },
                           {
                              id: "10.41.6",
                              title: "Производство гидрогенизированных и переэтерифицированных животных и растительных жиров и масел и их фракций"
                           },
                           {
                              id: "10.41.7",
                              title: "Производство растительных восков и дегры"
                           }]
                     },
                     {
                        id: "10.42",
                        title: "Производство маргариновой продукции"
                     }]
               },
               {
                  id: "10.5",
                  title: "Производство молочной продукции",
                  children: [
                     {
                        id: "10.51",
                        title: "Производство молока (кроме сырого) и молочной продукции",
                        children: [
                           {
                              id: "10.51.1",
                              title: "Производство питьевого молока и питьевых сливок"
                           },
                           {
                              id: "10.51.2",
                              title: "Производство сливочного масла, топленого масла, масляной пасты, молочного жира, спредов и топленых сливочно-растительных смесей"
                           },
                           {
                              id: "10.51.3",
                              title: "Производство сыра и сырных продуктов"
                           },
                           {
                              id: "10.51.4",
                              title: "Производство молока и сливок в твердой форме"
                           },
                           {
                              id: "10.51.9",
                              title: "Производство прочей молочной продукции"
                           }]
                     },
                     {
                        id: "10.52",
                        title: "Производство мороженого"
                     }]
               },
               {
                  id: "10.6",
                  title: "Производство продуктов мукомольной и крупяной промышленности, крахмала и крахмалосодержащих продуктов",
                  children: [
                     {
                        id: "10.61",
                        title: "Производство продуктов мукомольной и крупяной промышленности",
                        children: [
                           {
                              id: "10.61.1",
                              title: "Производство обработанного риса"
                           },
                           {
                              id: "10.61.2",
                              title: "Производство муки из зерновых культур"
                           },
                           {
                              id: "10.61.3",
                              title: "Производство крупы и гранул из зерновых культур"
                           },
                           {
                              id: "10.61.4",
                              title: "Производство мучных смесей и приготовление мучных смесей или теста для хлеба, тортов, бисквитов и блинов"
                           }]
                     },
                     {
                        id: "10.62",
                        title: "Производство крахмала и крахмалосодержащих продуктов",
                        children: [
                           {
                              id: "10.62.1",
                              title: "Производство крахмала"
                           },
                           {
                              id: "10.62.2",
                              title: "Производство нерафинированного кукурузного масла и его фракций"
                           },
                           {
                              id: "10.62.3",
                              title: "Производство рафинированного кукурузного масла и его фракций"
                           },
                           {
                              id: "10.62.9",
                              title: "Производство прочих крахмалосодержащих продуктов"
                           }]
                     }]
               },
               {
                  id: "10.7",
                  title: "Производство хлебобулочных и мучных кондитерских изделий",
                  children: [
                     {
                        id: "10.71",
                        title: "Производство хлеба и мучных кондитерских изделий, тортов и пирожных недлительного хранения",
                        children: [
                           {
                              id: "10.71.1",
                              title: "Производство хлеба и хлебобулочных изделий недлительного хранения"
                           },
                           {
                              id: "10.71.2",
                              title: "Производство мучных кондитерских изделий, тортов и пирожных недлительного хранения"
                           },
                           {
                              id: "10.71.3",
                              title: "Производство охлажденных хлебобулочных полуфабрикатов"
                           }]
                     },
                     {
                        id: "10.72",
                        title: "Производство сухарей, печенья и прочих сухарных хлебобулочных изделий, производство мучных кондитерских изделий, тортов, пирожных, пирогов и бисквитов, предназначенных для длительного хранения",
                        children: [
                           {
                              id: "10.72.1",
                              title: "Производство хрустящих хлебцев, сухарей и прочих сухарных хлебобулочных изделий"
                           },
                           {
                              id: "10.72.2",
                              title: "Производство тортов и пирожных длительного хранения"
                           },
                           {
                              id: "10.72.3",
                              title: "Производство прочих мучных кондитерских изделий длительного хранения",
                              children: [
                                 {
                                    id: "10.72.31",
                                    title: "Производство печенья"
                                 },
                                 {
                                    id: "10.72.32",
                                    title: "Производство пряников и коврижек"
                                 },
                                 {
                                    id: "10.72.33",
                                    title: "Производство вафель"
                                 },
                                 {
                                    id: "10.72.34",
                                    title: "Производство галет и крекеров"
                                 },
                                 {
                                    id: "10.72.35",
                                    title: "Производство кексов, рулетов и аналогичных изделий длительного хранения"
                                 },
                                 {
                                    id: "10.72.39",
                                    title: "Производство восточных сладостей и прочих мучных кондитерских изделий"
                                 }]
                           },
                           {
                              id: "10.72.4",
                              title: "Производство замороженных хлебобулочных полуфабрикатов"
                           }]
                     },
                     {
                        id: "10.73",
                        title: "Производство макаронных изделий кускуса и аналогичных мучных изделий",
                        children: [
                           {
                              id: "10.73.1",
                              title: "Производство макаронных изделий"
                           },
                           {
                              id: "10.73.2",
                              title: "Производство кускуса"
                           },
                           {
                              id: "10.73.3",
                              title: "Производство консервированных или замороженных макаронных изделий"
                           }]
                     }]
               },
               {
                  id: "10.8",
                  title: "Производство прочих пищевых продуктов",
                  children: [
                     {
                        id: "10.81",
                        title: "Производство сахара",
                        children: [
                           {
                              id: "10.81.1",
                              title: "Производство сахара из сахарной свеклы и тростникового сырца",
                              children: [
                                 {
                                    id: "10.81.11",
                                    title: "Производство сахара из сахарной свеклы"
                                 },
                                 {
                                    id: "10.81.12",
                                    title: "Производство сахара из тростникового сырца"
                                 }]
                           },
                           {
                              id: "10.81.2",
                              title: "Производство сахарного сиропа"
                           },
                           {
                              id: "10.81.3",
                              title: "Производство мелассы"
                           }]
                     },
                     {
                        id: "10.82",
                        title: "Производство какао, шоколада и сахаристых кондитерских изделий",
                        children: [
                           {
                              id: "10.82.1",
                              title: "Производство какао, масла какао, жира какао, растительного масла какао, порошка какао"
                           },
                           {
                              id: "10.82.2",
                              title: "Производство шоколада и сахаристых кондитерских изделий"
                           },
                           {
                              id: "10.82.3",
                              title: "Производство кондитерских изделий из сахара"
                           },
                           {
                              id: "10.82.4",
                              title: "Производство жевательной резинки"
                           },
                           {
                              id: "10.82.5",
                              title: "Производство засахаренных фруктов, орехов, цукатов из кожуры и прочих частей растений"
                           },
                           {
                              id: "10.82.6",
                              title: "Производство кондитерских леденцов и пастилок"
                           }]
                     },
                     {
                        id: "10.83",
                        title: "Производство чая и кофе"
                     },
                     {
                        id: "10.84",
                        title: "Производство приправ и пряностей"
                     },
                     {
                        id: "10.85",
                        title: "Производство готовых пищевых продуктов и блюд"
                     },
                     {
                        id: "10.86",
                        title: "Производство детского питания и диетических пищевых продуктов",
                        children: [
                           {
                              id: "10.86.1",
                              title: "Производство молока и молочных продуктов для детского питания",
                              children: [
                                 {
                                    id: "10.86.11",
                                    title: "Производство молока и молочных продуктов для детей раннего возраста"
                                 },
                                 {
                                    id: "10.86.12",
                                    title: "Производство молока и молочных продуктов для детей дошкольного и школьного возраста"
                                 }]
                           },
                           {
                              id: "10.86.2",
                              title: "Производство соковой продукции из фруктов и овощей для детского питания"
                           },
                           {
                              id: "10.86.3",
                              title: "Производство мясной продукции для детского питания, в том числе из мяса птицы"
                           },
                           {
                              id: "10.86.4",
                              title: "Производство продуктов на злаковой основе для детского питания"
                           },
                           {
                              id: "10.86.5",
                              title: "Производство продуктов детского питания профилактического и лечебного назначения"
                           },
                           {
                              id: "10.86.6",
                              title: "Производство специализированной пищевой продукции, в том числе диетических пищевых продуктов",
                              children: [
                                 {
                                    id: "10.86.61",
                                    title: "Производство пищевой продукции диетического и диабетического питания"
                                 },
                                 {
                                    id: "10.86.62",
                                    title: "Производство пищевой продукции для питания спортсменов"
                                 },
                                 {
                                    id: "10.86.63",
                                    title: "Производство пищевой продукции для питания беременных и кормящих женщин"
                                 },
                                 {
                                    id: "10.86.64",
                                    title: "Производство пищевой продукции энтерального питания"
                                 },
                                 {
                                    id: "10.86.69",
                                    title: "Производство прочих диетических пищевых продуктов"
                                 }]
                           },
                           {
                              id: "10.86.7",
                              title: "Производство воды питьевой, напитков безалкогольных для детского питания"
                           },
                           {
                              id: "10.86.8",
                              title: "Производство рыбной продукции для детского питания"
                           },
                           {
                              id: "10.86.9",
                              title: "Производство хлебобулочных и кондитерских изделий для детского питания"
                           }]
                     },
                     {
                        id: "10.89",
                        title: "Производство прочих пищевых продуктов, не включенных в другие группировки",
                        children: [
                           {
                              id: "10.89.1",
                              title: "Производство супов и бульонов"
                           },
                           {
                              id: "10.89.2",
                              title: "Производство скоропортящихся продуктов, таких как: сэндвичи и свежая пицца (полуфабрикат)"
                           },
                           {
                              id: "10.89.3",
                              title: "Производство растительных соков и экстрактов, пептических веществ, растительных клеев и загустителей"
                           },
                           {
                              id: "10.89.4",
                              title: "Производство пищевых ферментов"
                           },
                           {
                              id: "10.89.5",
                              title: "Производство искусственного меда и карамели"
                           },
                           {
                              id: "10.89.6",
                              title: "Переработка меда (темперирование, фильтрация, декристаллизация и смешивание меда)"
                           },
                           {
                              id: "10.89.7",
                              title: "Производство рационов питания и пайков"
                           },
                           {
                              id: "10.89.8",
                              title: "Производство биологически активных добавок к пище"
                           },
                           {
                              id: "10.89.9",
                              title: "Производство прочих продуктов питания, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "10.9",
                  title: "Производство готовых кормов для животных",
                  children: [
                     {
                        id: "10.91",
                        title: "Производство готовых кормов для животных, содержащихся на фермах",
                        children: [
                           {
                              id: "10.91.1",
                              title: "Производство готовых кормов (смешанных и несмешанных), кроме муки и гранул из люцерны, для животных, содержащихся на фермах"
                           },
                           {
                              id: "10.91.2",
                              title: "Производство муки грубого помола и гранул из люцерны"
                           },
                           {
                              id: "10.91.3",
                              title: "Производство кормового микробиологического белка, премиксов, кормовых витаминов, антибиотиков, аминокислот и ферментов"
                           }]
                     },
                     {
                        id: "10.92",
                        title: "Производство готовых кормов для непродуктивных животных"
                     }]
               }]
         },
         {
            id: "11",
            title: "Производство напитков",
            children: [
               {
                  id: "11.0",
                  title: "Производство напитков",
                  children: [
                     {
                        id: "11.01",
                        title: "Перегонка, очистка и смешивание спиртов",
                        children: [
                           {
                              id: "11.01.1",
                              title: "Производство дистиллированных питьевых алкогольных напитков: водки, виски, бренди, джина, ликеров и т.п."
                           },
                           {
                              id: "11.01.2",
                              title: "Производство напитков, смешанных с дистиллированными алкогольными напитками"
                           },
                           {
                              id: "11.01.3",
                              title: "Смешивание дистиллированных спиртов"
                           },
                           {
                              id: "11.01.4",
                              title: "Производство пищевого спирта"
                           }]
                     },
                     {
                        id: "11.02",
                        title: "Производство вина из винограда"
                     },
                     {
                        id: "11.03",
                        title: "Производство сидра и прочих плодовых вин"
                     },
                     {
                        id: "11.04",
                        title: "Производство прочих недистиллированных напитков из сброженных материалов"
                     },
                     {
                        id: "11.05",
                        title: "Производство пива"
                     },
                     {
                        id: "11.06",
                        title: "Производство солода"
                     },
                     {
                        id: "11.07",
                        title: "Производство безалкогольных напитков; производство минеральных вод и прочих питьевых вод в бутылках",
                        children: [
                           {
                              id: "11.07.1",
                              title: "Производство минеральных вод"
                           },
                           {
                              id: "11.07.2",
                              title: "Производство безалкогольных напитков ароматизированных и/или с добавлением сахара, кроме минеральных вод"
                           }]
                     }]
               }]
         },
         {
            id: "12",
            title: "Производство табачных изделий",
            children: [
               {
                  id: "12.0",
                  title: "Производство табачных изделий",
                  children: [
                     {
                        id: "12.00",
                        title: "Производство табачных изделий",
                        children: [
                           {
                              id: "12.00.1",
                              title: "Производство изделий из табака и махорки: сигарет, папирос, сигар, сигарилл, курительного тонкорезаного табака, трубочного табака, жевательного табака, сосательного табака, нюхательного табака, табака для кальяна, курительной и нюхательной махорки"
                           },
                           {
                              id: "12.00.2",
                              title: "Производство гомогенизированного или восстановленного табака"
                           },
                           {
                              id: "12.00.3",
                              title: "Стрипсование (удаление главной жилки) и редраинг-обработка табака"
                           }]
                     }]
               }]
         },
         {
            id: "13",
            title: "Производство текстильных изделий",
            children: [
               {
                  id: "13.1",
                  title: "Подготовка и прядение текстильных волокон",
                  children: [
                     {
                        id: "13.10",
                        title: "Подготовка и прядение текстильных волокон",
                        children: [
                           {
                              id: "13.10.1",
                              title: "Прядение хлопчатобумажных волокон"
                           },
                           {
                              id: "13.10.2",
                              title: "Прядение кардное шерстяных волокон"
                           },
                           {
                              id: "13.10.3",
                              title: "Прядение гребенное шерстяных волокон"
                           },
                           {
                              id: "13.10.4",
                              title: "Прядение льняных волокон"
                           },
                           {
                              id: "13.10.5",
                              title: "Изготовление натуральных шелковых, искусственных и синтетических волокон"
                           },
                           {
                              id: "13.10.6",
                              title: "Производство швейных ниток"
                           },
                           {
                              id: "13.10.9",
                              title: "Подготовка и прядение прочих текстильных волокон"
                           }]
                     }]
               },
               {
                  id: "13.2",
                  title: "Производство текстильных тканей",
                  children: [
                     {
                        id: "13.20",
                        title: "Производство текстильных тканей",
                        children: [
                           {
                              id: "13.20.1",
                              title: "Производство тканей (без специальных тканей) из натуральных волокон, кроме хлопка",
                              children: [
                                 {
                                    id: "13.20.11",
                                    title: "Производство шелковых тканей"
                                 },
                                 {
                                    id: "13.20.12",
                                    title: "Производство шерстяных тканей"
                                 },
                                 {
                                    id: "13.20.13",
                                    title: "Производство льняных тканей"
                                 },
                                 {
                                    id: "13.20.14",
                                    title: "Производство тканей из джутовых и прочих лубяных текстильных волокон"
                                 },
                                 {
                                    id: "13.20.19",
                                    title: "Производство ткани из прочих растительных текстильных волокон; ткани из бумажной пряжи"
                                 }]
                           },
                           {
                              id: "13.20.2",
                              title: "Производство хлопчатобумажных тканей"
                           },
                           {
                              id: "13.20.3",
                              title: "Производство тканей, за исключением специальных тканей, из химических комплексных нитей и штапельных волокон"
                           },
                           {
                              id: "13.20.4",
                              title: "Производство ворсовых, махровых полотенечных тканей и прочих специальных тканей",
                              children: [
                                 {
                                    id: "13.20.41",
                                    title: "Производство ворсовых тканей и ткани из синели"
                                 },
                                 {
                                    id: "13.20.42",
                                    title: "Производство хлопчатобумажных махровых полотенечных тканей"
                                 },
                                 {
                                    id: "13.20.43",
                                    title: "Производство прочих махровых полотенечных и аналогичных махровых тканей"
                                 },
                                 {
                                    id: "13.20.44",
                                    title: "Производство марли"
                                 },
                                 {
                                    id: "13.20.45",
                                    title: "Производство ворсовых тканей"
                                 },
                                 {
                                    id: "13.20.46",
                                    title: "Производство тканей из стекловолокна"
                                 }]
                           },
                           {
                              id: "13.20.5",
                              title: "Производство искусственного меха ткацким способом"
                           },
                           {
                              id: "13.20.6",
                              title: "Производство арамидных нитей и волокна"
                           }]
                     }]
               },
               {
                  id: "13.3",
                  title: "Отделка тканей и текстильных изделий",
                  children: [
                     {
                        id: "13.30",
                        title: "Отделка тканей и текстильных изделий",
                        children: [
                           {
                              id: "13.30.1",
                              title: "Отбеливание и окрашивание текстиля, волокон, тканей и текстильных изделий, включая готовую одежду"
                           },
                           {
                              id: "13.30.2",
                              title: "Аппретирование, сушка, обработка паром, декатировка, противоусадочная отделка, смягчение тканей и текстильных изделий, включая готовую одежду"
                           },
                           {
                              id: "13.30.3",
                              title: "Плиссировка и подобные работы на текстильных материалах"
                           },
                           {
                              id: "13.30.4",
                              title: "Нанесение водозащитного слоя, специальных покрытий, прорезинивание, пропитка приобретенной одежды"
                           },
                           {
                              id: "13.30.5",
                              title: "Нанесение рисунка на текстильные изделия и готовую одежду"
                           }]
                     }]
               },
               {
                  id: "13.9",
                  title: "Производство прочих текстильных изделий",
                  children: [
                     {
                        id: "13.91",
                        title: "Производство трикотажного и вязаного полотна",
                        children: [
                           {
                              id: "13.91.1",
                              title: "Производство и обработка трикотажного или вязаного полотна"
                           },
                           {
                              id: "13.91.2",
                              title: "Производство искусственного меха методом вязания"
                           }]
                     },
                     {
                        id: "13.92",
                        title: "Производство готовых текстильных изделий, кроме одежды",
                        children: [
                           {
                              id: "13.92.1",
                              title: "Производство готовых текстильных изделий, кроме одежды"
                           },
                           {
                              id: "13.92.2",
                              title: "Пошив готовых текстильных изделий по индивидуальному заказу населения, кроме одежды"
                           }]
                     },
                     {
                        id: "13.93",
                        title: "Производство ковров и ковровых изделий"
                     },
                     {
                        id: "13.94",
                        title: "Производство канатов, веревок, шпагата и сетей",
                        children: [
                           {
                              id: "13.94.1",
                              title: "Производство шпагата, канатов, веревок и тросов из текстильных волокон и лент, с пропиткой и без пропитки, с покрытием, защищенных или не защищенных оболочкой из резины или пластмассы"
                           },
                           {
                              id: "13.94.2",
                              title: "Производство изделий из веревки и сетного полотна: рыболовных сетей, предохранительных сеток на судах, защитных средств, используемых при погрузочно-разгрузочных работах, стропов, веревок или тросов с металлическими кольцами"
                           }]
                     },
                     {
                        id: "13.95",
                        title: "Производство нетканых текстильных материалов и изделий из них, кроме одежды"
                     },
                     {
                        id: "13.96",
                        title: "Производство прочих технических и промышленных текстильных изделий",
                        children: [
                           {
                              id: "13.96.1",
                              title: "Производство металлизированной пряжи или металлизированной позументной тесьмы"
                           },
                           {
                              id: "13.96.2",
                              title: "Производство ткани из металлической нити и ткани из металлизированной пряжи"
                           },
                           {
                              id: "13.96.3",
                              title: "Производство резиновых нитей и шнуров с текстильным покрытием; производство текстильных нитей и лент, пропитанных или с пластмассовым или резиновым покрытием"
                           },
                           {
                              id: "13.96.4",
                              title: "Производство текстильных материалов, пропитанных или с покрытием"
                           },
                           {
                              id: "13.96.5",
                              title: "Производство кордных тканей"
                           },
                           {
                              id: "13.96.6",
                              title: "Производство текстильных материалов и изделий технического назначения (включая фитили, калильные сетки газовых фонарей, текстильные шланги, конвейерные ленты и приводные ремни, ситовые ткани и фильтровальные ткани)"
                           },
                           {
                              id: "13.96.7",
                              title: "Производство узких текстильных тканей, в том числе состоящих из основы безуточного переплетения и соединяемых клеящим веществом"
                           }]
                     },
                     {
                        id: "13.99",
                        title: "Производство прочих текстильных изделий, не включенных в другие группировки",
                        children: [
                           {
                              id: "13.99.1",
                              title: "Производство кружевного сетчатого и гардинно-тюлевого полотна, а также кружев и вышитых изделий, в кусках, в форме полос или отдельных вышивок"
                           },
                           {
                              id: "13.99.2",
                              title: "Производство фетра и войлока"
                           },
                           {
                              id: "13.99.3",
                              title: "Производство ваты из текстильных материалов"
                           },
                           {
                              id: "13.99.4",
                              title: "Изготовление прочих текстильных изделий по индивидуальному заказу населения, не включенных в другие группировки"
                           },
                           {
                              id: "13.99.9",
                              title: "Производство текстильных изделий различного назначения, не включенных в другие группировки"
                           }]
                     }]
               }]
         },
         {
            id: "14",
            title: "Производство одежды",
            children: [
               {
                  id: "14.1",
                  title: "Производство одежды, кроме одежды из меха",
                  children: [
                     {
                        id: "14.11",
                        title: "Производство одежды из кожи",
                        children: [
                           {
                              id: "14.11.1",
                              title: "Производство одежды из кожи, кроме изготовленных по индивидуальному заказу"
                           },
                           {
                              id: "14.11.2",
                              title: "Пошив одежды из кожи по индивидуальному заказу населения"
                           }]
                     },
                     {
                        id: "14.12",
                        title: "Производство спецодежды",
                        children: [
                           {
                              id: "14.12.1",
                              title: "Производство спецодежды, кроме изготовленных по индивидуальному заказу"
                           },
                           {
                              id: "14.12.2",
                              title: "Пошив производственной одежды по индивидуальному заказу населения"
                           }]
                     },
                     {
                        id: "14.13",
                        title: "Производство прочей верхней одежды",
                        children: [
                           {
                              id: "14.13.1",
                              title: "Производство верхней трикотажной или вязаной одежды",
                              children: [
                                 {
                                    id: "14.13.11",
                                    title: "Производство верхней трикотажной или вязаной одежды для мужчин или мальчиков"
                                 },
                                 {
                                    id: "14.13.12",
                                    title: "Производство верхней трикотажной или вязаной одежды для женщин или девочек"
                                 }]
                           },
                           {
                              id: "14.13.2",
                              title: "Производство верхней одежды из текстильных материалов, кроме трикотажных или вязаных",
                              children: [
                                 {
                                    id: "14.13.21",
                                    title: "Производство верхней одежды из текстильных материалов, кроме трикотажных или вязаных, для мужчин или мальчиков"
                                 },
                                 {
                                    id: "14.13.22",
                                    title: "Производство верхней одежды из текстильных материалов, кроме трикотажных или вязаных, женщин или девочек"
                                 }]
                           },
                           {
                              id: "14.13.3",
                              title: "Пошив и вязание прочей верхней одежды по индивидуальному заказу населения"
                           }]
                     },
                     {
                        id: "14.14",
                        title: "Производство нательного белья",
                        children: [
                           {
                              id: "14.14.1",
                              title: "Производство трикотажного и вязаного нательного белья",
                              children: [
                                 {
                                    id: "14.14.11",
                                    title: "Производство трикотажных или вязаных рубашек для мужчин или для мальчиков"
                                 },
                                 {
                                    id: "14.14.12",
                                    title: "Производство маек и прочего трикотажного или вязаного нательного белья для мужчин или мальчиков"
                                 },
                                 {
                                    id: "14.14.13",
                                    title: "Производство трикотажных или вязаных блузок, рубашек и батников для женщин или для девочек"
                                 },
                                 {
                                    id: "14.14.14",
                                    title: "Производство маек и прочего трикотажного или вязаного нательного белья для женщин или для девочек"
                                 }]
                           },
                           {
                              id: "14.14.2",
                              title: "Производство нательного белья из тканей",
                              children: [
                                 {
                                    id: "14.14.21",
                                    title: "Производство рубашек из текстильных материалов, кроме трикотажных или вязаных, для мужчин или для мальчиков"
                                 },
                                 {
                                    id: "14.14.22",
                                    title: "Производство маек и прочего нательного белья из текстильных материалов, кроме трикотажных или вязаных, для мужчин или для мальчиков"
                                 },
                                 {
                                    id: "14.14.23",
                                    title: "Производство блузок, рубашек и батников из текстильных материалов, кроме трикотажных или вязаных, для женщин или для девочек"
                                 },
                                 {
                                    id: "14.14.24",
                                    title: "Производство маек и прочего нательного белья из текстильных материалов, кроме трикотажных или вязаных, для женщин или для девочек"
                                 },
                                 {
                                    id: "14.14.25",
                                    title: "Производство бюстгальтеров, поясов, корсетов и аналогичных изделий, и их частей из любого текстильного материала, включая трикотажные или вязаные"
                                 }]
                           },
                           {
                              id: "14.14.3",
                              title: "Производство трикотажных или вязаных футболок, маек и прочих нижних рубашек"
                           },
                           {
                              id: "14.14.4",
                              title: "Пошив нательного белья по индивидуальному заказу населения"
                           }]
                     },
                     {
                        id: "14.19",
                        title: "Производство прочей одежды и аксессуаров одежды",
                        children: [
                           {
                              id: "14.19.1",
                              title: "Производство трикотажной или вязаной одежды для детей младшего возраста, спортивной или прочей одежды, аксессуаров и деталей одежды",
                              children: [
                                 {
                                    id: "14.19.11",
                                    title: "Производство трикотажных или вязаных одежды и аксессуаров одежды для детей младшего возраста"
                                 },
                                 {
                                    id: "14.19.12",
                                    title: "Производство спортивных костюмов, лыжных костюмов, купальных костюмов и прочей трикотажной или вязаной одежды"
                                 },
                                 {
                                    id: "14.19.13",
                                    title: "Производство трикотажных или вязаных перчаток, рукавиц (варежек) и митенок"
                                 },
                                 {
                                    id: "14.19.19",
                                    title: "Производство прочих трикотажных или вязаных аксессуаров одежды, в том числе платков, шарфов, галстуков и прочих аналогичных изделий"
                                 }]
                           },
                           {
                              id: "14.19.2",
                              title: "Производство одежды для детей младшего возраста, спортивной или прочей одежды и аксессуаров одежды из текстильных материалов, кроме трикотажных или вязаных",
                              children: [
                                 {
                                    id: "14.19.21",
                                    title: "Производство одежды и аксессуаров одежды для детей младшего возраста из текстильных материалов, кроме трикотажных или вязаных"
                                 },
                                 {
                                    id: "14.19.22",
                                    title: "Производство спортивных костюмов, лыжных костюмов, купальных костюмов и прочей одежды из текстильных материалов, кроме трикотажных или вязаных"
                                 },
                                 {
                                    id: "14.19.23",
                                    title: "Производство аксессуаров одежды, в том числе платков, шарфов, галстуков, перчаток и прочих аналогичных изделий из текстильных материалов, кроме трикотажных или вязаных"
                                 }]
                           },
                           {
                              id: "14.19.3",
                              title: "Производство аксессуаров одежды из кожи; производство одежды из фетра или нетканых материалов; производство одежды из текстильных материалов с покрытием",
                              children: [
                                 {
                                    id: "14.19.31",
                                    title: "Производство аксессуаров одежды из натуральной или композиционной кожи"
                                 },
                                 {
                                    id: "14.19.32",
                                    title: "Производство одежды из фетра, нетканых материалов, из текстильных материалов с пропиткой или покрытием"
                                 }]
                           },
                           {
                              id: "14.19.4",
                              title: "Производство головных уборов"
                           },
                           {
                              id: "14.19.5",
                              title: "Пошив и вязание прочей одежды и аксессуаров одежды, головных уборов по индивидуальному заказу населения"
                           }]
                     }]
               },
               {
                  id: "14.2",
                  title: "Производство меховых изделий",
                  children: [
                     {
                        id: "14.20",
                        title: "Производство меховых изделий",
                        children: [
                           {
                              id: "14.20.1",
                              title: "Производство меховых изделий, кроме изготовленных по индивидуальному заказу"
                           },
                           {
                              id: "14.20.2",
                              title: "Пошив меховых изделий по индивидуальному заказу населения"
                           }]
                     }]
               },
               {
                  id: "14.3",
                  title: "Производство вязаных и трикотажных изделий одежды",
                  children: [
                     {
                        id: "14.31",
                        title: "Производство вязаных и трикотажных чулочно-носочных изделий",
                        children: [
                           {
                              id: "14.31.1",
                              title: "Производство вязаных и трикотажных чулочно-носочных изделий, кроме изготовленных по индивидуальному заказу"
                           },
                           {
                              id: "14.31.2",
                              title: "Изготовление вязаных и трикотажных чулочно-носочных изделий по индивидуальному заказу населения"
                           }]
                     },
                     {
                        id: "14.39",
                        title: "Производство прочих вязаных и трикотажных изделий",
                        children: [
                           {
                              id: "14.39.1",
                              title: "Производство прочих вязаных и трикотажных изделий, не включенных в другие группировки"
                           },
                           {
                              id: "14.39.2",
                              title: "Изготовление прочих вязаных и трикотажных изделий, не включенных в другие группировки по индивидуальному заказу населения"
                           }]
                     }]
               }]
         },
         {
            id: "15",
            title: "Производство кожи и изделий из кожи",
            children: [
               {
                  id: "15.1",
                  title: "Дубление и отделка кожи, производство чемоданов, сумок, шорно-седельных изделий из кожи; выделка и крашение меха",
                  children: [
                     {
                        id: "15.11",
                        title: "Дубление и выделка кожи, выделка и крашение меха",
                        children: [
                           {
                              id: "15.11.1",
                              title: "Выделка и крашение меха"
                           },
                           {
                              id: "15.11.2",
                              title: "Производство замши, пергаментной кожи, лакированной и металлизированной кожи"
                           },
                           {
                              id: "15.11.3",
                              title: "Дубление, выделка и крашение кожи из шкур крупного рогатого скота или животных семейства лошадиных"
                           },
                           {
                              id: "15.11.4",
                              title: "Дубление, выделка и крашение кожи из шкур овец, коз и свиней"
                           },
                           {
                              id: "15.11.5",
                              title: "Дубление, выделка и крашение кожи из шкур прочих животных, производство композиционной кожи",
                              children: [
                                 {
                                    id: "15.11.51",
                                    title: "Дубление, выделка и крашение кожи из шкур прочих животных"
                                 },
                                 {
                                    id: "15.11.52",
                                    title: "Производство композиционной кожи"
                                 }]
                           }]
                     },
                     {
                        id: "15.12",
                        title: "Производство чемоданов, дамских сумок и аналогичных изделий из кожи и других материалов; производство шорно-седельных и других изделий из кожи"
                     }]
               },
               {
                  id: "15.2",
                  title: "Производство обуви",
                  children: [
                     {
                        id: "15.20",
                        title: "Производство обуви",
                        children: [
                           {
                              id: "15.20.1",
                              title: "Производство обуви, кроме спортивной, защитной и ортопедической",
                              children: [
                                 {
                                    id: "15.20.11",
                                    title: "Производство водонепроницаемой обуви с верхом из резины или пластмассы"
                                 },
                                 {
                                    id: "15.20.12",
                                    title: "Производство обуви с верхом из резины и пластмассы, кроме водопроницаемой"
                                 },
                                 {
                                    id: "15.20.13",
                                    title: "Производство обуви с верхом из кожи, кроме спортивной обуви, обуви с защитным металлическим подноском и различной специальной обуви"
                                 },
                                 {
                                    id: "15.20.14",
                                    title: "Производство обуви с верхом из текстильных материалов, кроме спортивной обуви"
                                 }]
                           },
                           {
                              id: "15.20.2",
                              title: "Производство спортивной обуви"
                           },
                           {
                              id: "15.20.3",
                              title: "Производство защитной обуви",
                              children: [
                                 {
                                    id: "15.20.31",
                                    title: "Производство обуви с защитным металлическим подноском"
                                 },
                                 {
                                    id: "15.20.32",
                                    title: "Производство деревянной и различной специальной обуви"
                                 }]
                           },
                           {
                              id: "15.20.4",
                              title: "Производство деталей обуви из кожи; вкладных стелек, подпяточников и аналогичных изделий; производство гетр, гамашей и аналогичных изделий",
                              children: [
                                 {
                                    id: "15.20.41",
                                    title: "Производство деталей обуви из кожи; вкладных стелек, подпяточников и аналогичных изделий"
                                 },
                                 {
                                    id: "15.20.42",
                                    title: "Производство гетр, гамашей и аналогичных изделий"
                                 }]
                           },
                           {
                              id: "15.20.5",
                              title: "Пошив обуви и различных дополнений к обуви по индивидуальному заказу населения"
                           }]
                     }]
               }]
         },
         {
            id: "16",
            title: "Обработка древесины и производство изделий из дерева и пробки, кроме мебели, производство изделий из соломки и материалов для плетения",
            children: [
               {
                  id: "16.1",
                  title: "Распиловка и строгание древесины",
                  children: [
                     {
                        id: "16.10",
                        title: "Распиловка и строгание древесины",
                        children: [
                           {
                              id: "16.10.1",
                              title: "Производство пиломатериалов, кроме профилированных, толщиной более 6 мм; производство непропитанных железнодорожных и трамвайных шпал из древесины"
                           },
                           {
                              id: "16.10.2",
                              title: "Производство пиломатериалов, профилированных по кромке; производство древесного полотна, древесной муки; производство технологической щепы или стружки"
                           },
                           {
                              id: "16.10.3",
                              title: "Производство древесины, пропитанной или обработанной защитными или другими веществами"
                           },
                           {
                              id: "16.10.9",
                              title: "Предоставление услуг по пропитке древесины"
                           }]
                     }]
               },
               {
                  id: "16.2",
                  title: "Производство изделий из дерева, пробки, соломки и материалов для плетения",
                  children: [
                     {
                        id: "16.21",
                        title: "Производство шпона, фанеры, деревянных плит и панелей",
                        children: [
                           {
                              id: "16.21.1",
                              title: "Производство фанеры, деревянных фанерованных панелей и аналогичных слоистых материалов, древесных плит из древесины и других одревесневших материалов",
                              children: [
                                 {
                                    id: "16.21.11",
                                    title: "Производство фанеры, деревянных фанерованных панелей и аналогичных слоистых материалов"
                                 },
                                 {
                                    id: "16.21.12",
                                    title: "Производство древесно-стружечных плит из древесины или других одревесневших материалов"
                                 },
                                 {
                                    id: "16.21.13",
                                    title: "Производство древесно-волокнистых плит из древесины или других одревесневших материалов"
                                 }]
                           },
                           {
                              id: "16.21.2",
                              title: "Производство листов для облицовки, шпона для фанеры, производство прессованной древесины",
                              children: [
                                 {
                                    id: "16.21.21",
                                    title: "Производство листов для облицовки, шпона для фанеры"
                                 },
                                 {
                                    id: "16.21.22",
                                    title: "Производство прессованной древесины"
                                 }]
                           }]
                     },
                     {
                        id: "16.22",
                        title: "Производство сборных паркетных покрытий"
                     },
                     {
                        id: "16.23",
                        title: "Производство прочих деревянных строительных конструкций и столярных изделий",
                        children: [
                           {
                              id: "16.23.1",
                              title: "Производство деревянных строительных конструкций и столярных изделий"
                           },
                           {
                              id: "16.23.2",
                              title: "Производство сборных деревянных строений"
                           }]
                     },
                     {
                        id: "16.24",
                        title: "Производство деревянной тары"
                     },
                     {
                        id: "16.29",
                        title: "Производство прочих деревянных изделий; производство изделий из пробки, соломки и материалов для плетения",
                        children: [
                           {
                              id: "16.29.1",
                              title: "Производство прочих деревянных изделий",
                              children: [
                                 {
                                    id: "16.29.11",
                                    title: "Производство деревянных инструментов, корпусов и рукояток инструментов, рукояток щеток и метелок, обувных колодок и растяжек для обуви"
                                 },
                                 {
                                    id: "16.29.12",
                                    title: "Производство деревянных столовых и кухонных принадлежностей"
                                 },
                                 {
                                    id: "16.29.13",
                                    title: "Производство деревянных статуэток и украшений из дерева, мозаики и инкрустированного дерева, шкатулок, футляров для ювелирных изделий или ножей"
                                 },
                                 {
                                    id: "16.29.14",
                                    title: "Производство деревянных рам для картин, фотографий, зеркал или аналогичных предметов и прочих изделий из дерева"
                                 },
                                 {
                                    id: "16.29.15",
                                    title: "Производство топливных гранул и брикетов из отходов деревопереработки"
                                 }]
                           },
                           {
                              id: "16.29.2",
                              title: "Производство изделий из пробки, соломки и материалов для плетения; производство корзиночных и плетеных изделий",
                              children: [
                                 {
                                    id: "16.29.21",
                                    title: "Производство изделий из пробки"
                                 },
                                 {
                                    id: "16.29.22",
                                    title: "Производство изделий из соломки, эспарто (альфы) и прочих материалов для плетения"
                                 },
                                 {
                                    id: "16.29.23",
                                    title: "Производство корзиночных и плетеных изделий"
                                 }]
                           },
                           {
                              id: "16.29.3",
                              title: "Изготовление изделий из дерева, пробки, соломки и материалов для плетения, корзиночных и плетеных изделий по индивидуальному заказу населения"
                           }]
                     }]
               }]
         },
         {
            id: "17",
            title: "Производство бумаги и бумажных изделий",
            children: [
               {
                  id: "17.1",
                  title: "Производство целлюлозы, древесной массы, бумаги и картона",
                  children: [
                     {
                        id: "17.11",
                        title: "Производство целлюлозы и древесной массы",
                        children: [
                           {
                              id: "17.11.1",
                              title: "Производство целлюлозы"
                           },
                           {
                              id: "17.11.2",
                              title: "Производство древесной массы"
                           },
                           {
                              id: "17.11.9",
                              title: "Производство прочих волокнистых полуфабрикатов"
                           }]
                     },
                     {
                        id: "17.12",
                        title: "Производство бумаги и картона",
                        children: [
                           {
                              id: "17.12.1",
                              title: "Производство бумаги"
                           },
                           {
                              id: "17.12.2",
                              title: "Производство картона"
                           }]
                     }]
               },
               {
                  id: "17.2",
                  title: "Производство изделий из бумаги и картона",
                  children: [
                     {
                        id: "17.21",
                        title: "Производство гофрированной бумаги и картона, бумажной и картонной тары"
                     },
                     {
                        id: "17.22",
                        title: "Производство бумажных изделий хозяйственно-бытового и санитарно-гигиенического назначения"
                     },
                     {
                        id: "17.23",
                        title: "Производство бумажных канцелярских принадлежностей"
                     },
                     {
                        id: "17.24",
                        title: "Производство обоев"
                     },
                     {
                        id: "17.29",
                        title: "Производство прочих изделий из бумаги и картона"
                     }]
               }]
         },
         {
            id: "18",
            title: "Деятельность полиграфическая и копирование носителей информации",
            children: [
               {
                  id: "18.1",
                  title: "Деятельность полиграфическая и предоставление услуг в этой области",
                  children: [
                     {
                        id: "18.11",
                        title: "Печатание газет"
                     },
                     {
                        id: "18.12",
                        title: "Прочие виды полиграфической деятельности"
                     },
                     {
                        id: "18.13",
                        title: "Изготовление печатных форм и подготовительная деятельность"
                     },
                     {
                        id: "18.14",
                        title: "Деятельность брошюровочно-переплетная и отделочная и сопутствующие услуги"
                     }]
               },
               {
                  id: "18.2",
                  title: "Копирование записанных носителей информации",
                  children: [
                     {
                        id: "18.20",
                        title: "Копирование записанных носителей информации"
                     }]
               }]
         },
         {
            id: "19",
            title: "Производство кокса и нефтепродуктов",
            children: [
               {
                  id: "19.1",
                  title: "Производство кокса",
                  children: [
                     {
                        id: "19.10",
                        title: "Производство кокса"
                     }]
               },
               {
                  id: "19.2",
                  title: "Производство нефтепродуктов",
                  children: [
                     {
                        id: "19.20",
                        title: "Производство нефтепродуктов",
                        children: [
                           {
                              id: "19.20.1",
                              title: "Производство жидкого топлива"
                           },
                           {
                              id: "19.20.2",
                              title: "Разделение и извлечение фракций из нефтяного (попутного) газа"
                           },
                           {
                              id: "19.20.9",
                              title: "Производство прочих нефтепродуктов"
                           }]
                     }]
               },
               {
                  id: "19.3",
                  title: "Агломерация угля, антрацита и бурого угля (лигнита) и производство термоуглей",
                  children: [
                     {
                        id: "19.31",
                        title: "Агломерация антрацита"
                     },
                     {
                        id: "19.32",
                        title: "Агломерация угля"
                     },
                     {
                        id: "19.33",
                        title: "Агломерация бурого угля (лигнита)"
                     },
                     {
                        id: "19.34",
                        title: "Производство термоуглей",
                        children: [
                           {
                              id: "19.34.1",
                              title: "Производство термоуглей из антрацита"
                           },
                           {
                              id: "19.34.2",
                              title: "Производство термоуглей из бурого угля (лигнита)"
                           },
                           {
                              id: "19.34.3",
                              title: "Производство термоуглей из угля за исключением антрацитов, лигнитов и угля каменного коксующегося"
                           }]
                     }]
               }]
         },
         {
            id: "20",
            title: "Производство химических веществ и химических продуктов",
            children: [
               {
                  id: "20.1",
                  title: "Производство основных химических веществ, удобрений и азотных соединений, пластмасс и синтетического каучука в первичных формах",
                  children: [
                     {
                        id: "20.11",
                        title: "Производство промышленных газов"
                     },
                     {
                        id: "20.12",
                        title: "Производство красителей и пигментов"
                     },
                     {
                        id: "20.13",
                        title: "Производство прочих основных неорганических химических веществ"
                     },
                     {
                        id: "20.14",
                        title: "Производство прочих основных органических химических веществ",
                        children: [
                           {
                              id: "20.14.1",
                              title: "Производство углеводородов и их производных"
                           },
                           {
                              id: "20.14.2",
                              title: "Производство спиртов, фенолов, фенолоспиртов и их галогенированных, сульфированных, нитрованных или нитрозированных производных; производство жирных промышленных спиртов"
                           },
                           {
                              id: "20.14.3",
                              title: "Производство промышленных монокарбоновых жирных кислот, карбоновых кислот и их производных"
                           },
                           {
                              id: "20.14.4",
                              title: "Производство органических соединений с азотсодержащими функциональными группами"
                           },
                           {
                              id: "20.14.5",
                              title: "Производство сераорганических соединений и прочих элементоорганических соединений"
                           },
                           {
                              id: "20.14.6",
                              title: "Производство простых эфиров, органических пероксидов, эпоксидов, ацеталей и полуацеталей, прочих органических соединений"
                           },
                           {
                              id: "20.14.7",
                              title: "Производство прочих химических органических основных веществ"
                           }]
                     },
                     {
                        id: "20.15",
                        title: "Производство удобрений и азотных соединений",
                        children: [
                           {
                              id: "20.15.1",
                              title: "Производство азотных кислот, сульфоазотных кислот, аммиака"
                           },
                           {
                              id: "20.15.2",
                              title: "Производство хлорида аммония, нитритов"
                           },
                           {
                              id: "20.15.3",
                              title: "Производство азотных минеральных или химических удобрений"
                           },
                           {
                              id: "20.15.4",
                              title: "Производство фосфорных минеральных или химических удобрений"
                           },
                           {
                              id: "20.15.5",
                              title: "Производство калийных минеральных или химических удобрений"
                           },
                           {
                              id: "20.15.6",
                              title: "Производство нитрата натрия"
                           },
                           {
                              id: "20.15.7",
                              title: "Производство удобрений, не включенных в другие группировки"
                           },
                           {
                              id: "20.15.8",
                              title: "Производство удобрений животного или растительного происхождения"
                           }]
                     },
                     {
                        id: "20.16",
                        title: "Производство пластмасс и синтетических смол в первичных формах"
                     },
                     {
                        id: "20.17",
                        title: "Производство синтетического каучука в первичных формах"
                     }]
               },
               {
                  id: "20.2",
                  title: "Производство пестицидов и прочих агрохимических продуктов",
                  children: [
                     {
                        id: "20.20",
                        title: "Производство пестицидов и прочих агрохимических продуктов"
                     }]
               },
               {
                  id: "20.3",
                  title: "Производство красок, лаков и аналогичных материалов для нанесения покрытий, полиграфических красок и мастик",
                  children: [
                     {
                        id: "20.30",
                        title: "Производство красок, лаков и аналогичных материалов для нанесения покрытий, полиграфических красок и мастик",
                        children: [
                           {
                              id: "20.30.1",
                              title: "Производство красок и лаков на основе полимеров"
                           },
                           {
                              id: "20.30.2",
                              title: "Производство прочих красок, лаков, эмалей и аналогичных материалов для нанесения покрытий, художественных и полиграфических красок"
                           }]
                     }]
               },
               {
                  id: "20.4",
                  title: "Производство мыла и моющих, чистящих и полирующих средств; парфюмерных и косметических средств",
                  children: [
                     {
                        id: "20.41",
                        title: "Производство мыла и моющих, чистящих и полирующих средств",
                        children: [
                           {
                              id: "20.41.1",
                              title: "Производство глицерина"
                           },
                           {
                              id: "20.41.2",
                              title: "Производство органических поверхностно-активных веществ, кроме мыла"
                           },
                           {
                              id: "20.41.3",
                              title: "Производство мыла и моющих средств, чистящих и полирующих средств"
                           },
                           {
                              id: "20.41.4",
                              title: "Производство средств для ароматизации и дезодорирования воздуха и восков"
                           }]
                     },
                     {
                        id: "20.42",
                        title: "Производство парфюмерных и косметических средств"
                     }]
               },
               {
                  id: "20.5",
                  title: "Производство прочих химических продуктов",
                  children: [
                     {
                        id: "20.51",
                        title: "Производство взрывчатых веществ"
                     },
                     {
                        id: "20.52",
                        title: "Производство клеев"
                     },
                     {
                        id: "20.53",
                        title: "Производство эфирных масел"
                     },
                     {
                        id: "20.59",
                        title: "Производство прочих химических продуктов, не включенных в другие группировки",
                        children: [
                           {
                              id: "20.59.1",
                              title: "Производство фотопластинок и фотопленок; фотопленок для моментальных фотоснимков; химических составов и несмешанных продуктов, используемых в фотографии"
                           },
                           {
                              id: "20.59.2",
                              title: "Производство химически модифицированных животных или растительных жиров и масел (включая олифу), непищевых смесей животных или растительных жиров и масел"
                           },
                           {
                              id: "20.59.3",
                              title: "Производство чернил для письма и рисования"
                           },
                           {
                              id: "20.59.4",
                              title: "Производство смазочных материалов, присадок к смазочным материалам и антифризов"
                           },
                           {
                              id: "20.59.5",
                              title: "Производство прочих химических продуктов, не включенных в другие группировки"
                           },
                           {
                              id: "20.59.6",
                              title: "Производство желатина и его производных"
                           }]
                     }]
               },
               {
                  id: "20.6",
                  title: "Производство химических волокон",
                  children: [
                     {
                        id: "20.60",
                        title: "Производство химических волокон",
                        children: [
                           {
                              id: "20.60.1",
                              title: "Производство синтетических волокон"
                           },
                           {
                              id: "20.60.2",
                              title: "Производство искусственных волокон"
                           }]
                     }]
               }]
         },
         {
            id: "21",
            title: "Производство лекарственных средств и материалов, применяемых в медицинских целях",
            children: [
               {
                  id: "21.1",
                  title: "Производство фармацевтических субстанций",
                  children: [
                     {
                        id: "21.10",
                        title: "Производство фармацевтических субстанций"
                     }]
               },
               {
                  id: "21.2",
                  title: "Производство лекарственных препаратов и материалов, применяемых в медицинских целях",
                  children: [
                     {
                        id: "21.20",
                        title: "Производство лекарственных препаратов и материалов, применяемых в медицинских целях",
                        children: [
                           {
                              id: "21.20.1",
                              title: "Производство лекарственных препаратов"
                           },
                           {
                              id: "21.20.2",
                              title: "Производство материалов, применяемых в медицинских целях"
                           }]
                     }]
               }]
         },
         {
            id: "22",
            title: "Производство резиновых и пластмассовых изделий",
            children: [
               {
                  id: "22.1",
                  title: "Производство резиновых изделий",
                  children: [
                     {
                        id: "22.11",
                        title: "Производство резиновых шин, покрышек и камер; восстановление резиновых шин и покрышек"
                     },
                     {
                        id: "22.19",
                        title: "Производство прочих резиновых изделий",
                        children: [
                           {
                              id: "22.19.1",
                              title: "Производство регенерированной резины в первичной форме или в виде пластин, листов или полос (лент)"
                           },
                           {
                              id: "22.19.2",
                              title: "Производство резиновых смесей и изделий из них; производство вулканизированной резины в виде нити, корда, пластин, листов, полос, прутков и профилей"
                           },
                           {
                              id: "22.19.3",
                              title: "Производство труб, трубок, рукавов и шлангов из вулканизированной резины"
                           },
                           {
                              id: "22.19.4",
                              title: "Производство конвейерных лент и приводных ремней, бельтинга из вулканизированной резины"
                           },
                           {
                              id: "22.19.5",
                              title: "Производство прорезиненных текстильных материалов, кроме кордных тканей"
                           },
                           {
                              id: "22.19.6",
                              title: "Производство предметов одежды и ее аксессуаров из вулканизированной резины"
                           },
                           {
                              id: "22.19.7",
                              title: "Производство изделий из вулканизированной резины, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "22.2",
                  title: "Производство изделий из пластмасс",
                  children: [
                     {
                        id: "22.21",
                        title: "Производство пластмассовых плит, полос, труб и профилей"
                     },
                     {
                        id: "22.22",
                        title: "Производство пластмассовых изделий для упаковывания товаров"
                     },
                     {
                        id: "22.23",
                        title: "Производство пластмассовых изделий, используемых в строительстве"
                     },
                     {
                        id: "22.29",
                        title: "Производство прочих пластмассовых изделий",
                        children: [
                           {
                              id: "22.29.1",
                              title: "Производство предметов одежды и аксессуаров для нее, включая перчатки, из пластмасс"
                           },
                           {
                              id: "22.29.2",
                              title: "Производство прочих изделий из пластмасс, не включенных в другие группировки, кроме устройств пломбировочных из пластика"
                           },
                           {
                              id: "22.29.3",
                              title: "Производство устройств пломбировочных из пластика"
                           },
                           {
                              id: "22.29.9",
                              title: "Предоставление услуг в области производства прочих пластмассовых изделий"
                           }]
                     }]
               }]
         },
         {
            id: "23",
            title: "Производство прочей неметаллической минеральной продукции",
            children: [
               {
                  id: "23.1",
                  title: "Производство стекла и изделий из стекла",
                  children: [
                     {
                        id: "23.11",
                        title: "Производство листового стекла",
                        children: [
                           {
                              id: "23.11.1",
                              title: "Производство необработанного листового стекла"
                           },
                           {
                              id: "23.11.2",
                              title: "Производство листового армированного стекла"
                           },
                           {
                              id: "23.11.3",
                              title: "Производство листового окрашенного стекла"
                           },
                           {
                              id: "23.11.4",
                              title: "Производство листового матового стекла"
                           }]
                     },
                     {
                        id: "23.12",
                        title: "Формирование и обработка листового стекла",
                        children: [
                           {
                              id: "23.12.1",
                              title: "Производство многослойного и закаленного стекла"
                           },
                           {
                              id: "23.12.2",
                              title: "Производство стеклянных зеркал"
                           },
                           {
                              id: "23.12.3",
                              title: "Производство многослойных изолирующих изделий из стекла"
                           }]
                     },
                     {
                        id: "23.13",
                        title: "Производство полых стеклянных изделий",
                        children: [
                           {
                              id: "23.13.1",
                              title: "Производство бутылок и прочих емкостей из стекла или хрусталя"
                           },
                           {
                              id: "23.13.2",
                              title: "Производство стаканов и прочих сосудов для питья из стекла или хрусталя"
                           },
                           {
                              id: "23.13.3",
                              title: "Производство столовой и кухонной посуды из стекла или хрусталя"
                           },
                           {
                              id: "23.13.4",
                              title: "Производство туалетных и канцелярских принадлежностей из стекла или хрусталя"
                           },
                           {
                              id: "23.13.5",
                              title: "Производство украшений для интерьера и аналогичных изделий из стекла или хрусталя"
                           },
                           {
                              id: "23.13.6",
                              title: "Производство стеклянных колб для вакуумных сосудов"
                           }]
                     },
                     {
                        id: "23.14",
                        title: "Производство стекловолокна"
                     },
                     {
                        id: "23.19",
                        title: "Производство и обработка прочих стеклянных изделий, включая технические изделия из стекла",
                        children: [
                           {
                              id: "23.19.1",
                              title: "Производство необработанного стекла в блоках, в виде шаров, прутков, труб или трубок"
                           },
                           {
                              id: "23.19.2",
                              title: "Производство блоков для мощения, стеклоблоков, плит и прочих изделий из прессованного или отформованного стекла, используемых в строительстве; производство стекла для витражей; производство многоячеистого стекла или пеностекла в блоках, плитах и аналогичных формах"
                           },
                           {
                              id: "23.19.3",
                              title: "Производство стеклянных колб для электрических ламп, электронно-лучевых приборов или аналогичных изделий"
                           },
                           {
                              id: "23.19.4",
                              title: "Производство стекол для часов или очков, не подвергнутых оптической обработке"
                           },
                           {
                              id: "23.19.5",
                              title: "Производство посуды для лабораторных, фармацевтических и гигиенических целей из стекла; производство ампул и прочих изделий из медицинского стекла"
                           },
                           {
                              id: "23.19.6",
                              title: "Производство стеклянных деталей электрических ламп и осветительной арматуры, световых указателей, световых табло и аналогичных изделий"
                           },
                           {
                              id: "23.19.7",
                              title: "Производство электрических изоляторов из стекла"
                           },
                           {
                              id: "23.19.9",
                              title: "Производство прочих изделий из стекла, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "23.2",
                  title: "Производство огнеупорных изделий",
                  children: [
                     {
                        id: "23.20",
                        title: "Производство огнеупорных изделий",
                        children: [
                           {
                              id: "23.20.1",
                              title: "Производство огнеупорных кирпичей, блоков, плиток"
                           },
                           {
                              id: "23.20.2",
                              title: "Производство огнеупорных цементов, растворов, бетонов и аналогичных составов"
                           },
                           {
                              id: "23.20.3",
                              title: "Производство безобжиговых огнеупорных изделий"
                           },
                           {
                              id: "23.20.9",
                              title: "Производство прочих огнеупорных керамических изделий"
                           }]
                     }]
               },
               {
                  id: "23.3",
                  title: "Производство строительных керамических материалов",
                  children: [
                     {
                        id: "23.31",
                        title: "Производство керамических плит и плиток"
                     },
                     {
                        id: "23.32",
                        title: "Производство кирпича, черепицы и прочих строительных изделий из обожженной глины"
                     }]
               },
               {
                  id: "23.4",
                  title: "Производство прочих фарфоровых и керамических изделий",
                  children: [
                     {
                        id: "23.41",
                        title: "Производство хозяйственных и декоративных керамических изделий",
                        children: [
                           {
                              id: "23.41.1",
                              title: "Производство столовой и кухонной керамической посуды"
                           },
                           {
                              id: "23.41.2",
                              title: "Производство прочих хозяйственных и туалетных керамических принадлежностей"
                           },
                           {
                              id: "23.41.3",
                              title: "Производство статуэток и прочих декоративных керамических изделий"
                           }]
                     },
                     {
                        id: "23.42",
                        title: "Производство керамических санитарно-технических изделий"
                     },
                     {
                        id: "23.43",
                        title: "Производство керамических изоляторов и изолирующей арматуры"
                     },
                     {
                        id: "23.44",
                        title: "Производство прочих технических керамических изделий",
                        children: [
                           {
                              id: "23.44.1",
                              title: "Производство керамических изделий лабораторного, химического и промышленного назначения"
                           },
                           {
                              id: "23.44.2",
                              title: "Производство керамических и ферритовых магнитов"
                           }]
                     },
                     {
                        id: "23.49",
                        title: "Производство прочих керамических изделий",
                        children: [
                           {
                              id: "23.49.1",
                              title: "Производство керамических горшков, банок, кувшинов и подобных изделий, используемых для транспортирования или упаковывания товаров"
                           },
                           {
                              id: "23.49.9",
                              title: "Производство керамических изделий, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "23.5",
                  title: "Производство цемента, извести и гипса",
                  children: [
                     {
                        id: "23.51",
                        title: "Производство цемента"
                     },
                     {
                        id: "23.52",
                        title: "Производство извести и гипса",
                        children: [
                           {
                              id: "23.52.1",
                              title: "Производство негашеной, гашеной и гидравлической извести"
                           },
                           {
                              id: "23.52.2",
                              title: "Производство гипса"
                           },
                           {
                              id: "23.52.3",
                              title: "Производство кальцинированного доломита"
                           }]
                     }]
               },
               {
                  id: "23.6",
                  title: "Производство изделий из бетона, цемента и гипса",
                  children: [
                     {
                        id: "23.61",
                        title: "Производство изделий из бетона для использования в строительстве",
                        children: [
                           {
                              id: "23.61.1",
                              title: "Производство готовых строительных изделий из бетона, цемента и искусственного камня"
                           },
                           {
                              id: "23.61.2",
                              title: "Производство сборных строительных конструкций из бетона, цемента и искусственного камня"
                           }]
                     },
                     {
                        id: "23.62",
                        title: "Производство гипсовых изделий для использования в строительстве"
                     },
                     {
                        id: "23.63",
                        title: "Производство товарного бетона"
                     },
                     {
                        id: "23.64",
                        title: "Производство сухих бетонных смесей"
                     },
                     {
                        id: "23.65",
                        title: "Производство изделий из асбестоцемента и волокнистого цемента",
                        children: [
                           {
                              id: "23.65.1",
                              title: "Производство строительных материалов из растительного сырья, смешанного с цементом, гипсом или прочими минеральными связующими веществами"
                           },
                           {
                              id: "23.65.2",
                              title: "Производство изделий из асбестоцемента и волокнистого цемента с волокнами целлюлозы или аналогичных материалов"
                           }]
                     },
                     {
                        id: "23.69",
                        title: "Производство прочих изделий из гипса, бетона или цемента"
                     }]
               },
               {
                  id: "23.7",
                  title: "Резка, обработка и отделка камня",
                  children: [
                     {
                        id: "23.70",
                        title: "Резка, обработка и отделка камня",
                        children: [
                           {
                              id: "23.70.1",
                              title: "Резка, обработка и отделка камня для использования в строительстве в качестве дорожного покрытия"
                           },
                           {
                              id: "23.70.2",
                              title: "Резка, обработка и отделка камня для памятников"
                           },
                           {
                              id: "23.70.3",
                              title: "Производство гранул и порошков из природного камня"
                           }]
                     }]
               },
               {
                  id: "23.9",
                  title: "Производство абразивных и неметаллических минеральных изделий, не включенных в другие группировки",
                  children: [
                     {
                        id: "23.91",
                        title: "Производство абразивных изделий"
                     },
                     {
                        id: "23.99",
                        title: "Производство прочей неметаллической минеральной продукции, не включенной в другие группировки",
                        children: [
                           {
                              id: "23.99.1",
                              title: "Производство обработанных асбестовых волокон, смесей на основе асбеста и изделий из них"
                           },
                           {
                              id: "23.99.2",
                              title: "Производство изделий из асфальта или аналогичных материалов"
                           },
                           {
                              id: "23.99.3",
                              title: "Производство битуминозных смесей на основе природного асфальта или битума, нефтяного битума, минеральных смол или их пеков"
                           },
                           {
                              id: "23.99.4",
                              title: "Производство искусственного графита, коллоидного или полуколлоидного графита, продуктов на основе графита или прочих форм углерода в виде полуфабрикатов"
                           },
                           {
                              id: "23.99.5",
                              title: "Производство искусственного корунда"
                           },
                           {
                              id: "23.99.6",
                              title: "Производство минеральных тепло- и звукоизоляционных материалов и изделий",
                              children: [
                                 {
                                    id: "23.99.61",
                                    title: "Производство минеральных теплоизоляционных материалов и изделий"
                                 },
                                 {
                                    id: "23.99.62",
                                    title: "Производство минеральных звукоизоляционных материалов и изделий"
                                 }]
                           }]
                     }]
               }]
         },
         {
            id: "24",
            title: "Производство металлургическое",
            children: [
               {
                  id: "24.1",
                  title: "Производство чугуна, стали и ферросплавов",
                  children: [
                     {
                        id: "24.10",
                        title: "Производство чугуна, стали и ферросплавов",
                        children: [
                           {
                              id: "24.10.1",
                              title: "Производство основных продуктов из железа и стали",
                              children: [
                                 {
                                    id: "24.10.11",
                                    title: "Производство чугуна"
                                 },
                                 {
                                    id: "24.10.12",
                                    title: "Производство ферросплавов"
                                 },
                                 {
                                    id: "24.10.13",
                                    title: "Производство продуктов прямого восстановления железной руды и губчатого железа"
                                 },
                                 {
                                    id: "24.10.14",
                                    title: "Производство гранул и порошков из чугуна или стали"
                                 }]
                           },
                           {
                              id: "24.10.2",
                              title: "Производство стали в слитках"
                           },
                           {
                              id: "24.10.3",
                              title: "Производство листового горячекатаного стального проката"
                           },
                           {
                              id: "24.10.4",
                              title: "Производство листового холоднокатаного стального проката"
                           },
                           {
                              id: "24.10.5",
                              title: "Производство листового холоднокатаного стального проката, плакированного, с гальваническим или иным покрытием"
                           },
                           {
                              id: "24.10.6",
                              title: "Производство сортового горячекатаного проката и катанки"
                           },
                           {
                              id: "24.10.7",
                              title: "Производство незамкнутых стальных профилей горячей обработки, листового проката в пакетах и стального рельсового профиля для железных дорог и трамвайных путей"
                           },
                           {
                              id: "24.10.9",
                              title: "Производство прочего проката из черных металлов, не включенного в другие группировки"
                           }]
                     }]
               },
               {
                  id: "24.2",
                  title: "Производство стальных труб, полых профилей и фитингов",
                  children: [
                     {
                        id: "24.20",
                        title: "Производство стальных труб, полых профилей и фитингов",
                        children: [
                           {
                              id: "24.20.1",
                              title: "Производство бесшовных труб и пустотелых профилей"
                           },
                           {
                              id: "24.20.2",
                              title: "Производство сварных труб"
                           },
                           {
                              id: "24.20.3",
                              title: "Производство стальных фитингов для труб, кроме литых"
                           }]
                     }]
               },
               {
                  id: "24.3",
                  title: "Производство прочих стальных изделий первичной обработкой",
                  children: [
                     {
                        id: "24.31",
                        title: "Производство стальных прутков и сплошных профилей методом холодного волочения"
                     },
                     {
                        id: "24.32",
                        title: "Производство холоднотянутого штрипса"
                     },
                     {
                        id: "24.33",
                        title: "Производство профилей с помощью холодной штамповки или гибки"
                     },
                     {
                        id: "24.34",
                        title: "Производство проволоки методом холодного волочения"
                     }]
               },
               {
                  id: "24.4",
                  title: "Производство основных драгоценных металлов и прочих цветных металлов, производство ядерного топлива",
                  children: [
                     {
                        id: "24.41",
                        title: "Производство драгоценных металлов"
                     },
                     {
                        id: "24.42",
                        title: "Производство алюминия"
                     },
                     {
                        id: "24.43",
                        title: "Производство свинца, цинка и олова",
                        children: [
                           {
                              id: "24.43.1",
                              title: "Производство свинца"
                           },
                           {
                              id: "24.43.2",
                              title: "Производство цинка"
                           },
                           {
                              id: "24.43.3",
                              title: "Производство олова"
                           }]
                     },
                     {
                        id: "24.44",
                        title: "Производство меди"
                     },
                     {
                        id: "24.45",
                        title: "Производство прочих цветных металлов",
                        children: [
                           {
                              id: "24.45.1",
                              title: "Производство никеля"
                           },
                           {
                              id: "24.45.2",
                              title: "Производство титана"
                           },
                           {
                              id: "24.45.3",
                              title: "Производство магния"
                           },
                           {
                              id: "24.45.4",
                              title: "Производство вольфрама"
                           },
                           {
                              id: "24.45.5",
                              title: "Производство молибдена"
                           },
                           {
                              id: "24.45.6",
                              title: "Производство кобальта"
                           },
                           {
                              id: "24.45.7",
                              title: "Производство хрома"
                           },
                           {
                              id: "24.45.8",
                              title: "Производство марганца"
                           },
                           {
                              id: "24.45.9",
                              title: "Производство редких (тантал, ниобий, галлий, германий, иридий) и редкоземельных металлов"
                           }]
                     },
                     {
                        id: "24.46",
                        title: "Производство ядерного топлива"
                     }]
               },
               {
                  id: "24.5",
                  title: "Литье металлов",
                  children: [
                     {
                        id: "24.51",
                        title: "Литье чугуна"
                     },
                     {
                        id: "24.52",
                        title: "Литье стали"
                     },
                     {
                        id: "24.53",
                        title: "Литье легких металлов"
                     },
                     {
                        id: "24.54",
                        title: "Литье прочих цветных металлов"
                     }]
               }]
         },
         {
            id: "25",
            title: "Производство готовых металлических изделий, кроме машин и оборудования",
            children: [
               {
                  id: "25.1",
                  title: "Производство строительных металлических конструкций и изделий",
                  children: [
                     {
                        id: "25.11",
                        title: "Производство строительных металлических конструкций, изделий и их частей"
                     },
                     {
                        id: "25.12",
                        title: "Производство металлических дверей и окон"
                     }]
               },
               {
                  id: "25.2",
                  title: "Производство металлических цистерн, резервуаров и прочих емкостей",
                  children: [
                     {
                        id: "25.21",
                        title: "Производство радиаторов и котлов центрального отопления",
                        children: [
                           {
                              id: "25.21.1",
                              title: "Производство радиаторов"
                           },
                           {
                              id: "25.21.2",
                              title: "Производство котлов центрального отопления"
                           }]
                     },
                     {
                        id: "25.29",
                        title: "Производство прочих металлических цистерн, резервуаров и емкостей"
                     }]
               },
               {
                  id: "25.3",
                  title: "Производство паровых котлов, кроме котлов центрального отопления",
                  children: [
                     {
                        id: "25.30",
                        title: "Производство паровых котлов, кроме котлов центрального отопления",
                        children: [
                           {
                              id: "25.30.1",
                              title: "Производство паровых котлов и их частей"
                           },
                           {
                              id: "25.30.2",
                              title: "Производство ядерных установок и их составных частей, в том числе для транспортных средств",
                              children: [
                                 {
                                    id: "25.30.21",
                                    title: "Производство ядерных установок, кроме устройств для разделения изотопов"
                                 },
                                 {
                                    id: "25.30.22",
                                    title: "Производство частей ядерных установок, кроме устройств для разделения изотопов"
                                 }]
                           }]
                     }]
               },
               {
                  id: "25.4",
                  title: "Производство оружия и боеприпасов",
                  children: [
                     {
                        id: "25.40",
                        title: "Производство оружия и боеприпасов"
                     }]
               },
               {
                  id: "25.5",
                  title: "Ковка, прессование, штамповка и профилирование; изготовление изделий методом порошковой металлургии",
                  children: [
                     {
                        id: "25.50",
                        title: "Ковка, прессование, штамповка и профилирование, изготовление изделий методом порошковой металлургии",
                        children: [
                           {
                              id: "25.50.1",
                              title: "Предоставление услуг по ковке, прессованию, объемной и листовой штамповке и профилированию листового металла"
                           },
                           {
                              id: "25.50.2",
                              title: "Предоставление услуг по производству изделий методом порошковой металлургии"
                           }]
                     }]
               },
               {
                  id: "25.6",
                  title: "Обработка металлов и нанесение покрытий на металлы; механическая обработка металлов",
                  children: [
                     {
                        id: "25.61",
                        title: "Обработка металлов и нанесение покрытий на металлы"
                     },
                     {
                        id: "25.62",
                        title: "Обработка металлических изделий механическая"
                     }]
               },
               {
                  id: "25.7",
                  title: "Производство ножевых изделий и столовых приборов, инструментов и универсальных скобяных изделий",
                  children: [
                     {
                        id: "25.71",
                        title: "Производство ножевых изделий и столовых приборов"
                     },
                     {
                        id: "25.72",
                        title: "Производство замков, петель"
                     },
                     {
                        id: "25.73",
                        title: "Производство инструмента"
                     }]
               },
               {
                  id: "25.9",
                  title: "Производство прочих готовых металлических изделий",
                  children: [
                     {
                        id: "25.91",
                        title: "Производство металлических бочек и аналогичных емкостей"
                     },
                     {
                        id: "25.92",
                        title: "Производство тары из легких металлов"
                     },
                     {
                        id: "25.93",
                        title: "Производство изделий из проволоки, цепей и пружин",
                        children: [
                           {
                              id: "25.93.1",
                              title: "Производство изделий из проволоки и пружин"
                           },
                           {
                              id: "25.93.2",
                              title: "Производство цепей, кроме шарнирных, и составных частей к ним"
                           }]
                     },
                     {
                        id: "25.94",
                        title: "Производство крепежных изделий"
                     },
                     {
                        id: "25.99",
                        title: "Производство прочих готовых металлических изделий, не включенных в другие группировки",
                        children: [
                           {
                              id: "25.99.1",
                              title: "Производство металлических изделий для ванных комнат и кухни",
                              children: [
                                 {
                                    id: "25.99.11",
                                    title: "Производство раковин, моек, ванн и прочих санитарно-технических изделий и их составных частей из черных металлов, меди или алюминия"
                                 },
                                 {
                                    id: "25.99.12",
                                    title: "Производство столовых, кухонных и прочих бытовых изделий, кроме столовых и кухонных приборов, и их составных частей из черных металлов, меди или алюминия"
                                 }]
                           },
                           {
                              id: "25.99.2",
                              title: "Производство прочих металлических изделий",
                              children: [
                                 {
                                    id: "25.99.21",
                                    title: "Производство бронированных или армированных сейфов, несгораемых шкафов и дверей"
                                 },
                                 {
                                    id: "25.99.22",
                                    title: "Производство канцелярского настольного оборудования (ящиков, картотек, лотков и т.п.) из недрагоценных металлов"
                                 },
                                 {
                                    id: "25.99.23",
                                    title: "Производство деталей для скоросшивателей или папок; канцелярских принадлежностей и скоб в виде полос из недрагоценных металлов"
                                 },
                                 {
                                    id: "25.99.24",
                                    title: "Производство статуэток, рам для фотографий, картин, зеркал и прочих декоративных изделий из недрагоценных металлов"
                                 },
                                 {
                                    id: "25.99.25",
                                    title: "Производство фурнитуры из недрагоценных металлов для одежды, обуви, кожгалантереи и прочих изделий, в том числе крючков, пряжек, застежек, петелек, колечек, трубчатых и раздвоенных заклепок и др."
                                 },
                                 {
                                    id: "25.99.26",
                                    title: "Производство судовых гребных винтов и гребных колес"
                                 },
                                 {
                                    id: "25.99.27",
                                    title: "Производство металлических изделий для области использования атомной энергии"
                                 },
                                 {
                                    id: "25.99.29",
                                    title: "Производство прочих изделий из недрагоценных металлов, не включенных в другие группировки"
                                 }]
                           },
                           {
                              id: "25.99.3",
                              title: "Изготовление готовых металлических изделий хозяйственного назначения по индивидуальному заказу населения"
                           }]
                     }]
               }]
         },
         {
            id: "26",
            title: "Производство компьютеров, электронных и оптических изделий",
            children: [
               {
                  id: "26.1",
                  title: "Производство элементов электронной аппаратуры и печатных схем (плат)",
                  children: [
                     {
                        id: "26.11",
                        title: "Производство элементов электронной аппаратуры",
                        children: [
                           {
                              id: "26.11.1",
                              title: "Производство электронных вакуумных ламп и трубок и прочих электронных вакуумных приборов"
                           },
                           {
                              id: "26.11.2",
                              title: "Производство диодов, транзисторов и прочих полупроводниковых приборов, включая светоизлучающие диоды, пьезоэлектрические приборы и их части"
                           },
                           {
                              id: "26.11.3",
                              title: "Производство интегральных электронных схем"
                           },
                           {
                              id: "26.11.9",
                              title: "Производство частей электронных ламп, трубок и прочих электронных компонентов, не включенных в другие группировки"
                           }]
                     },
                     {
                        id: "26.12",
                        title: "Производство электронных печатных плат"
                     }]
               },
               {
                  id: "26.2",
                  title: "Производство компьютеров и периферийного оборудования",
                  children: [
                     {
                        id: "26.20",
                        title: "Производство компьютеров и периферийного оборудования",
                        children: [
                           {
                              id: "26.20.1",
                              title: "Производство компьютеров"
                           },
                           {
                              id: "26.20.2",
                              title: "Производство периферийного оборудования"
                           },
                           {
                              id: "26.20.3",
                              title: "Производство запоминающих устройств и прочих устройств хранения данных"
                           },
                           {
                              id: "26.20.4",
                              title: "Производство средств защиты информации, а также информационных и телекоммуникационных систем, защищенных с использованием средств защиты информации"
                           },
                           {
                              id: "26.20.9",
                              title: "Производство прочих устройств автоматической обработки данных"
                           }]
                     }]
               },
               {
                  id: "26.3",
                  title: "Производство коммуникационного оборудования",
                  children: [
                     {
                        id: "26.30",
                        title: "Производство коммуникационного оборудования",
                        children: [
                           {
                              id: "26.30.1",
                              title: "Производство коммуникационной аппаратуры, радио- и телевизионной передающей аппаратуры, телевизионных камер",
                              children: [
                                 {
                                    id: "26.30.11",
                                    title: "Производство средств связи, выполняющих функцию систем коммутации"
                                 },
                                 {
                                    id: "26.30.12",
                                    title: "Производство средств связи, выполняющих функцию цифровых транспортных систем"
                                 },
                                 {
                                    id: "26.30.13",
                                    title: "Производство средств связи, выполняющих функцию систем управления и мониторинга"
                                 },
                                 {
                                    id: "26.30.14",
                                    title: "Производство оборудования, используемого для учета объема оказанных услуг связи"
                                 },
                                 {
                                    id: "26.30.15",
                                    title: "Производство радиоэлектронных средств связи"
                                 },
                                 {
                                    id: "26.30.16",
                                    title: "Производство оборудования средств связи, в том числе программное обеспечение, обеспечивающее выполнение установленных действий при проведении оперативно-розыскных мероприятий"
                                 },
                                 {
                                    id: "26.30.17",
                                    title: "Производство радио- и телевизионной передающей аппаратуры"
                                 },
                                 {
                                    id: "26.30.18",
                                    title: "Производство телевизионных камер"
                                 },
                                 {
                                    id: "26.30.19",
                                    title: "Производство прочего коммуникационного оборудования"
                                 }]
                           },
                           {
                              id: "26.30.2",
                              title: "Производство оконечного (пользовательского) оборудования телефонной или телеграфной связи, аппаратуры видеосвязи",
                              children: [
                                 {
                                    id: "26.30.21",
                                    title: "Производство пользовательского (оконечного) оборудования проводной телефонной связи с проводными или беспроводными телефонными трубками"
                                 },
                                 {
                                    id: "26.30.22",
                                    title: "Производство телефонных аппаратов для работы в сотовых или иных беспроводных сетях связи"
                                 },
                                 {
                                    id: "26.30.29",
                                    title: "Производство прочих телефонных аппаратов, устройств и аппаратуры для передачи и приема речи, изображений или других данных, включая оборудование коммуникационное для работы в проводных или беспроводных сетях связи (например, локальных и глобальных сетях)"
                                 }]
                           },
                           {
                              id: "26.30.3",
                              title: "Производство запасных частей и комплектующих коммуникационного оборудования"
                           },
                           {
                              id: "26.30.4",
                              title: "Производство антенн, антенных отражателей всех видов и их деталей"
                           },
                           {
                              id: "26.30.5",
                              title: "Производство запасных частей и комплектующих радио- и телевизионной передающей аппаратуры и телевизионных камер"
                           },
                           {
                              id: "26.30.6",
                              title: "Производство охранно-пожарной сигнализации и аналогичных приборов"
                           }]
                     }]
               },
               {
                  id: "26.4",
                  title: "Производство бытовой электроники",
                  children: [
                     {
                        id: "26.40",
                        title: "Производство бытовой электроники",
                        children: [
                           {
                              id: "26.40.1",
                              title: "Производство радиоприемников"
                           },
                           {
                              id: "26.40.2",
                              title: "Производство телевизионных приемников, включая видеомониторы и видеопроекторы",
                              children: [
                                 {
                                    id: "26.40.21",
                                    title: "Производство телевизоров с электронно-лучевой трубкой"
                                 },
                                 {
                                    id: "26.40.22",
                                    title: "Производство телевизоров жидкокристаллических и плазменных"
                                 },
                                 {
                                    id: "26.40.23",
                                    title: "Производство видеомониторов и видеопроекторов"
                                 }]
                           },
                           {
                              id: "26.40.3",
                              title: "Производство аппаратуры для записи и воспроизведения звука и изображения"
                           },
                           {
                              id: "26.40.4",
                              title: "Производство электроакустической аппаратуры"
                           },
                           {
                              id: "26.40.5",
                              title: "Производство частей звукозаписывающей и звуковоспроизводящей аппаратуры и видеоаппаратуры"
                           }]
                     }]
               },
               {
                  id: "26.5",
                  title: "Производство контрольно-измерительных и навигационных приборов и аппаратов; производство часов",
                  children: [
                     {
                        id: "26.51",
                        title: "Производство инструментов и приборов для измерения, тестирования и навигации",
                        children: [
                           {
                              id: "26.51.1",
                              title: "Производство навигационных, метеорологических, геодезических, геофизических и аналогичного типа приборов, аппаратуры и инструментов"
                           },
                           {
                              id: "26.51.2",
                              title: "Производство радиолокационной, радионавигационной аппаратуры и радиоаппаратуры дистанционного управления"
                           },
                           {
                              id: "26.51.3",
                              title: "Производство точных весов; производство ручных инструментов для черчения, разметки и математических расчетов; производство ручных инструментов для измерения линейных размеров, не включенных в другие группировки"
                           },
                           {
                              id: "26.51.4",
                              title: "Производство приборов и аппаратуры для измерения электрических величин или ионизирующих излучений"
                           },
                           {
                              id: "26.51.5",
                              title: "Производство приборов для контроля прочих физических величин"
                           },
                           {
                              id: "26.51.6",
                              title: "Производство прочих приборов, датчиков, аппаратуры и инструментов для измерения, контроля и испытаний"
                           },
                           {
                              id: "26.51.7",
                              title: "Производство приборов и аппаратуры для автоматического регулирования или управления"
                           },
                           {
                              id: "26.51.8",
                              title: "Производство частей приборов и инструментов для навигации, управления, измерения, контроля, испытаний и прочих целей"
                           }]
                     },
                     {
                        id: "26.52",
                        title: "Производство часов",
                        children: [
                           {
                              id: "26.52.1",
                              title: "Производство часов всех видов и прочих приборов времени"
                           },
                           {
                              id: "26.52.2",
                              title: "Производство часовых механизмов, деталей и составных частей часов и приборов времени"
                           }]
                     }]
               },
               {
                  id: "26.6",
                  title: "Производство облучающего и электротерапевтического оборудования, применяемого в медицинских целях",
                  children: [
                     {
                        id: "26.60",
                        title: "Производство облучающего и электротерапевтического оборудования, применяемого в медицинских целях",
                        children: [
                           {
                              id: "26.60.1",
                              title: "Производство аппаратов, применяемых в медицинских целях, основанных на использовании рентгеновского, альфа-, бета- и гамма-излучений"
                           },
                           {
                              id: "26.60.2",
                              title: "Производство гемодиализного, диатермического, наркозного оборудования, применяемого в медицинских целях"
                           },
                           {
                              id: "26.60.3",
                              title: "Производство оборудования для переливания крови"
                           },
                           {
                              id: "26.60.4",
                              title: "Производство инструмента, оборудования и приспособлений, применяемых в медицинских целях"
                           },
                           {
                              id: "26.60.5",
                              title: "Производство диагностического и терапевтического оборудования, применяемого в медицинских целях"
                           },
                           {
                              id: "26.60.6",
                              title: "Производство компьютерных томографов"
                           },
                           {
                              id: "26.60.7",
                              title: "Производство ультразвукового оборудования, применяемого в медицинских целях"
                           },
                           {
                              id: "26.60.9",
                              title: "Производство прочего оборудования, применяемого в медицинских целях"
                           }]
                     }]
               },
               {
                  id: "26.7",
                  title: "Производство оптических приборов, фото- и кинооборудования",
                  children: [
                     {
                        id: "26.70",
                        title: "Производство оптических приборов, фото- и кинооборудования",
                        children: [
                           {
                              id: "26.70.1",
                              title: "Производство фото- и кинооборудования"
                           },
                           {
                              id: "26.70.2",
                              title: "Производство микроскопов (кроме электронных и протонных)"
                           },
                           {
                              id: "26.70.3",
                              title: "Производство оптических систем обнаружения оружия"
                           },
                           {
                              id: "26.70.4",
                              title: "Производство оборудования оптического позиционирования на местности"
                           },
                           {
                              id: "26.70.5",
                              title: "Производство линз, оптических микроскопов, биноклей и телескопов"
                           },
                           {
                              id: "26.70.6",
                              title: "Производство оптических прицелов и приборов определения координат целей"
                           },
                           {
                              id: "26.70.7",
                              title: "Производство пленочных и цифровых фото- и кинокамер"
                           }]
                     }]
               },
               {
                  id: "26.8",
                  title: "Производство незаписанных магнитных и оптических технических носителей информации",
                  children: [
                     {
                        id: "26.80",
                        title: "Производство незаписанных магнитных и оптических технических носителей информации"
                     }]
               }]
         },
         {
            id: "27",
            title: "Производство электрического оборудования",
            children: [
               {
                  id: "27.1",
                  title: "Производство электродвигателей, генераторов, трансформаторов и распределительных устройств, а также контрольно-измерительной аппаратуры",
                  children: [
                     {
                        id: "27.11",
                        title: "Производство электродвигателей, электрогенераторов и трансформаторов",
                        children: [
                           {
                              id: "27.11.1",
                              title: "Производство электродвигателей, генераторов и трансформаторов, кроме ремонта",
                              children: [
                                 {
                                    id: "27.11.11",
                                    title: "Производство электродвигателей"
                                 },
                                 {
                                    id: "27.11.12",
                                    title: "Производство генераторов"
                                 },
                                 {
                                    id: "27.11.13",
                                    title: "Производство трансформаторов"
                                 }]
                           }]
                     },
                     {
                        id: "27.12",
                        title: "Производство электрической распределительной и регулирующей аппаратуры"
                     }]
               },
               {
                  id: "27.2",
                  title: "Производство электрических аккумуляторов и аккумуляторных батарей",
                  children: [
                     {
                        id: "27.20",
                        title: "Производство электрических аккумуляторов и аккумуляторных батарей",
                        children: [
                           {
                              id: "27.20.1",
                              title: "Производство первичных элементов, батарей первичных элементов и их частей"
                           },
                           {
                              id: "27.20.2",
                              title: "Производство аккумуляторов, в том числе для автомобилей, аккумуляторных батарей и их составных частей",
                              children: [
                                 {
                                    id: "27.20.21",
                                    title: "Производство аккумуляторов для автомобилей"
                                 },
                                 {
                                    id: "27.20.22",
                                    title: "Производство аккумуляторных батарей и их частей"
                                 },
                                 {
                                    id: "27.20.23",
                                    title: "Производство прочих аккумуляторов"
                                 }]
                           },
                           {
                              id: "27.20.3",
                              title: "Производство солнечных батарей для наземного энергообеспечения и их составных частей"
                           }]
                     }]
               },
               {
                  id: "27.3",
                  title: "Производство кабелей и кабельной арматуры",
                  children: [
                     {
                        id: "27.31",
                        title: "Производство волоконо-оптических кабелей"
                     },
                     {
                        id: "27.32",
                        title: "Производство прочих проводов и кабелей для электронного и электрического оборудования",
                        children: [
                           {
                              id: "27.32.1",
                              title: "Производство кабелей для телефонной связи"
                           },
                           {
                              id: "27.32.2",
                              title: "Производство силовых кабелей"
                           },
                           {
                              id: "27.32.3",
                              title: "Производство обмоточных эмалированных кабелей"
                           }]
                     },
                     {
                        id: "27.33",
                        title: "Производство электроустановочных изделий"
                     }]
               },
               {
                  id: "27.4",
                  title: "Производство электрических ламп и осветительного оборудования",
                  children: [
                     {
                        id: "27.40",
                        title: "Производство электрических ламп и осветительного оборудования"
                     }]
               },
               {
                  id: "27.5",
                  title: "Производство бытовых приборов",
                  children: [
                     {
                        id: "27.51",
                        title: "Производство бытовых электрических приборов",
                        children: [
                           {
                              id: "27.51.1",
                              title: "Производство стиральных машин"
                           },
                           {
                              id: "27.51.2",
                              title: "Производство холодильников и морозильников"
                           },
                           {
                              id: "27.51.3",
                              title: "Производство пылесосов"
                           },
                           {
                              id: "27.51.4",
                              title: "Производство посудомоечных машин"
                           },
                           {
                              id: "27.51.5",
                              title: "Производство электропечей"
                           },
                           {
                              id: "27.51.6",
                              title: "Производство микроволновых печей"
                           }]
                     },
                     {
                        id: "27.52",
                        title: "Производство бытовых неэлектрических приборов"
                     }]
               },
               {
                  id: "27.9",
                  title: "Производство прочего электрического оборудования",
                  children: [
                     {
                        id: "27.90",
                        title: "Производство прочего электрического оборудования",
                        children: [
                           {
                              id: "27.90.1",
                              title: "Производство ускорителей заряженных частиц"
                           },
                           {
                              id: "27.90.2",
                              title: "Производство радиационных аппаратов и радионуклидных энергетических устройств (РЭУ)"
                           },
                           {
                              id: "27.90.9",
                              title: "Производство электрического оборудования прочего, не включенного в другие группировки"
                           }]
                     }]
               }]
         },
         {
            id: "28",
            title: "Производство машин и оборудования, не включенных в другие группировки",
            children: [
               {
                  id: "28.1",
                  title: "Производство машин и оборудования общего назначения",
                  children: [
                     {
                        id: "28.11",
                        title: "Производство двигателей и турбин, кроме авиационных, автомобильных и мотоциклетных двигателей",
                        children: [
                           {
                              id: "28.11.1",
                              title: "Производство двигателей, кроме авиационных, автомобильных и мотоциклетных"
                           },
                           {
                              id: "28.11.2",
                              title: "Производство турбин",
                              children: [
                                 {
                                    id: "28.11.21",
                                    title: "Производство паровых турбин"
                                 },
                                 {
                                    id: "28.11.22",
                                    title: "Производство гидравлических турбин и водяных колес"
                                 },
                                 {
                                    id: "28.11.23",
                                    title: "Производство газовых турбин, кроме турбореактивных и турбовинтовых"
                                 }]
                           }]
                     },
                     {
                        id: "28.12",
                        title: "Производство гидравлического и пневматического силового оборудования",
                        children: [
                           {
                              id: "28.12.1",
                              title: "Производство гидравлических и пневматических силовых установок и двигателей"
                           },
                           {
                              id: "28.12.2",
                              title: "Производство гидравлических насосов"
                           }]
                     },
                     {
                        id: "28.13",
                        title: "Производство прочих насосов и компрессоров"
                     },
                     {
                        id: "28.14",
                        title: "Производство арматуры трубопроводной (арматуры)"
                     },
                     {
                        id: "28.15",
                        title: "Производство подшипников, зубчатых передач, элементов механических передач и приводов",
                        children: [
                           {
                              id: "28.15.1",
                              title: "Производство шариковых и роликовых подшипников"
                           },
                           {
                              id: "28.15.2",
                              title: "Производство корпусов подшипников и подшипников скольжения, зубчатых колес, зубчатых передач и элементов приводов"
                           },
                           {
                              id: "28.15.9",
                              title: "Производство прочих подшипников"
                           }]
                     }]
               },
               {
                  id: "28.2",
                  title: "Производство прочих машин и оборудования общего назначения",
                  children: [
                     {
                        id: "28.21",
                        title: "Производство печей, термокамер и печных горелок",
                        children: [
                           {
                              id: "28.21.1",
                              title: "Производство неэлектрических печей, горелок и устройств для них"
                           },
                           {
                              id: "28.21.2",
                              title: "Производство электрических печей"
                           }]
                     },
                     {
                        id: "28.22",
                        title: "Производство подъемно-транспортного оборудования",
                        children: [
                           {
                              id: "28.22.1",
                              title: "Производство талей и подъемников"
                           },
                           {
                              id: "28.22.2",
                              title: "Производство лебедок и кабестанов"
                           },
                           {
                              id: "28.22.3",
                              title: "Производство домкратов и подъемных механизмов для транспортных средств"
                           },
                           {
                              id: "28.22.4",
                              title: "Производство подъемных кранов",
                              children: [
                                 {
                                    id: "28.22.41",
                                    title: "Производство подъемных кранов для строительства"
                                 },
                                 {
                                    id: "28.22.42",
                                    title: "Производство прочих подъемных кранов"
                                 }]
                           },
                           {
                              id: "28.22.5",
                              title: "Производство автопогрузчиков и тягачей, используемых на железнодорожных платформах"
                           },
                           {
                              id: "28.22.6",
                              title: "Производство лифтов, скриповых подъемников, эскалаторов и движущихся пешеходных дорожек"
                           },
                           {
                              id: "28.22.7",
                              title: "Производство пневматических подъемников и конвейеров и прочего оборудования непрерывного действия для товаров или материалов"
                           },
                           {
                              id: "28.22.9",
                              title: "Производство прочего грузоподъемного, транспортирующего и погрузочно-разгрузочного оборудования"
                           }]
                     },
                     {
                        id: "28.23",
                        title: "Производство офисной техники и оборудования (кроме компьютеров и периферийного оборудования)",
                        children: [
                           {
                              id: "28.23.1",
                              title: "Производство пишущих машин, машин для обработки текста, калькуляторов, счетных машин и их частей"
                           },
                           {
                              id: "28.23.2",
                              title: "Производство фотокопировальных машин, офисных машин для офсетной печати и прочих офисных машин и оборудования и их составных частей"
                           }]
                     },
                     {
                        id: "28.24",
                        title: "Производство ручных инструментов с механизированным приводом"
                     },
                     {
                        id: "28.25",
                        title: "Производство промышленного холодильного и вентиляционного оборудования",
                        children: [
                           {
                              id: "28.25.1",
                              title: "Производство теплообменных устройств, оборудования для кондиционирования воздуха промышленного холодильного и морозильного оборудования, производство оборудования для фильтрования и очистки газов",
                              children: [
                                 {
                                    id: "28.25.11",
                                    title: "Производство теплообменных устройств и машин для сжижения воздуха или прочих газов"
                                 },
                                 {
                                    id: "28.25.12",
                                    title: "Производство оборудования для кондиционирования воздуха"
                                 },
                                 {
                                    id: "28.25.13",
                                    title: "Производство промышленного холодильного и морозильного оборудования"
                                 },
                                 {
                                    id: "28.25.14",
                                    title: "Производство оборудования для фильтрования и очистки газов"
                                 }]
                           },
                           {
                              id: "28.25.2",
                              title: "Производство вентиляторов"
                           }]
                     },
                     {
                        id: "28.29",
                        title: "Производство прочих машин и оборудования общего назначения, не включенного в другие группировки",
                        children: [
                           {
                              id: "28.29.1",
                              title: "Производство газогенераторов, аппаратов для дистилляции и фильтрования",
                              children: [
                                 {
                                    id: "28.29.11",
                                    title: "Производство генераторов для получения генераторного или водяного газа, ацетиленовых и аналогичных газогенераторов, установок для дистилляции или очистки"
                                 },
                                 {
                                    id: "28.29.12",
                                    title: "Производство оборудования и установок для фильтрования или очистки жидкостей"
                                 },
                                 {
                                    id: "28.29.13",
                                    title: "Производство масляных, бензиновых и всасывающих воздушных фильтров для двигателей внутреннего сгорания"
                                 }]
                           },
                           {
                              id: "28.29.2",
                              title: "Производство оборудования для мойки, заполнения, закупоривания или упаковывания бутылок или прочих емкостей, огнетушителей, распылителей, пароструйных или пескоструйных машин, прокладок",
                              children: [
                                 {
                                    id: "28.29.21",
                                    title: "Производство оборудования для мойки, заполнения, закупоривания или упаковывания бутылок или прочих емкостей"
                                 },
                                 {
                                    id: "28.29.22",
                                    title: "Производство огнетушителей, распылителей, пароструйных или пескоструйных машин"
                                 }]
                           },
                           {
                              id: "28.29.3",
                              title: "Производство промышленного, бытового и прочего оборудования для взвешивания и дозировки",
                              children: [
                                 {
                                    id: "28.29.31",
                                    title: "Производство промышленного оборудования для взвешивания и дозировки"
                                 },
                                 {
                                    id: "28.29.32",
                                    title: "Производство бытового оборудования для взвешивания"
                                 },
                                 {
                                    id: "28.29.39",
                                    title: "Производство прочего оборудования для взвешивания и дозировки"
                                 }]
                           },
                           {
                              id: "28.29.4",
                              title: "Производство центрифуг, каландров и торговых автоматов",
                              children: [
                                 {
                                    id: "28.29.41",
                                    title: "Производство центрифуг"
                                 },
                                 {
                                    id: "28.29.42",
                                    title: "Производство каландров или прочих валковых машин, кроме машин для обработки металлов или стекла"
                                 },
                                 {
                                    id: "28.29.43",
                                    title: "Производство торговых автоматов"
                                 }]
                           },
                           {
                              id: "28.29.5",
                              title: "Производство посудомоечных машин промышленного типа"
                           },
                           {
                              id: "28.29.6",
                              title: "Производство оборудования для обработки материалов с использованием процессов, включающих изменение температуры, не включенного в другие группировки"
                           },
                           {
                              id: "28.29.7",
                              title: "Производство неэлектрического оборудования и инструментов для пайки мягким и твердым припоем или сварки, машин и аппаратов для газотермического напыления"
                           }]
                     }]
               },
               {
                  id: "28.3",
                  title: "Производство машин и оборудования для сельского и лесного хозяйства",
                  children: [
                     {
                        id: "28.30",
                        title: "Производство машин и оборудования для сельского и лесного хозяйства",
                        children: [
                           {
                              id: "28.30.1",
                              title: "Производство тракторов, управляемых рядом идущим водителем"
                           },
                           {
                              id: "28.30.2",
                              title: "Производство тракторов для сельского хозяйства",
                              children: [
                                 {
                                    id: "28.30.21",
                                    title: "Производство колесных тракторов для сельского хозяйства"
                                 },
                                 {
                                    id: "28.30.22",
                                    title: "Производство гусеничных тракторов для сельского хозяйства"
                                 }]
                           },
                           {
                              id: "28.30.3",
                              title: "Производство машин и сельскохозяйственного оборудования для обработки почвы"
                           },
                           {
                              id: "28.30.4",
                              title: "Производство косилок для газонов, парков или спортивных площадок"
                           },
                           {
                              id: "28.30.5",
                              title: "Производство машин для уборки урожая",
                              children: [
                                 {
                                    id: "28.30.51",
                                    title: "Производство зерноуборочных комбайнов"
                                 },
                                 {
                                    id: "28.30.52",
                                    title: "Производство кормозаготовительных комбайнов"
                                 },
                                 {
                                    id: "28.30.53",
                                    title: "Производство корнеуборочных или клубнеуборочных машин"
                                 },
                                 {
                                    id: "28.30.59",
                                    title: "Производство прочих машин для уборки урожая"
                                 }]
                           },
                           {
                              id: "28.30.6",
                              title: "Производство механических устройств для разбрасывания или распыления жидкостей или порошков, используемых в сельском хозяйстве или садоводстве"
                           },
                           {
                              id: "28.30.7",
                              title: "Производство самозагружающихся или саморазгружающихся прицепов и полуприцепов для сельского хозяйства"
                           },
                           {
                              id: "28.30.8",
                              title: "Производство прочих сельскохозяйственных машин и оборудования",
                              children: [
                                 {
                                    id: "28.30.81",
                                    title: "Производство машин для очистки, сортировки или калибровки яиц, фруктов или прочих сельскохозяйственных продуктов, кроме семян, зерна или сухих бобовых культур"
                                 },
                                 {
                                    id: "28.30.82",
                                    title: "Производство доильных аппаратов"
                                 },
                                 {
                                    id: "28.30.83",
                                    title: "Производство оборудования для приготовления кормов для животных"
                                 },
                                 {
                                    id: "28.30.84",
                                    title: "Производство инкубаторов и брудеров для птицеводства"
                                 },
                                 {
                                    id: "28.30.85",
                                    title: "Производство машин и оборудования для содержания птицы"
                                 },
                                 {
                                    id: "28.30.89",
                                    title: "Производство прочего оборудования для сельского хозяйства, садоводства, лесного хозяйства, птицеводства или пчеловодства, не включенного в другие группировки"
                                 }]
                           }]
                     }]
               },
               {
                  id: "28.4",
                  title: "Производство станков, машин и оборудования для обработки металлов и прочих твердых материалов",
                  children: [
                     {
                        id: "28.41",
                        title: "Производство металлообрабатывающего оборудования",
                        children: [
                           {
                              id: "28.41.1",
                              title: "Производство металлообрабатывающих станков"
                           },
                           {
                              id: "28.41.2",
                              title: "Производство кузнечно-прессового оборудования"
                           }]
                     },
                     {
                        id: "28.49",
                        title: "Производство прочих станков",
                        children: [
                           {
                              id: "28.49.1",
                              title: "Производство станков для обработки камня, дерева и аналогичных твердых материалов",
                              children: [
                                 {
                                    id: "28.49.11",
                                    title: "Производство станков для обработки камня, керамики, бетона или аналогичных минеральных материалов или для холодной обработки стекла"
                                 },
                                 {
                                    id: "28.49.12",
                                    title: "Производство деревообрабатывающих станков"
                                 },
                                 {
                                    id: "28.49.13",
                                    title: "Производство станков для обработки кости, твердой резины, твердых пластмасс или аналогичных твердых материалов"
                                 }]
                           },
                           {
                              id: "28.49.2",
                              title: "Производство оборудования для нанесения гальванического покрытия"
                           },
                           {
                              id: "28.49.3",
                              title: "Производство оправок для крепления инструмента"
                           },
                           {
                              id: "28.49.4",
                              title: "Производство делительных головок и прочих специальных приспособлений для станков"
                           }]
                     }]
               },
               {
                  id: "28.9",
                  title: "Производство прочих машин специального назначения",
                  children: [
                     {
                        id: "28.91",
                        title: "Производство машин и оборудования для металлургии",
                        children: [
                           {
                              id: "28.91.1",
                              title: "Производство конвертеров, ковшей, изложниц и литейных машин"
                           },
                           {
                              id: "28.91.2",
                              title: "Производство прокатных станов"
                           },
                           {
                              id: "28.91.3",
                              title: "Производство валков для прокатных станов"
                           }]
                     },
                     {
                        id: "28.92",
                        title: "Производство машин и оборудования для добычи полезных ископаемых и строительства",
                        children: [
                           {
                              id: "28.92.1",
                              title: "Производство оборудования для добычи полезных ископаемых подземным способом",
                              children: [
                                 {
                                    id: "28.92.11",
                                    title: "Производство подъемников и конвейеров непрерывного действия для подземных работ"
                                 },
                                 {
                                    id: "28.92.12",
                                    title: "Производство врубовых машин и оборудования для проходки тоннелей"
                                 }]
                           },
                           {
                              id: "28.92.2",
                              title: "Производство прочих машин для перемещения, грейдерных работ, планирования, скреперных работ, выемки, трамбовки, уплотнения или добычи, самоходных, для грунта, минералов или руд",
                              children: [
                                 {
                                    id: "28.92.21",
                                    title: "Производство бульдозеров"
                                 },
                                 {
                                    id: "28.92.22",
                                    title: "Производство самоходных грейдеров и планировщиков"
                                 },
                                 {
                                    id: "28.92.23",
                                    title: "Производство самоходных скреперов"
                                 },
                                 {
                                    id: "28.92.24",
                                    title: "Производство трамбовочных машин и дорожных самоходных катков"
                                 },
                                 {
                                    id: "28.92.25",
                                    title: "Производство самоходных фронтальных одноковшовых погрузчиков"
                                 },
                                 {
                                    id: "28.92.26",
                                    title: "Производство одноковшовых полноповоротных экскаваторов и погрузчиков"
                                 },
                                 {
                                    id: "28.92.27",
                                    title: "Производство прочих экскаваторов и самоходных ковшовых погрузчиков"
                                 },
                                 {
                                    id: "28.92.28",
                                    title: "Производство отвалов бульдозеров"
                                 },
                                 {
                                    id: "28.92.29",
                                    title: "Производство автомобилей-самосвалов, предназначенных для использования в условиях бездорожья"
                                 }]
                           },
                           {
                              id: "28.92.3",
                              title: "Производство прочих машин для выемки грунта"
                           },
                           {
                              id: "28.92.4",
                              title: "Производство машин для сортировки, дробления, смешивания и аналогичной обработки грунта, камня, руды и прочих минеральных веществ"
                           },
                           {
                              id: "28.92.5",
                              title: "Производство гусеничных тракторов"
                           }]
                     },
                     {
                        id: "28.93",
                        title: "Производство машин и оборудования для производства пищевых продуктов, напитков и табачных изделий"
                     },
                     {
                        id: "28.94",
                        title: "Производство машин и оборудования для изготовления текстильных, швейных, меховых и кожаных изделий",
                        children: [
                           {
                              id: "28.94.1",
                              title: "Производство оборудования для подготовки, прядения текстильных волокон, производства тканых и трикотажных текстильных изделий"
                           },
                           {
                              id: "28.94.2",
                              title: "Производство прочего оборудования для текстильной и швейной промышленности, в том числе промышленных швейных машин"
                           },
                           {
                              id: "28.94.3",
                              title: "Производство оборудования для обработки шкур, сырых кож и выделанной кожи и для изготовления или ремонта обуви и прочих изделий"
                           },
                           {
                              id: "28.94.4",
                              title: "Производство бытовых швейных машин"
                           },
                           {
                              id: "28.94.5",
                              title: "Производство составных частей и принадлежностей машин для текстильного и швейного производства и для обработки кож"
                           }]
                     },
                     {
                        id: "28.95",
                        title: "Производство машин и оборудования для изготовления бумаги и картона"
                     },
                     {
                        id: "28.96",
                        title: "Производство машин и оборудования для переработки пластмасс и резины"
                     },
                     {
                        id: "28.99",
                        title: "Производство прочих машин и оборудования специального назначения, не включенных в другие группировки",
                        children: [
                           {
                              id: "28.99.1",
                              title: "Производство переплетного, наборного, включая фотонаборные машины, печатного оборудования и его составных частей"
                           },
                           {
                              id: "28.99.2",
                              title: "Производство оборудования и аппаратуры для производства полупроводниковых слитков или пластин, полупроводниковых устройств, электронных интегральных микросхем или плоскопанельных дисплеев"
                           },
                           {
                              id: "28.99.3",
                              title: "Производство пусковых устройств для воздушных судов, катапультирующих устройств для воздушных судов и т.п. оборудования"
                           },
                           {
                              id: "28.99.4",
                              title: "Производство оборудования технологического специального для объектов использования атомной энергии",
                              children: [
                                 {
                                    id: "28.99.41",
                                    title: "Производство оборудования и устройств по разделению изотопов"
                                 },
                                 {
                                    id: "28.99.42",
                                    title: "Производство оборудования и устройств для транспортировки продуктов"
                                 },
                                 {
                                    id: "28.99.43",
                                    title: "Производство оборудования для автоматизированных систем управления технологическим процессом атомных электростанций"
                                 },
                                 {
                                    id: "28.99.49",
                                    title: "Производство оборудования технологического специального прочего для объектов использования атомной энергии, не включенного в другие группировки"
                                 }]
                           },
                           {
                              id: "28.99.9",
                              title: "Производство оборудования специального назначения, не включенного в другие группировки"
                           }]
                     }]
               }]
         },
         {
            id: "29",
            title: "Производство автотранспортных средств, прицепов и полуприцепов",
            children: [
               {
                  id: "29.1",
                  title: "Производство автотранспортных средств",
                  children: [
                     {
                        id: "29.10",
                        title: "Производство автотранспортных средств",
                        children: [
                           {
                              id: "29.10.1",
                              title: "Производство двигателей внутреннего сгорания автотранспортных средств",
                              children: [
                                 {
                                    id: "29.10.11",
                                    title: "Производство двигателей внутреннего сгорания с искровым зажиганием с рабочим объемом цилиндров не более 1000"
                                 },
                                 {
                                    id: "29.10.12",
                                    title: "Производство двигателей внутреннего сгорания с рабочим объемом цилиндров более 1000"
                                 },
                                 {
                                    id: "29.10.13",
                                    title: "Производство двигателей внутреннего сгорания с воспламенением от сжатия"
                                 }]
                           },
                           {
                              id: "29.10.2",
                              title: "Производство легковых автомобилей"
                           },
                           {
                              id: "29.10.3",
                              title: "Производство автобусов и троллейбусов",
                              children: [
                                 {
                                    id: "29.10.31",
                                    title: "Производство автобусов"
                                 },
                                 {
                                    id: "29.10.32",
                                    title: "Производство троллейбусов"
                                 }]
                           },
                           {
                              id: "29.10.4",
                              title: "Производство грузовых автомобилей"
                           },
                           {
                              id: "29.10.5",
                              title: "Производство автомобилей специального назначения"
                           }]
                     }]
               },
               {
                  id: "29.2",
                  title: "Производство кузовов для автотранспортных средств; производство прицепов и полуприцепов",
                  children: [
                     {
                        id: "29.20",
                        title: "Производство кузовов для автотранспортных средств; производство прицепов и полуприцепов",
                        children: [
                           {
                              id: "29.20.1",
                              title: "Производство кузовов для легковых автомобилей"
                           },
                           {
                              id: "29.20.2",
                              title: "Производство кузовов для грузовых автомобилей"
                           },
                           {
                              id: "29.20.3",
                              title: "Производство кузовов для автобусов"
                           },
                           {
                              id: "29.20.4",
                              title: "Производство прицепов и полуприцепов"
                           },
                           {
                              id: "29.20.5",
                              title: "Производство грузовых контейнеров"
                           }]
                     }]
               },
               {
                  id: "29.3",
                  title: "Производство комплектующих и принадлежностей для автотранспортных средств",
                  children: [
                     {
                        id: "29.31",
                        title: "Производство электрического и электронного оборудования для автотранспортных средств"
                     },
                     {
                        id: "29.32",
                        title: "Производство прочих комплектующих и принадлежностей для автотранспортных средств",
                        children: [
                           {
                              id: "29.32.1",
                              title: "Производство сидений для автотранспортных средств"
                           },
                           {
                              id: "29.32.2",
                              title: "Производство ремней безопасности, подушек безопасности, их частей и принадлежностей кузовов"
                           },
                           {
                              id: "29.32.3",
                              title: "Производство частей и принадлежностей для автотранспортных средств, не включенных в другие группировки"
                           }]
                     }]
               }]
         },
         {
            id: "30",
            title: "Производство прочих транспортных средств и оборудования",
            children: [
               {
                  id: "30.1",
                  title: "Строительство кораблей, судов и лодок",
                  children: [
                     {
                        id: "30.11",
                        title: "Строительство кораблей, судов и плавучих конструкций"
                     },
                     {
                        id: "30.12",
                        title: "Строительство прогулочных и спортивных судов"
                     }]
               },
               {
                  id: "30.2",
                  title: "Производство железнодорожных локомотивов и подвижного состава",
                  children: [
                     {
                        id: "30.20",
                        title: "Производство железнодорожных локомотивов и подвижного состава",
                        children: [
                           {
                              id: "30.20.1",
                              title: "Производство железнодорожных локомотивов",
                              children: [
                                 {
                                    id: "30.20.11",
                                    title: "Производство магистральных электровозов"
                                 },
                                 {
                                    id: "30.20.12",
                                    title: "Производство магистральных тепловозов"
                                 },
                                 {
                                    id: "30.20.13",
                                    title: "Производство маневровых тепловозов"
                                 }]
                           },
                           {
                              id: "30.20.2",
                              title: "Производство моторных железнодорожных, трамвайных вагонов и вагонов метро, автодрезин, кроме транспортных средств для ремонта и технического обслуживания железнодорожных и трамвайных путей"
                           },
                           {
                              id: "30.20.3",
                              title: "Производство прочего подвижного состава",
                              children: [
                                 {
                                    id: "30.20.31",
                                    title: "Производство транспортных средств для ремонта и технического обслуживания железнодорожных, трамвайных и прочих путей"
                                 },
                                 {
                                    id: "30.20.32",
                                    title: "Производство немоторных пассажирских железнодорожных, трамвайных вагонов и вагонов метро, багажных, почтовых и прочих вагонов специального назначения, кроме вагонов, предназначенных для ремонта и технического обслуживания путей"
                                 },
                                 {
                                    id: "30.20.33",
                                    title: "Производство несамоходных железнодорожных, трамвайных и прочих вагонов для перевозки грузов"
                                 }]
                           },
                           {
                              id: "30.20.4",
                              title: "Производство частей железнодорожных локомотивов, трамвайных и прочих моторных вагонов и подвижного состава; производство путевого оборудования и устройств для железнодорожных, трамвайных и прочих путей, механического и электромеханического оборудования для управления движением"
                           },
                           {
                              id: "30.20.9",
                              title: "Предоставление услуг по восстановлению и оснащению (завершению) железнодорожных локомотивов, трамвайных моторных вагонов и прочего подвижного состава"
                           }]
                     }]
               },
               {
                  id: "30.3",
                  title: "Производство летательных аппаратов, включая космические, и соответствующего оборудования",
                  children: [
                     {
                        id: "30.30",
                        title: "Производство летательных аппаратов, включая космические, и соответствующего оборудования",
                        children: [
                           {
                              id: "30.30.1",
                              title: "Производство силовых установок и двигателей для летательных аппаратов, включая космические; наземных тренажеров для летного состава; их частей",
                              children: [
                                 {
                                    id: "30.30.11",
                                    title: "Производство двигателей летательных аппаратов с искровым зажиганием и их частей"
                                 },
                                 {
                                    id: "30.30.12",
                                    title: "Производство турбореактивных и турбовинтовых двигателей и их частей"
                                 },
                                 {
                                    id: "30.30.13",
                                    title: "Производство реактивных двигателей и их частей"
                                 },
                                 {
                                    id: "30.30.14",
                                    title: "Производство наземных тренажеров для летного состава и их частей"
                                 }]
                           },
                           {
                              id: "30.30.2",
                              title: "Производство аэростатов, дирижаблей, планеров, дельтапланов и прочих безмоторных летательных аппаратов"
                           },
                           {
                              id: "30.30.3",
                              title: "Производство вертолетов, самолетов и прочих летательных аппаратов",
                              children: [
                                 {
                                    id: "30.30.31",
                                    title: "Производство вертолетов"
                                 },
                                 {
                                    id: "30.30.32",
                                    title: "Производство самолетов"
                                 },
                                 {
                                    id: "30.30.39",
                                    title: "Производство прочих летательных аппаратов"
                                 }]
                           },
                           {
                              id: "30.30.4",
                              title: "Производство космических аппаратов (в том числе спутников), ракет-носителей",
                              children: [
                                 {
                                    id: "30.30.41",
                                    title: "Производство автоматических космических аппаратов"
                                 },
                                 {
                                    id: "30.30.42",
                                    title: "Производство пилотируемых и беспилотных космических кораблей и станций, включая орбитальные, межпланетные, многоразового использования"
                                 },
                                 {
                                    id: "30.30.43",
                                    title: "Производство ракет-носителей"
                                 },
                                 {
                                    id: "30.30.44",
                                    title: "Производство межконтинентальных баллистических ракет"
                                 }]
                           },
                           {
                              id: "30.30.5",
                              title: "Производство частей и принадлежностей летательных и космических аппаратов"
                           }]
                     }]
               },
               {
                  id: "30.4",
                  title: "Производство военных боевых машин",
                  children: [
                     {
                        id: "30.40",
                        title: "Производство военных боевых машин"
                     }]
               },
               {
                  id: "30.9",
                  title: "Производство транспортных средств и оборудования, не включенных в другие группировки",
                  children: [
                     {
                        id: "30.91",
                        title: "Производство мотоциклов"
                     },
                     {
                        id: "30.92",
                        title: "Производство велосипедов и инвалидных колясок",
                        children: [
                           {
                              id: "30.92.1",
                              title: "Производство велосипедов"
                           },
                           {
                              id: "30.92.2",
                              title: "Производство инвалидных колясок"
                           },
                           {
                              id: "30.92.3",
                              title: "Производство частей и принадлежности велосипедов и инвалидных колясок"
                           },
                           {
                              id: "30.92.4",
                              title: "Производство детских колясок и их частей"
                           }]
                     },
                     {
                        id: "30.99",
                        title: "Производство прочих транспортных средств и оборудования, не включенных в другие группировки"
                     }]
               }]
         },
         {
            id: "31",
            title: "Производство мебели",
            children: [
               {
                  id: "31.0",
                  title: "Производство мебели",
                  children: [
                     {
                        id: "31.01",
                        title: "Производство мебели для офисов и предприятий торговли"
                     },
                     {
                        id: "31.02",
                        title: "Производство кухонной мебели",
                        children: [
                           {
                              id: "31.02.1",
                              title: "Производство кухонной мебели, кроме изготовленной по индивидуальному заказу населения"
                           },
                           {
                              id: "31.02.2",
                              title: "Изготовление кухонной мебели по индивидуальному заказу населения"
                           }]
                     },
                     {
                        id: "31.03",
                        title: "Производство матрасов"
                     },
                     {
                        id: "31.09",
                        title: "Производство прочей мебели",
                        children: [
                           {
                              id: "31.09.1",
                              title: "Производство прочей мебели, кроме изготовленной по индивидуальному заказу населения"
                           },
                           {
                              id: "31.09.2",
                              title: "Изготовление прочей мебели и отдельных мебельных деталей, не включенных в другие группировки по индивидуальному заказу населения"
                           }]
                     }]
               }]
         },
         {
            id: "32",
            title: "Производство прочих готовых изделий",
            children: [
               {
                  id: "32.1",
                  title: "Производство ювелирных изделий, бижутерии и подобных товаров",
                  children: [
                     {
                        id: "32.11",
                        title: "Чеканка монет"
                     },
                     {
                        id: "32.12",
                        title: "Производство ювелирных изделий и аналогичных изделий",
                        children: [
                           {
                              id: "32.12.1",
                              title: "Производство изделий технического назначения из драгоценных металлов"
                           },
                           {
                              id: "32.12.2",
                              title: "Производство изделий технического назначения из драгоценных камней"
                           },
                           {
                              id: "32.12.3",
                              title: "Обработка алмазов"
                           },
                           {
                              id: "32.12.4",
                              title: "Обработка драгоценных, полудрагоценных, поделочных и синтетических камней, кроме алмазов и янтаря; производство изделий из полудрагоценных, поделочных и синтетических камней, кроме янтаря"
                           },
                           {
                              id: "32.12.5",
                              title: "Производство ювелирных изделий, медалей из драгоценных металлов и драгоценных камней"
                           },
                           {
                              id: "32.12.6",
                              title: "Изготовление ювелирных изделий и аналогичных изделий по индивидуальному заказу населения"
                           },
                           {
                              id: "32.12.7",
                              title: "Обработка янтаря и производство изделий из янтаря"
                           }]
                     },
                     {
                        id: "32.13",
                        title: "Производство бижутерии и подобных товаров",
                        children: [
                           {
                              id: "32.13.1",
                              title: "Производство бижутерии и подобных товаров, кроме изготовленных по индивидуальному заказу"
                           },
                           {
                              id: "32.13.2",
                              title: "Изготовление бижутерии и подобных товаров по индивидуальному заказу населения"
                           }]
                     }]
               },
               {
                  id: "32.2",
                  title: "Производство музыкальных инструментов",
                  children: [
                     {
                        id: "32.20",
                        title: "Производство музыкальных инструментов"
                     }]
               },
               {
                  id: "32.3",
                  title: "Производство спортивных товаров",
                  children: [
                     {
                        id: "32.30",
                        title: "Производство спортивных товаров"
                     }]
               },
               {
                  id: "32.4",
                  title: "Производство игр и игрушек",
                  children: [
                     {
                        id: "32.40",
                        title: "Производство игр и игрушек"
                     }]
               },
               {
                  id: "32.5",
                  title: "Производство медицинских инструментов и оборудования",
                  children: [
                     {
                        id: "32.50",
                        title: "Производство медицинских инструментов и оборудования"
                     }]
               },
               {
                  id: "32.9",
                  title: "Производство изделий, не включенных в другие группировки",
                  children: [
                     {
                        id: "32.91",
                        title: "Производство метелок и щеток"
                     },
                     {
                        id: "32.99",
                        title: "Производство прочих готовых изделий, не включенных в другие группировки",
                        children: [
                           {
                              id: "32.99.1",
                              title: "Производство головных защитных уборов и прочих средств защиты"
                           },
                           {
                              id: "32.99.2",
                              title: "Производство пишущих принадлежностей"
                           },
                           {
                              id: "32.99.3",
                              title: "Производство зонтов, тростей, пуговиц, кнопок, застежек-молний"
                           },
                           {
                              id: "32.99.4",
                              title: "Производство изделий из волоса человека или животных; производство аналогичных изделий из текстильных материалов"
                           },
                           {
                              id: "32.99.5",
                              title: "Производство зажигалок и прочих курительных принадлежностей"
                           },
                           {
                              id: "32.99.6",
                              title: "Производство изделий для праздников, карнавалов или прочих изделий для увеселения"
                           },
                           {
                              id: "32.99.7",
                              title: "Производство приборов, аппаратуры и моделей, предназначенных для демонстрационных целей"
                           },
                           {
                              id: "32.99.8",
                              title: "Производство изделий народных художественных промыслов"
                           },
                           {
                              id: "32.99.9",
                              title: "Производство прочих изделий, не включенных в другие группировки"
                           }]
                     }]
               }]
         },
         {
            id: "33",
            title: "Ремонт и монтаж машин и оборудования",
            children: [
               {
                  id: "33.1",
                  title: "Ремонт и монтаж металлических изделий, машин и оборудования",
                  children: [
                     {
                        id: "33.11",
                        title: "Ремонт металлоизделий"
                     },
                     {
                        id: "33.12",
                        title: "Ремонт машин и оборудования"
                     },
                     {
                        id: "33.13",
                        title: "Ремонт электронного и оптического оборудования"
                     },
                     {
                        id: "33.14",
                        title: "Ремонт электрического оборудования"
                     },
                     {
                        id: "33.15",
                        title: "Ремонт и техническое обслуживание судов и лодок"
                     },
                     {
                        id: "33.16",
                        title: "Ремонт и техническое обслуживание летательных аппаратов, включая космические"
                     },
                     {
                        id: "33.17",
                        title: "Ремонт и техническое обслуживание прочих транспортных средств и оборудования"
                     },
                     {
                        id: "33.19",
                        title: "Ремонт прочего оборудования"
                     }]
               },
               {
                  id: "33.2",
                  title: "Монтаж промышленных машин и оборудования",
                  children: [
                     {
                        id: "33.20",
                        title: "Монтаж промышленных машин и оборудования"
                     }]
               }]
         }]
   },
   {
      id: "Раздел D",
      title: "Обеспечение электрической энергией, газом и паром; кондиционирование воздуха",
      children: [
         {
            id: "35",
            title: "Обеспечение электрической энергией, газом и паром; кондиционирование воздуха",
            children: [
               {
                  id: "35.1",
                  title: "Производство, передача и распределение электроэнергии",
                  children: [
                     {
                        id: "35.11",
                        title: "Производство электроэнергии",
                        children: [
                           {
                              id: "35.11.1",
                              title: "Производство электроэнергии тепловыми электростанциями, в том числе деятельность по обеспечению работоспособности электростанций"
                           },
                           {
                              id: "35.11.2",
                              title: "Производство электроэнергии гидроэлектростанциями, в том числе деятельность по обеспечению работоспособности электростанций"
                           },
                           {
                              id: "35.11.3",
                              title: "Производство электроэнергии атомными электростанциями, в том числе деятельность по обеспечению работоспособности электростанций"
                           },
                           {
                              id: "35.11.4",
                              title: "Производство электроэнергии, получаемой из возобновляемых источников энергии, включая выработанную солнечными, ветровыми, геотермальными электростанциями, в том числе деятельность по обеспечению их работоспособности"
                           }]
                     },
                     {
                        id: "35.12",
                        title: "Передача электроэнергии и технологическое присоединение к распределительным электросетям",
                        children: [
                           {
                              id: "35.12.1",
                              title: "Передача электроэнергии"
                           },
                           {
                              id: "35.12.2",
                              title: "Технологическое присоединение к распределительным электросетям"
                           }]
                     },
                     {
                        id: "35.13",
                        title: "Распределение электроэнергии"
                     },
                     {
                        id: "35.14",
                        title: "Торговля электроэнергией"
                     }]
               },
               {
                  id: "35.2",
                  title: "Производство и распределение газообразного топлива",
                  children: [
                     {
                        id: "35.21",
                        title: "Производство газа",
                        children: [
                           {
                              id: "35.21.1",
                              title: "Газификация угля",
                              children: [
                                 {
                                    id: "35.21.11",
                                    title: "Газификация антрацита"
                                 },
                                 {
                                    id: "35.21.12",
                                    title: "Газификация каменного угля за исключением антрацита"
                                 },
                                 {
                                    id: "35.21.13",
                                    title: "Газификация бурого угля (лигнита)"
                                 }]
                           },
                           {
                              id: "35.21.2",
                              title: "Сжижение углей",
                              children: [
                                 {
                                    id: "35.21.21",
                                    title: "Сжижение антрацита"
                                 },
                                 {
                                    id: "35.21.22",
                                    title: "Сжижение каменного угля за исключением антрацита"
                                 },
                                 {
                                    id: "35.21.23",
                                    title: "Сжижение бурого угля (лигнита)"
                                 }]
                           }]
                     },
                     {
                        id: "35.22",
                        title: "Распределение газообразного топлива по газораспределительным сетям",
                        children: [
                           {
                              id: "35.22.1",
                              title: "Распределение природного, сухого (отбензиненного) газа по газораспределительным сетям",
                              children: [
                                 {
                                    id: "35.22.11",
                                    title: "Распределение природного, сухого (отбензиненного) газа по газораспределительным сетям по тарифам, регулируемым государством"
                                 },
                                 {
                                    id: "35.22.12",
                                    title: "Распределение природного, сухого (отбензиненного) газа по газораспределительным сетям по тарифам, не регулируемым государством"
                                 }]
                           },
                           {
                              id: "35.22.2",
                              title: "Распределение сжиженных углеводородных газов по газораспределительным сетям",
                              children: [
                                 {
                                    id: "35.22.21",
                                    title: "Распределение сжиженных углеводородных газов по газораспределительным сетям по тарифам, регулируемым государством"
                                 },
                                 {
                                    id: "35.22.22",
                                    title: "Распределение сжиженных углеводородных газов по газораспределительным сетям по тарифам, не регулируемым государством"
                                 }]
                           }]
                     },
                     {
                        id: "35.23",
                        title: "Торговля газообразным топливом, подаваемым по распределительным сетям",
                        children: [
                           {
                              id: "35.23.1",
                              title: "Торговля природным, сухим (отбензиненным) газом, подаваемым по распределительным сетям",
                              children: [
                                 {
                                    id: "35.23.11",
                                    title: "Торговля природным, сухим (отбензиненным) газом, подаваемым по распределительным сетям по регулируемым государством ценам (тарифам)"
                                 },
                                 {
                                    id: "35.23.12",
                                    title: "Торговля природным, сухим (отбензиненным) газом, подаваемым по распределительным сетям по не регулируемым государством ценам (тарифам)"
                                 }]
                           },
                           {
                              id: "35.23.2",
                              title: "Торговля сжиженными углеводородными газами, подаваемыми по распределительным сетям",
                              children: [
                                 {
                                    id: "35.23.21",
                                    title: "Торговля сжиженными углеводородными газами, подаваемыми по распределительным сетям по регулируемым государством ценам (тарифам)"
                                 },
                                 {
                                    id: "35.23.22",
                                    title: "Торговля сжиженными углеводородными газами, подаваемыми по распределительным сетям по не регулируемым государством ценам (тарифам)"
                                 }]
                           }]
                     }]
               },
               {
                  id: "35.3",
                  title: "Производство, передача и распределение пара и горячей воды; кондиционирование воздуха",
                  children: [
                     {
                        id: "35.30",
                        title: "Производство, передача и распределение пара и горячей воды; кондиционирование воздуха",
                        children: [
                           {
                              id: "35.30.1",
                              title: "Производство пара и горячей воды (тепловой энергии)",
                              children: [
                                 {
                                    id: "35.30.11",
                                    title: "Производство пара и горячей воды (тепловой энергии) тепловыми электростанциями"
                                 },
                                 {
                                    id: "35.30.12",
                                    title: "Производство пара и горячей воды (тепловой энергии) атомными электростанциями"
                                 },
                                 {
                                    id: "35.30.13",
                                    title: "Производство пара и горячей воды (тепловой энергии) прочими электростанциями и промышленными блок-станциями"
                                 },
                                 {
                                    id: "35.30.14",
                                    title: "Производство пара и горячей воды (тепловой энергии) котельными"
                                 },
                                 {
                                    id: "35.30.15",
                                    title: "Производство охлажденной воды или льда (натурального из воды) для целей охлаждения"
                                 }]
                           },
                           {
                              id: "35.30.2",
                              title: "Передача пара и горячей воды (тепловой энергии)"
                           },
                           {
                              id: "35.30.3",
                              title: "Распределение пара и горячей воды (тепловой энергии)"
                           },
                           {
                              id: "35.30.4",
                              title: "Обеспечение работоспособности котельных"
                           },
                           {
                              id: "35.30.5",
                              title: "Обеспечение работоспособности тепловых сетей"
                           },
                           {
                              id: "35.30.6",
                              title: "Торговля паром и горячей водой (тепловой энергией)"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел E",
      title: "Водоснабжение; водоотведение, организация сбора и утилизации отходов, деятельность по ликвидации загрязнений",
      children: [
         {
            id: "36",
            title: "Забор, очистка и распределение воды",
            children: [
               {
                  id: "36.0",
                  title: "Забор, очистка и распределение воды",
                  children: [
                     {
                        id: "36.00",
                        title: "Забор, очистка и распределение воды",
                        children: [
                           {
                              id: "36.00.1",
                              title: "Забор и очистка воды для питьевых и промышленных нужд"
                           },
                           {
                              id: "36.00.2",
                              title: "Распределение воды для питьевых и промышленных нужд"
                           }]
                     }]
               }]
         },
         {
            id: "37",
            title: "Сбор и обработка сточных вод",
            children: [
               {
                  id: "37.0",
                  title: "Сбор и обработка сточных вод",
                  children: [
                     {
                        id: "37.00",
                        title: "Сбор и обработка сточных вод"
                     }]
               }]
         },
         {
            id: "38",
            title: "Сбор, обработка и утилизация отходов; обработка вторичного сырья",
            children: [
               {
                  id: "38.1",
                  title: "Сбор отходов",
                  children: [
                     {
                        id: "38.11",
                        title: "Сбор неопасных отходов"
                     },
                     {
                        id: "38.12",
                        title: "Сбор опасных отходов"
                     }]
               },
               {
                  id: "38.2",
                  title: "Обработка и утилизация отходов",
                  children: [
                     {
                        id: "38.21",
                        title: "Обработка и утилизация неопасных отходов"
                     },
                     {
                        id: "38.22",
                        title: "Обработка и утилизация опасных отходов",
                        children: [
                           {
                              id: "38.22.1",
                              title: "Обработка и утилизация радиоактивных отходов",
                              children: [
                                 {
                                    id: "38.22.11",
                                    title: "Деятельность по обращению с отработавшим ядерным топливом"
                                 },
                                 {
                                    id: "38.22.12",
                                    title: "Деятельность по обращению с особыми радиоактивными отходами"
                                 },
                                 {
                                    id: "38.22.13",
                                    title: "Деятельность по обращению с удаляемыми радиоактивными отходами"
                                 }]
                           },
                           {
                              id: "38.22.9",
                              title: "Обработка и утилизация опасных отходов прочих, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "38.3",
                  title: "Деятельность по обработке вторичного сырья",
                  children: [
                     {
                        id: "38.31",
                        title: "Демонтаж техники, не подлежащей восстановлению"
                     },
                     {
                        id: "38.32",
                        title: "Утилизация отсортированных материалов",
                        children: [
                           {
                              id: "38.32.1",
                              title: "Сортировка материалов для дальнейшего использования",
                              children: [
                                 {
                                    id: "38.32.11",
                                    title: "Сортировка металлических материалов для дальнейшего использования"
                                 },
                                 {
                                    id: "38.32.12",
                                    title: "Сортировка неметаллических материалов для дальнейшего использования"
                                 }]
                           },
                           {
                              id: "38.32.2",
                              title: "Обработка отходов и лома драгоценных металлов"
                           },
                           {
                              id: "38.32.3",
                              title: "Обработка отходов и лома черных металлов"
                           },
                           {
                              id: "38.32.4",
                              title: "Обработка отходов и лома цветных металлов",
                              children: [
                                 {
                                    id: "38.32.41",
                                    title: "Обработка отходов и лома металлов, содержащих медь"
                                 },
                                 {
                                    id: "38.32.42",
                                    title: "Обработка отходов и лома металлов, содержащих никель"
                                 },
                                 {
                                    id: "38.32.43",
                                    title: "Обработка отходов и лома металлов, содержащих алюминий"
                                 },
                                 {
                                    id: "38.32.49",
                                    title: "Обработка вторичного сырья, содержащего прочие цветные металлы"
                                 }]
                           },
                           {
                              id: "38.32.5",
                              title: "Обработка вторичного неметаллического сырья",
                              children: [
                                 {
                                    id: "38.32.51",
                                    title: "Обработка отходов и лома стекла"
                                 },
                                 {
                                    id: "38.32.52",
                                    title: "Обработка отходов бумаги и картона"
                                 },
                                 {
                                    id: "38.32.53",
                                    title: "Обработка отходов и лома пластмасс"
                                 },
                                 {
                                    id: "38.32.54",
                                    title: "Обработка отходов резины"
                                 },
                                 {
                                    id: "38.32.55",
                                    title: "Обработка отходов текстильных материалов"
                                 },
                                 {
                                    id: "38.32.59",
                                    title: "Обработка прочего вторичного неметаллического сырья"
                                 }]
                           }]
                     }]
               }]
         },
         {
            id: "39",
            title: "Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов",
            children: [
               {
                  id: "39.0",
                  title: "Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов",
                  children: [
                     {
                        id: "39.00",
                        title: "Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов"
                     }]
               }]
         }]
   },
   {
      id: "Раздел F",
      title: "Строительство",
      children: [
         {
            id: "41",
            title: "Строительство зданий",
            children: [
               {
                  id: "41.1",
                  title: "Разработка строительных проектов",
                  children: [
                     {
                        id: "41.10",
                        title: "Разработка строительных проектов"
                     }]
               },
               {
                  id: "41.2",
                  title: "Строительство жилых и нежилых зданий",
                  children: [
                     {
                        id: "41.20",
                        title: "Строительство жилых и нежилых зданий"
                     }]
               }]
         },
         {
            id: "42",
            title: "Строительство инженерных сооружений",
            children: [
               {
                  id: "42.1",
                  title: "Строительство автомобильных и железных дорог",
                  children: [
                     {
                        id: "42.11",
                        title: "Строительство автомобильных дорог и автомагистралей"
                     },
                     {
                        id: "42.12",
                        title: "Строительство железных дорог и метро"
                     },
                     {
                        id: "42.13",
                        title: "Строительство мостов и тоннелей"
                     }]
               },
               {
                  id: "42.2",
                  title: "Строительство инженерных коммуникаций",
                  children: [
                     {
                        id: "42.21",
                        title: "Строительство инженерных коммуникаций для водоснабжения и водоотведения, газоснабжения"
                     },
                     {
                        id: "42.22",
                        title: "Строительство коммунальных объектов для обеспечения электроэнергией и телекоммуникациями",
                        children: [
                           {
                              id: "42.22.1",
                              title: "Строительство междугородних линий электропередачи и связи"
                           },
                           {
                              id: "42.22.2",
                              title: "Строительство местных линий электропередачи и связи"
                           },
                           {
                              id: "42.22.3",
                              title: "Строительство электростанций"
                           }]
                     }]
               },
               {
                  id: "42.9",
                  title: "Строительство прочих инженерных сооружений",
                  children: [
                     {
                        id: "42.91",
                        title: "Строительство водных сооружений",
                        children: [
                           {
                              id: "42.91.1",
                              title: "Строительство портовых сооружений"
                           },
                           {
                              id: "42.91.2",
                              title: "Строительство гидротехнических сооружений"
                           },
                           {
                              id: "42.91.3",
                              title: "Строительство ирригационных систем"
                           },
                           {
                              id: "42.91.4",
                              title: "Производство дноочистительных, дноуглубительных и берегоукрепительных работ"
                           },
                           {
                              id: "42.91.5",
                              title: "Производство подводных работ, включая водолазные"
                           }]
                     },
                     {
                        id: "42.99",
                        title: "Строительство прочих инженерных сооружений, не включенных в другие группировки"
                     }]
               }]
         },
         {
            id: "43",
            title: "Работы строительные специализированные",
            children: [
               {
                  id: "43.1",
                  title: "Разборка и снос зданий, подготовка строительного участка",
                  children: [
                     {
                        id: "43.11",
                        title: "Разборка и снос зданий"
                     },
                     {
                        id: "43.12",
                        title: "Подготовка строительной площадки",
                        children: [
                           {
                              id: "43.12.1",
                              title: "Расчистка территории строительной площадки"
                           },
                           {
                              id: "43.12.2",
                              title: "Производство дренажных работ на сельскохозяйственных землях, землях лесных территорий, а также на строительных площадках"
                           },
                           {
                              id: "43.12.3",
                              title: "Производство земляных работ"
                           },
                           {
                              id: "43.12.4",
                              title: "Подготовка участка к разработке и добыче полезных ископаемых, за исключением нефтяных и газовых участков"
                           }]
                     },
                     {
                        id: "43.13",
                        title: "Разведочное бурение"
                     }]
               },
               {
                  id: "43.2",
                  title: "Производство электромонтажных, санитарно-технических и прочих строительно-монтажных работ",
                  children: [
                     {
                        id: "43.21",
                        title: "Производство электромонтажных работ"
                     },
                     {
                        id: "43.22",
                        title: "Производство санитарно-технических работ, монтаж отопительных систем и систем кондиционирования воздуха"
                     },
                     {
                        id: "43.29",
                        title: "Производство прочих строительно-монтажных работ"
                     }]
               },
               {
                  id: "43.3",
                  title: "Работы строительные отделочные",
                  children: [
                     {
                        id: "43.31",
                        title: "Производство штукатурных работ"
                     },
                     {
                        id: "43.32",
                        title: "Работы столярные и плотничные",
                        children: [
                           {
                              id: "43.32.1",
                              title: "Установка дверей (кроме автоматических и вращающихся), окон, дверных и оконных рам из дерева или прочих материалов"
                           },
                           {
                              id: "43.32.2",
                              title: "Работы по установке внутренних лестниц, встроенных шкафов, встроенного кухонного оборудования"
                           },
                           {
                              id: "43.32.3",
                              title: "Производство работ по внутренней отделке зданий (включая потолки, раздвижные и съемные перегородки и т.д.)"
                           }]
                     },
                     {
                        id: "43.33",
                        title: "Работы по устройству покрытий полов и облицовке стен"
                     },
                     {
                        id: "43.34",
                        title: "Производство малярных и стекольных работ",
                        children: [
                           {
                              id: "43.34.1",
                              title: "Производство малярных работ"
                           },
                           {
                              id: "43.34.2",
                              title: "Производство стекольных работ"
                           }]
                     },
                     {
                        id: "43.39",
                        title: "Производство прочих отделочных и завершающих работ"
                     }]
               },
               {
                  id: "43.9",
                  title: "Работы строительные специализированные прочие",
                  children: [
                     {
                        id: "43.91",
                        title: "Производство кровельных работ"
                     },
                     {
                        id: "43.99",
                        title: "Работы строительные специализированные прочие, не включенные в другие группировки",
                        children: [
                           {
                              id: "43.99.1",
                              title: "Работы гидроизоляционные"
                           },
                           {
                              id: "43.99.2",
                              title: "Работы по установке строительных лесов и подмостей"
                           },
                           {
                              id: "43.99.3",
                              title: "Работы свайные и работы по строительству фундаментов"
                           },
                           {
                              id: "43.99.4",
                              title: "Работы бетонные и железобетонные"
                           },
                           {
                              id: "43.99.5",
                              title: "Работы по монтажу стальных строительных конструкций"
                           },
                           {
                              id: "43.99.6",
                              title: "Работы каменные и кирпичные"
                           },
                           {
                              id: "43.99.7",
                              title: "Работы по сборке и монтажу сборных конструкций"
                           },
                           {
                              id: "43.99.9",
                              title: "Работы строительные специализированные, не включенные в другие группировки"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел G",
      title: "Торговля оптовая и розничная; ремонт автотранспортных средств и мотоциклов",
      children: [
         {
            id: "45",
            title: "Торговля оптовая и розничная автотранспортными средствами и мотоциклами и их ремонт",
            children: [
               {
                  id: "45.1",
                  title: "Торговля автотранспортными средствами",
                  children: [
                     {
                        id: "45.11",
                        title: "Торговля легковыми автомобилями и грузовыми автомобилями малой грузоподъемности",
                        children: [
                           {
                              id: "45.11.1",
                              title: "Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами"
                           },
                           {
                              id: "45.11.2",
                              title: "Торговля розничная легковыми автомобилями и легкими автотранспортными средствами в специализированных магазинах"
                           },
                           {
                              id: "45.11.3",
                              title: "Торговля розничная легковыми автомобилями и легкими автотранспортными средствами прочая",
                              children: [
                                 {
                                    id: "45.11.31",
                                    title: "Торговля розничная легковыми автомобилями и легкими автотранспортными средствами через информационно-коммуникационную сеть Интернет"
                                 },
                                 {
                                    id: "45.11.39",
                                    title: "Торговля розничная легковыми автомобилями и легкими автотранспортными средствами прочая, не включенная в другие группировки"
                                 }]
                           },
                           {
                              id: "45.11.4",
                              title: "Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами за вознаграждение или на договорной основе",
                              children: [
                                 {
                                    id: "45.11.41",
                                    title: "Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами через информационно-коммуникационную сеть Интернет за вознаграждение или на договорной основе"
                                 },
                                 {
                                    id: "45.11.49",
                                    title: "Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами за вознаграждение или на договорной основе прочая"
                                 }]
                           }]
                     },
                     {
                        id: "45.19",
                        title: "Торговля прочими автотранспортными средствами",
                        children: [
                           {
                              id: "45.19.1",
                              title: "Торговля оптовая прочими автотранспортными средствами, кроме пассажирских"
                           },
                           {
                              id: "45.19.2",
                              title: "Торговля розничная прочими автотранспортными средствами, кроме пассажирских, в специализированных магазинах"
                           },
                           {
                              id: "45.19.3",
                              title: "Торговля розничная прочими автотранспортными средствами, кроме пассажирских, прочая",
                              children: [
                                 {
                                    id: "45.19.31",
                                    title: "Торговля розничная прочими автотранспортными средствами, кроме пассажирских, через информационно-коммуникационную сеть Интернет"
                                 },
                                 {
                                    id: "45.19.39",
                                    title: "Торговля розничная прочими автотранспортными средствами, кроме пассажирских, прочая, не включенная в другие группировки"
                                 }]
                           },
                           {
                              id: "45.19.4",
                              title: "Торговля оптовая прочими автотранспортными средствами, кроме пассажирских, за вознаграждение или на договорной основе",
                              children: [
                                 {
                                    id: "45.19.41",
                                    title: "Торговля оптовая прочими автотранспортными средствами, кроме пассажирских, через информационно-коммуникационную сеть Интернет за вознаграждение или на договорной основе"
                                 },
                                 {
                                    id: "45.19.49",
                                    title: "Торговля оптовая прочими автотранспортными средствами, кроме пассажирских, за вознаграждение или на договорной основе прочая"
                                 }]
                           }]
                     }]
               },
               {
                  id: "45.2",
                  title: "Техническое обслуживание и ремонт автотранспортных средств",
                  children: [
                     {
                        id: "45.20",
                        title: "Техническое обслуживание и ремонт автотранспортных средств",
                        children: [
                           {
                              id: "45.20.1",
                              title: "Техническое обслуживание и ремонт легковых автомобилей и легких грузовых автотранспортных средств"
                           },
                           {
                              id: "45.20.2",
                              title: "Техническое обслуживание и ремонт прочих автотранспортных средств"
                           },
                           {
                              id: "45.20.3",
                              title: "Мойка автотранспортных средств, полирование и предоставление аналогичных услуг"
                           },
                           {
                              id: "45.20.4",
                              title: "Техническая помощь на дорогах и транспортирование неисправных автотранспортных средств к месту их ремонта или стоянки"
                           }]
                     }]
               },
               {
                  id: "45.3",
                  title: "Торговля автомобильными деталями, узлами и принадлежностями",
                  children: [
                     {
                        id: "45.31",
                        title: "Торговля оптовая автомобильными деталями, узлами и принадлежностями",
                        children: [
                           {
                              id: "45.31.1",
                              title: "Торговля оптовая автомобильными деталями, узлами и принадлежностями, кроме деятельности агентов"
                           },
                           {
                              id: "45.31.2",
                              title: "Деятельность агентов по оптовой торговле автомобильными деталями, узлами и принадлежностями"
                           }]
                     },
                     {
                        id: "45.32",
                        title: "Торговля розничная автомобильными деталями, узлами и принадлежностями",
                        children: [
                           {
                              id: "45.32.1",
                              title: "Торговля розничная автомобильными деталями, узлами и принадлежностями в специализированных магазинах"
                           },
                           {
                              id: "45.32.2",
                              title: "Торговля розничная автомобильными деталями, узлами и принадлежностями прочая",
                              children: [
                                 {
                                    id: "45.32.21",
                                    title: "Торговля розничная автомобильными деталями, узлами и принадлежностями через информационно-коммуникационную сеть Интернет"
                                 },
                                 {
                                    id: "45.32.22",
                                    title: "Торговля розничная автомобильными деталями, узлами и принадлежностями по почтовым заказам"
                                 },
                                 {
                                    id: "45.32.29",
                                    title: "Торговля розничная автомобильными деталями, узлами и принадлежностями прочая, не включенная в другие группировки"
                                 }]
                           }]
                     }]
               },
               {
                  id: "45.4",
                  title: "Торговля мотоциклами, их деталями, узлами и принадлежностями; техническое обслуживание и ремонт мотоциклов",
                  children: [
                     {
                        id: "45.40",
                        title: "Торговля мотоциклами, их деталями, узлами и принадлежностями; техническое обслуживание и ремонт мотоциклов",
                        children: [
                           {
                              id: "45.40.1",
                              title: "Торговля оптовая мотоциклами, их деталями, узлами и принадлежностями"
                           },
                           {
                              id: "45.40.2",
                              title: "Торговля розничная мотоциклами, их деталями, составными частями и принадлежностями в специализированных магазинах"
                           },
                           {
                              id: "45.40.3",
                              title: "Торговля розничная мотоциклами, их деталями, узлами и принадлежностями прочая"
                           },
                           {
                              id: "45.40.4",
                              title: "Деятельность агентов по оптовой торговле мотоциклами, их деталями, узлами и принадлежностями"
                           },
                           {
                              id: "45.40.5",
                              title: "Техническое обслуживание и ремонт мотоциклов и мототранспортных средств"
                           }]
                     }]
               }]
         },
         {
            id: "46",
            title: "Торговля оптовая, кроме оптовой торговли автотранспортными средствами и мотоциклами",
            children: [
               {
                  id: "46.1",
                  title: "Торговля оптовая за вознаграждение или на договорной основе",
                  children: [
                     {
                        id: "46.11",
                        title: "Деятельность агентов по оптовой торговле сельскохозяйственным сырьем, живыми животными, текстильным сырьем и полуфабрикатами",
                        children: [
                           {
                              id: "46.11.1",
                              title: "Деятельность агентов по оптовой торговле живыми животными"
                           },
                           {
                              id: "46.11.2",
                              title: "Деятельность агентов по оптовой торговле цветами и растениями"
                           },
                           {
                              id: "46.11.3",
                              title: "Деятельность агентов по оптовой торговле прочим сельскохозяйственным сырьем, текстильным сырьем и полуфабрикатами",
                              children: [
                                 {
                                    id: "46.11.31",
                                    title: "Деятельность агентов по оптовой торговле зерном"
                                 },
                                 {
                                    id: "46.11.32",
                                    title: "Деятельность агентов по оптовой торговле семенами, кроме семян масличных культур"
                                 },
                                 {
                                    id: "46.11.33",
                                    title: "Деятельность агентов по оптовой торговле семенами масличных культур"
                                 },
                                 {
                                    id: "46.11.34",
                                    title: "Деятельность агентов по оптовой торговле кормами для сельскохозяйственных животных"
                                 },
                                 {
                                    id: "46.11.35",
                                    title: "Деятельность агентов по оптовой торговле текстильным сырьем и полуфабрикатами"
                                 },
                                 {
                                    id: "46.11.39",
                                    title: "Деятельность агентов по оптовой торговле прочими сельскохозяйственным сырьем и сельскохозяйственными полуфабрикатами, не включенными в другие группировки"
                                 }]
                           }]
                     },
                     {
                        id: "46.12",
                        title: "Деятельность агентов по оптовой торговле топливом, рудами, металлами и химическими веществами",
                        children: [
                           {
                              id: "46.12.1",
                              title: "Деятельность агентов по оптовой торговле твердым, жидким и газообразным топливом и связанными продуктами"
                           },
                           {
                              id: "46.12.2",
                              title: "Деятельность агентов по оптовой торговле рудами и металлами в первичных формах",
                              children: [
                                 {
                                    id: "46.12.21",
                                    title: "Деятельность агентов по оптовой торговле рудами"
                                 },
                                 {
                                    id: "46.12.22",
                                    title: "Деятельность агентов по оптовой торговле металлами в первичных формах"
                                 }]
                           },
                           {
                              id: "46.12.3",
                              title: "Деятельность агентов по оптовой торговле промышленными и техническими химическими веществами, удобрениями и агрохимикатами",
                              children: [
                                 {
                                    id: "46.12.31",
                                    title: "Деятельность агентов по оптовой торговле промышленными и техническими химическими веществами"
                                 },
                                 {
                                    id: "46.12.32",
                                    title: "Деятельность агентов по оптовой торговле удобрениями и агрохимикатами"
                                 }]
                           }]
                     },
                     {
                        id: "46.13",
                        title: "Деятельность агентов по оптовой торговле лесоматериалами и строительными материалами",
                        children: [
                           {
                              id: "46.13.1",
                              title: "Деятельность агентов по оптовой торговле лесоматериалами"
                           },
                           {
                              id: "46.13.2",
                              title: "Деятельность агентов по оптовой торговле строительными материалами"
                           }]
                     },
                     {
                        id: "46.14",
                        title: "Деятельность агентов по оптовой торговле машинами, промышленным оборудованием, судами и летательными аппаратами",
                        children: [
                           {
                              id: "46.14.1",
                              title: "Деятельность агентов по оптовой торговле вычислительной техникой, телекоммуникационным оборудованием и прочим офисным оборудованием"
                           },
                           {
                              id: "46.14.2",
                              title: "Деятельность агентов по оптовой торговле судами, летательными аппаратами и прочими транспортными средствами, не включенными в другие группировки"
                           },
                           {
                              id: "46.14.9",
                              title: "Деятельность агентов по оптовой торговле прочими видами машин и промышленным оборудованием"
                           }]
                     },
                     {
                        id: "46.15",
                        title: "Деятельность агентов по оптовой торговле мебелью, бытовыми товарами, скобяными, ножевыми и прочими металлическими изделиями",
                        children: [
                           {
                              id: "46.15.1",
                              title: "Деятельность агентов по оптовой торговле мебелью"
                           },
                           {
                              id: "46.15.2",
                              title: "Деятельность агентов по оптовой торговле скобяными, ножевыми и прочими бытовыми металлическими изделиями"
                           },
                           {
                              id: "46.15.3",
                              title: "Деятельность агентов по оптовой торговле электротоварами и бытовыми электроустановочными изделиями"
                           },
                           {
                              id: "46.15.4",
                              title: "Деятельность агентов по оптовой торговле радио- и телеаппаратурой, техническими носителями информации"
                           },
                           {
                              id: "46.15.9",
                              title: "Деятельность агентов по оптовой торговле прочими бытовыми товарами, не включенными в другие группировки"
                           }]
                     },
                     {
                        id: "46.16",
                        title: "Деятельность агентов по оптовой торговле текстильными изделиями, одеждой, обувью, изделиями из кожи и меха",
                        children: [
                           {
                              id: "46.16.1",
                              title: "Деятельность агентов по оптовой торговле текстильными изделиями"
                           },
                           {
                              id: "46.16.2",
                              title: "Деятельность агентов по оптовой торговле одеждой, изделиями из меха и обувью"
                           },
                           {
                              id: "46.16.3",
                              title: "Деятельность агентов по оптовой торговле изделиями из кожи и дорожными принадлежностями"
                           }]
                     },
                     {
                        id: "46.17",
                        title: "Деятельность агентов по оптовой торговле пищевыми продуктами, напитками и табачными изделиями",
                        children: [
                           {
                              id: "46.17.1",
                              title: "Деятельность агентов по оптовой торговле пищевыми продуктами"
                           },
                           {
                              id: "46.17.2",
                              title: "Деятельность агентов по оптовой торговле напитками",
                              children: [
                                 {
                                    id: "46.17.21",
                                    title: "Деятельность агентов по оптовой торговле безалкогольными напитками"
                                 },
                                 {
                                    id: "46.17.22",
                                    title: "Деятельность агентов по оптовой торговле алкогольными напитками, кроме пива"
                                 },
                                 {
                                    id: "46.17.23",
                                    title: "Деятельность агентов по оптовой торговле пивом"
                                 }]
                           },
                           {
                              id: "46.17.3",
                              title: "Деятельность агентов по оптовой торговле табачными изделиями"
                           }]
                     },
                     {
                        id: "46.18",
                        title: "Деятельность агентов, специализирующихся на оптовой торговле прочими отдельными видами товаров",
                        children: [
                           {
                              id: "46.18.1",
                              title: "Деятельность агентов, специализирующихся на оптовой торговле фармацевтической продукцией, изделиями, применяемыми в медицинских целях, парфюмерными и косметическими товарами, включая мыло, и чистящими средствами",
                              children: [
                                 {
                                    id: "46.18.11",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле фармацевтической продукцией"
                                 },
                                 {
                                    id: "46.18.12",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле изделиями, применяемыми в медицинских целях"
                                 },
                                 {
                                    id: "46.18.13",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле парфюмерными и косметическими товарами, включая мыло"
                                 },
                                 {
                                    id: "46.18.14",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле чистящими средствами"
                                 }]
                           },
                           {
                              id: "46.18.2",
                              title: "Деятельность агентов, специализирующихся на оптовой торговле играми и игрушками, спортивными товарами, велосипедами, книгами, газетами, журналами, писчебумажными и канцелярскими товарами, музыкальными инструментами, часами и ювелирными изделиями, фототоварами и оптическими товарами"
                           },
                           {
                              id: "46.18.3",
                              title: "Деятельность агентов, специализирующихся на оптовой торговле техникой, оборудованием и инструментами, применяемыми в медицинских целях"
                           },
                           {
                              id: "46.18.9",
                              title: "Деятельность агентов, специализирующихся на оптовой торговле товарами, не включенными в другие группировки",
                              children: [
                                 {
                                    id: "46.18.91",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле бумагой и картоном"
                                 },
                                 {
                                    id: "46.18.92",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле древесным сырьем и необработанными лесоматериалами"
                                 },
                                 {
                                    id: "46.18.93",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле отходами, ломом и материалами для переработки"
                                 },
                                 {
                                    id: "46.18.99",
                                    title: "Деятельность агентов, специализирующихся на оптовой торговле прочими товарами, не включенными в другие группировки"
                                 }]
                           }]
                     },
                     {
                        id: "46.19",
                        title: "Деятельность агентов по оптовой торговле универсальным ассортиментом товаров"
                     }]
               },
               {
                  id: "46.2",
                  title: "Торговля оптовая сельскохозяйственным сырьем и живыми животными",
                  children: [
                     {
                        id: "46.21",
                        title: "Торговля оптовая зерном, необработанным табаком, семенами и кормами для сельскохозяйственных животных",
                        children: [
                           {
                              id: "46.21.1",
                              title: "Торговля оптовая зерном, семенами и кормами для животных",
                              children: [
                                 {
                                    id: "46.21.11",
                                    title: "Торговля оптовая зерном"
                                 },
                                 {
                                    id: "46.21.12",
                                    title: "Торговля оптовая семенами, кроме семян масличных культур"
                                 },
                                 {
                                    id: "46.21.13",
                                    title: "Торговля оптовая масличными семенами и маслосодержащими плодами"
                                 },
                                 {
                                    id: "46.21.14",
                                    title: "Торговля оптовая кормами для сельскохозяйственных животных"
                                 },
                                 {
                                    id: "46.21.19",
                                    title: "Торговля оптовая сельскохозяйственным сырьем, не включенным в другие группировки"
                                 }]
                           },
                           {
                              id: "46.21.2",
                              title: "Торговля оптовая необработанным табаком"
                           }]
                     },
                     {
                        id: "46.22",
                        title: "Торговля оптовая цветами и растениями"
                     },
                     {
                        id: "46.23",
                        title: "Торговля оптовая живыми животными"
                     },
                     {
                        id: "46.24",
                        title: "Торговля оптовая шкурами и кожей"
                     }]
               },
               {
                  id: "46.3",
                  title: "Торговля оптовая пищевыми продуктами, напитками и табачными изделиями",
                  children: [
                     {
                        id: "46.31",
                        title: "Торговля оптовая фруктами и овощами",
                        children: [
                           {
                              id: "46.31.1",
                              title: "Торговля оптовая свежими овощами, фруктами и орехами",
                              children: [
                                 {
                                    id: "46.31.11",
                                    title: "Торговля оптовая свежим картофелем"
                                 },
                                 {
                                    id: "46.31.12",
                                    title: "Торговля оптовая прочими свежими овощами"
                                 },
                                 {
                                    id: "46.31.13",
                                    title: "Торговля оптовая свежими фруктами и орехами"
                                 }]
                           },
                           {
                              id: "46.31.2",
                              title: "Торговля оптовая консервированными овощами, фруктами и орехами"
                           }]
                     },
                     {
                        id: "46.32",
                        title: "Торговля оптовая мясом и мясными продуктами",
                        children: [
                           {
                              id: "46.32.1",
                              title: "Торговля оптовая мясом и мясом птицы, включая субпродукты"
                           },
                           {
                              id: "46.32.2",
                              title: "Торговля оптовая продуктами из мяса и мяса птицы"
                           },
                           {
                              id: "46.32.3",
                              title: "Торговля оптовая консервами из мяса и мяса птицы"
                           }]
                     },
                     {
                        id: "46.33",
                        title: "Торговля оптовая молочными продуктами, яйцами и пищевыми маслами и жирами",
                        children: [
                           {
                              id: "46.33.1",
                              title: "Торговля оптовая молочными продуктами"
                           },
                           {
                              id: "46.33.2",
                              title: "Торговля оптовая яйцами"
                           },
                           {
                              id: "46.33.3",
                              title: "Торговля оптовая пищевыми маслами и жирами"
                           }]
                     },
                     {
                        id: "46.34",
                        title: "Торговля оптовая напитками",
                        children: [
                           {
                              id: "46.34.1",
                              title: "Торговля оптовая соками, минеральной водой и прочими безалкогольными напитками"
                           },
                           {
                              id: "46.34.2",
                              title: "Торговля оптовая алкогольными напитками, включая пиво и пищевой этиловый спирт",
                              children: [
                                 {
                                    id: "46.34.21",
                                    title: "Торговля оптовая алкогольными напитками, кроме пива и пищевого этилового спирта"
                                 },
                                 {
                                    id: "46.34.22",
                                    title: "Торговля оптовая пищевым этиловым спиртом"
                                 },
                                 {
                                    id: "46.34.23",
                                    title: "Торговля оптовая пивом"
                                 }]
                           },
                           {
                              id: "46.34.3",
                              title: "Закупка вина в больших емкостях с последующим розливом в мелкую тару без переработки"
                           }]
                     },
                     {
                        id: "46.35",
                        title: "Торговля оптовая табачными изделиями"
                     },
                     {
                        id: "46.36",
                        title: "Торговля оптовая сахаром, шоколадом и сахаристыми кондитерскими изделиями",
                        children: [
                           {
                              id: "46.36.1",
                              title: "Торговля оптовая сахаром"
                           },
                           {
                              id: "46.36.2",
                              title: "Торговля оптовая шоколадом и сахаристыми кондитерскими изделиями"
                           },
                           {
                              id: "46.36.3",
                              title: "Торговля оптовая мучными кондитерскими изделиями"
                           },
                           {
                              id: "46.36.4",
                              title: "Торговля оптовая хлебобулочными изделиями"
                           }]
                     },
                     {
                        id: "46.37",
                        title: "Торговля оптовая кофе, чаем, какао и пряностями"
                     },
                     {
                        id: "46.38",
                        title: "Торговля оптовая прочими пищевыми продуктами, включая рыбу, ракообразных и моллюсков",
                        children: [
                           {
                              id: "46.38.1",
                              title: "Торговля оптовая рыбой, ракообразными и моллюсками, консервами и пресервами из рыбы и морепродуктов"
                           },
                           {
                              id: "46.38.2",
                              title: "Торговля оптовая прочими пищевыми продуктами",
                              children: [
                                 {
                                    id: "46.38.21",
                                    title: "Торговля оптовая гомогенизированными пищевыми продуктами, детским и диетическим питанием"
                                 },
                                 {
                                    id: "46.38.22",
                                    title: "Торговля оптовая кормами для домашних животных"
                                 },
                                 {
                                    id: "46.38.23",
                                    title: "Торговля оптовая мукой и макаронными изделиями"
                                 },
                                 {
                                    id: "46.38.24",
                                    title: "Торговля оптовая крупами"
                                 },
                                 {
                                    id: "46.38.25",
                                    title: "Торговля оптовая солью"
                                 },
                                 {
                                    id: "46.38.26",
                                    title: "Торговля оптовая мороженым и замороженными десертами"
                                 },
                                 {
                                    id: "46.38.29",
                                    title: "Торговля оптовая прочими пищевыми продуктами, не включенными в другие группировки"
                                 }]
                           }]
                     },
                     {
                        id: "46.39",
                        title: "Торговля оптовая неспециализированная пищевыми продуктами, напитками и табачными изделиями",
                        children: [
                           {
                              id: "46.39.1",
                              title: "Торговля оптовая неспециализированная замороженными пищевыми продуктами"
                           },
                           {
                              id: "46.39.2",
                              title: "Торговля оптовая неспециализированная незамороженными пищевыми продуктами, напитками и табачными изделиями"
                           }]
                     }]
               },
               {
                  id: "46.4",
                  title: "Торговля оптовая непродовольственными потребительскими товарами",
                  children: [
                     {
                        id: "46.41",
                        title: "Торговля оптовая текстильными изделиями",
                        children: [
                           {
                              id: "46.41.1",
                              title: "Торговля оптовая текстильными изделиями, кроме текстильных галантерейных изделий"
                           },
                           {
                              id: "46.41.2",
                              title: "Торговля оптовая галантерейными изделиями"
                           }]
                     },
                     {
                        id: "46.42",
                        title: "Торговля оптовая одеждой и обувью",
                        children: [
                           {
                              id: "46.42.1",
                              title: "Торговля оптовая одеждой",
                              children: [
                                 {
                                    id: "46.42.11",
                                    title: "Торговля оптовая одеждой, включая спортивную, кроме нательного белья"
                                 },
                                 {
                                    id: "46.42.12",
                                    title: "Торговля оптовая нательным бельем"
                                 },
                                 {
                                    id: "46.42.13",
                                    title: "Торговля оптовая изделиями из меха"
                                 },
                                 {
                                    id: "46.42.14",
                                    title: "Торговля оптовая аксессуарами одежды и головными уборами, кроме меховых"
                                 }]
                           },
                           {
                              id: "46.42.2",
                              title: "Торговля оптовая обувью"
                           }]
                     },
                     {
                        id: "46.43",
                        title: "Торговля оптовая бытовыми электротоварами",
                        children: [
                           {
                              id: "46.43.1",
                              title: "Торговля оптовая электрической бытовой техникой"
                           },
                           {
                              id: "46.43.2",
                              title: "Торговля оптовая радио-, теле- и видеоаппаратурой и аппаратурой для цифровых видеодисков (DVD)"
                           },
                           {
                              id: "46.43.3",
                              title: "Торговля оптовая грампластинками, аудио- и видеомагнитными лентами, компакт-дисками (CD) и цифровыми видеодисками (DVD) (кроме носителей без записей)"
                           },
                           {
                              id: "46.43.4",
                              title: "Торговля оптовая фототоварами и оптическими товарами"
                           }]
                     },
                     {
                        id: "46.44",
                        title: "Торговля оптовая изделиями из керамики и стекла и чистящими средствами",
                        children: [
                           {
                              id: "46.44.1",
                              title: "Торговля оптовая изделиями из керамики и стекла"
                           },
                           {
                              id: "46.44.2",
                              title: "Торговля оптовая чистящими средствами"
                           }]
                     },
                     {
                        id: "46.45",
                        title: "Торговля оптовая парфюмерными и косметическими товарами",
                        children: [
                           {
                              id: "46.45.1",
                              title: "Торговля оптовая парфюмерными и косметическими товарами, кроме мыла"
                           },
                           {
                              id: "46.45.2",
                              title: "Торговля оптовая туалетным и хозяйственным мылом"
                           }]
                     },
                     {
                        id: "46.46",
                        title: "Торговля оптовая фармацевтической продукцией",
                        children: [
                           {
                              id: "46.46.1",
                              title: "Торговля оптовая фармацевтической продукцией"
                           },
                           {
                              id: "46.46.2",
                              title: "Торговля оптовая изделиями, применяемыми в медицинских целях"
                           }]
                     },
                     {
                        id: "46.47",
                        title: "Торговля оптовая мебелью, коврами и осветительным оборудованием",
                        children: [
                           {
                              id: "46.47.1",
                              title: "Торговля оптовая бытовой мебелью"
                           },
                           {
                              id: "46.47.2",
                              title: "Торговля оптовая осветительным оборудованием"
                           },
                           {
                              id: "46.47.3",
                              title: "Торговля оптовая коврами и ковровыми изделиями"
                           }]
                     },
                     {
                        id: "46.48",
                        title: "Торговля оптовая часами и ювелирными изделиями",
                        children: [
                           {
                              id: "46.48.1",
                              title: "Торговля оптовая часами"
                           },
                           {
                              id: "46.48.2",
                              title: "Торговля оптовая ювелирными изделиями"
                           }]
                     },
                     {
                        id: "46.49",
                        title: "Торговля оптовая прочими бытовыми товарами",
                        children: [
                           {
                              id: "46.49.1",
                              title: "Торговля оптовая ножевыми изделиями и бытовой металлической посудой"
                           },
                           {
                              id: "46.49.2",
                              title: "Торговля оптовая плетеными изделиями, изделиями из пробки, бондарными изделиями и прочими бытовыми деревянными изделиями"
                           },
                           {
                              id: "46.49.3",
                              title: "Торговля оптовая книгами, газетами и журналами, писчебумажными и канцелярскими товарами",
                              children: [
                                 {
                                    id: "46.49.31",
                                    title: "Торговля оптовая книгами"
                                 },
                                 {
                                    id: "46.49.32",
                                    title: "Торговля оптовая газетами и журналами"
                                 },
                                 {
                                    id: "46.49.33",
                                    title: "Торговля оптовая писчебумажными и канцелярскими товарами"
                                 }]
                           },
                           {
                              id: "46.49.4",
                              title: "Торговля оптовая прочими потребительскими товарами",
                              children: [
                                 {
                                    id: "46.49.41",
                                    title: "Торговля оптовая музыкальными инструментами и нотными изданиями"
                                 },
                                 {
                                    id: "46.49.42",
                                    title: "Торговля оптовая играми и игрушками"
                                 },
                                 {
                                    id: "46.49.43",
                                    title: "Торговля оптовая спортивными товарами, включая велосипеды"
                                 },
                                 {
                                    id: "46.49.44",
                                    title: "Торговля оптовая изделиями из кожи и дорожными аксессуарами"
                                 },
                                 {
                                    id: "46.49.49",
                                    title: "Торговля оптовая прочими потребительскими товарами, не включенными в другие группировки"
                                 }]
                           },
                           {
                              id: "46.49.5",
                              title: "Торговля оптовая неэлектрическими бытовыми приборами"
                           }]
                     }]
               },
               {
                  id: "46.5",
                  title: "Торговля оптовая информационным и коммуникационным оборудованием",
                  children: [
                     {
                        id: "46.51",
                        title: "Торговля оптовая компьютерами, периферийными устройствами к компьютерам и программным обеспечением",
                        children: [
                           {
                              id: "46.51.1",
                              title: "Торговля оптовая компьютерами и периферийными устройствами"
                           },
                           {
                              id: "46.51.2",
                              title: "Торговля оптовая программным обеспечением"
                           }]
                     },
                     {
                        id: "46.52",
                        title: "Торговля оптовая электронным и телекоммуникационным оборудованием и его запасными частями",
                        children: [
                           {
                              id: "46.52.1",
                              title: "Торговля оптовая телекоммуникационным оборудованием и его запасными частями"
                           },
                           {
                              id: "46.52.2",
                              title: "Торговля оптовая электронным оборудованием и его запасными частями"
                           },
                           {
                              id: "46.52.3",
                              title: "Торговля оптовая аудио- и видеомагнитными лентами и дискетами, магнитными и оптическими дисками, компакт-дисками (CD), цифровыми видеодисками (DVD) и прочими техническими носителями информации без записей"
                           }]
                     }]
               },
               {
                  id: "46.6",
                  title: "Торговля оптовая прочими машинами, оборудованием и принадлежностями",
                  children: [
                     {
                        id: "46.61",
                        title: "Торговля оптовая машинами, оборудованием и инструментами для сельского хозяйства",
                        children: [
                           {
                              id: "46.61.1",
                              title: "Торговля оптовая сельскохозяйственными и лесохозяйственными машинами, оборудованием и инструментами, включая тракторы"
                           },
                           {
                              id: "46.61.2",
                              title: "Торговля оптовая садово-огородной техникой и инвентарем"
                           }]
                     },
                     {
                        id: "46.62",
                        title: "Торговля оптовая станками",
                        children: [
                           {
                              id: "46.62.1",
                              title: "Торговля оптовая деревообрабатывающими станками"
                           },
                           {
                              id: "46.62.2",
                              title: "Торговля оптовая металлообрабатывающими станками"
                           },
                           {
                              id: "46.62.3",
                              title: "Торговля оптовая станками для обработки прочих материалов"
                           }]
                     },
                     {
                        id: "46.63",
                        title: "Торговля оптовая машинами и оборудованием для добычи полезных ископаемых и строительства"
                     },
                     {
                        id: "46.64",
                        title: "Торговля оптовая машинами и оборудованием для текстильного, швейного и трикотажного производств"
                     },
                     {
                        id: "46.65",
                        title: "Торговля оптовая офисной мебелью"
                     },
                     {
                        id: "46.66",
                        title: "Торговля оптовая прочей офисной техникой и оборудованием"
                     },
                     {
                        id: "46.69",
                        title: "Торговля оптовая прочими машинами и оборудованием",
                        children: [
                           {
                              id: "46.69.1",
                              title: "Торговля оптовая транспортными средствами, кроме автомобилей, мотоциклов и велосипедов"
                           },
                           {
                              id: "46.69.2",
                              title: "Торговля оптовая эксплуатационными материалами и принадлежностями машин"
                           },
                           {
                              id: "46.69.3",
                              title: "Торговля оптовая подъемно-транспортными машинами и оборудованием"
                           },
                           {
                              id: "46.69.4",
                              title: "Торговля оптовая машинами и оборудованием для производства пищевых продуктов, напитков и табачных изделий"
                           },
                           {
                              id: "46.69.5",
                              title: "Торговля оптовая производственным электротехническим оборудованием, машинами, аппаратурой и материалами"
                           },
                           {
                              id: "46.69.6",
                              title: "Торговля оптовая оружием и боеприпасами"
                           },
                           {
                              id: "46.69.7",
                              title: "Торговля оптовая измерительными приборами и оборудованием"
                           },
                           {
                              id: "46.69.8",
                              title: "Торговля оптовая техникой, оборудованием и инструментами, применяемыми в медицинских целях"
                           },
                           {
                              id: "46.69.9",
                              title: "Торговля оптовая прочими машинами, приборами, аппаратурой и оборудованием общепромышленного и специального назначения"
                           }]
                     }]
               },
               {
                  id: "46.7",
                  title: "Торговля оптовая специализированная прочая",
                  children: [
                     {
                        id: "46.71",
                        title: "Торговля оптовая твердым, жидким и газообразным топливом и подобными продуктами",
                        children: [
                           {
                              id: "46.71.1",
                              title: "Торговля оптовая твердым топливом"
                           },
                           {
                              id: "46.71.2",
                              title: "Торговля оптовая моторным топливом, включая авиационный бензин"
                           },
                           {
                              id: "46.71.3",
                              title: "Торговля оптовая сырой нефтью"
                           },
                           {
                              id: "46.71.4",
                              title: "Торговля оптовая природным (естественным) газом"
                           },
                           {
                              id: "46.71.5",
                              title: "Торговля оптовая сжиженными углеводородными газами",
                              children: [
                                 {
                                    id: "46.71.51",
                                    title: "Торговля оптовая сжиженными углеводородными газами по регулируемым государством ценам (тарифам)"
                                 },
                                 {
                                    id: "46.71.52",
                                    title: "Торговля оптовая сжиженными углеводородными газами по не регулируемым государством ценам (тарифам)"
                                 }]
                           },
                           {
                              id: "46.71.9",
                              title: "Торговля оптовая прочим топливом и подобными продуктами"
                           }]
                     },
                     {
                        id: "46.72",
                        title: "Торговля оптовая металлами и металлическими рудами",
                        children: [
                           {
                              id: "46.72.1",
                              title: "Торговля оптовая металлическими рудами",
                              children: [
                                 {
                                    id: "46.72.11",
                                    title: "Торговля оптовая железными рудами"
                                 },
                                 {
                                    id: "46.72.12",
                                    title: "Торговля оптовая рудами цветных металлов"
                                 }]
                           },
                           {
                              id: "46.72.2",
                              title: "Торговля оптовая металлами в первичных формах",
                              children: [
                                 {
                                    id: "46.72.21",
                                    title: "Торговля оптовая черными металлами в первичных формах"
                                 },
                                 {
                                    id: "46.72.22",
                                    title: "Торговля оптовая цветными металлами в первичных формах, кроме драгоценных"
                                 },
                                 {
                                    id: "46.72.23",
                                    title: "Торговля оптовая золотом и другими драгоценными металлами"
                                 }]
                           }]
                     },
                     {
                        id: "46.73",
                        title: "Торговля оптовая лесоматериалами, строительными материалами и санитарно-техническим оборудованием",
                        children: [
                           {
                              id: "46.73.1",
                              title: "Торговля оптовая древесным сырьем и необработанными лесоматериалами"
                           },
                           {
                              id: "46.73.2",
                              title: "Торговля оптовая пиломатериалами"
                           },
                           {
                              id: "46.73.3",
                              title: "Торговля оптовая санитарно-техническим оборудованием"
                           },
                           {
                              id: "46.73.4",
                              title: "Торговля оптовая лакокрасочными материалами"
                           },
                           {
                              id: "46.73.5",
                              title: "Торговля оптовая листовым стеклом"
                           },
                           {
                              id: "46.73.6",
                              title: "Торговля оптовая прочими строительными материалами и изделиями"
                           },
                           {
                              id: "46.73.7",
                              title: "Торговля оптовая обоями"
                           },
                           {
                              id: "46.73.8",
                              title: "Торговля оптовая напольными покрытиями (кроме ковров)"
                           }]
                     },
                     {
                        id: "46.74",
                        title: "Торговля оптовая скобяными изделиями, водопроводным и отопительным оборудованием и принадлежностями",
                        children: [
                           {
                              id: "46.74.1",
                              title: "Торговля оптовая скобяными изделиями"
                           },
                           {
                              id: "46.74.2",
                              title: "Торговля оптовая водопроводным и отопительным оборудованием и санитарно-технической арматурой"
                           },
                           {
                              id: "46.74.3",
                              title: "Торговля оптовая ручными инструментами"
                           }]
                     },
                     {
                        id: "46.75",
                        title: "Торговля оптовая химическими продуктами",
                        children: [
                           {
                              id: "46.75.1",
                              title: "Торговля оптовая удобрениями и агрохимическими продуктами"
                           },
                           {
                              id: "46.75.2",
                              title: "Торговля оптовая промышленными химикатами"
                           }]
                     },
                     {
                        id: "46.76",
                        title: "Торговля оптовая прочими промежуточными продуктами",
                        children: [
                           {
                              id: "46.76.1",
                              title: "Торговля оптовая бумагой и картоном"
                           },
                           {
                              id: "46.76.2",
                              title: "Торговля оптовая текстильными волокнами"
                           },
                           {
                              id: "46.76.3",
                              title: "Торговля оптовая пластмассами и резиной в первичных формах"
                           },
                           {
                              id: "46.76.4",
                              title: "Торговля оптовая драгоценными камнями"
                           }]
                     },
                     {
                        id: "46.77",
                        title: "Торговля оптовая отходами и ломом"
                     }]
               },
               {
                  id: "46.9",
                  title: "Торговля оптовая неспециализированная",
                  children: [
                     {
                        id: "46.90",
                        title: "Торговля оптовая неспециализированная"
                     }]
               }]
         },
         {
            id: "47",
            title: "Торговля розничная, кроме торговли автотранспортными средствами и мотоциклами",
            children: [
               {
                  id: "47.1",
                  title: "Торговля розничная в неспециализированных магазинах",
                  children: [
                     {
                        id: "47.11",
                        title: "Торговля розничная преимущественно пищевыми продуктами, включая напитки, и табачными изделиями в неспециализированных магазинах",
                        children: [
                           {
                              id: "47.11.1",
                              title: "Торговля розничная замороженными продуктами в неспециализированных магазинах"
                           },
                           {
                              id: "47.11.2",
                              title: "Торговля розничная незамороженными продуктами, включая напитки и табачные изделия, в неспециализированных магазинах"
                           },
                           {
                              id: "47.11.3",
                              title: "Деятельность по розничной торговле большим товарным ассортиментом с преобладанием продовольственных товаров в неспециализированных магазинах"
                           }]
                     },
                     {
                        id: "47.19",
                        title: "Торговля розничная прочая в неспециализированных магазинах",
                        children: [
                           {
                              id: "47.19.1",
                              title: "Торговля розничная большим товарным ассортиментом с преобладанием непродовольственных товаров в неспециализированных магазинах"
                           },
                           {
                              id: "47.19.2",
                              title: "Деятельность универсальных магазинов, торгующих товарами общего ассортимента"
                           }]
                     }]
               },
               {
                  id: "47.2",
                  title: "Торговля розничная пищевыми продуктами, напитками и табачными изделиями в специализированных магазинах",
                  children: [
                     {
                        id: "47.21",
                        title: "Торговля розничная фруктами и овощами в специализированных магазинах",
                        children: [
                           {
                              id: "47.21.1",
                              title: "Торговля розничная свежими фруктами, овощами, картофелем и орехами в специализированных магазинах"
                           },
                           {
                              id: "47.21.2",
                              title: "Торговля розничная консервированными фруктами и овощами и орехами в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.22",
                        title: "Торговля розничная мясом и мясными продуктами в специализированных магазинах",
                        children: [
                           {
                              id: "47.22.1",
                              title: "Торговля розничная мясом и мясом птицы, включая субпродукты в специализированных магазинах"
                           },
                           {
                              id: "47.22.2",
                              title: "Торговля розничная продуктами из мяса и мяса птицы в специализированных магазинах"
                           },
                           {
                              id: "47.22.3",
                              title: "Торговля розничная консервами из мяса и мяса птицы в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.23",
                        title: "Торговля розничная рыбой, ракообразными и моллюсками в специализированных магазинах",
                        children: [
                           {
                              id: "47.23.1",
                              title: "Торговля розничная рыбой и морепродуктами в специализированных магазинах"
                           },
                           {
                              id: "47.23.2",
                              title: "Торговля розничная консервами из рыбы и морепродуктов в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.24",
                        title: "Торговля розничная хлебом и хлебобулочными изделиями и кондитерскими изделиями в специализированных магазинах",
                        children: [
                           {
                              id: "47.24.1",
                              title: "Торговля розничная хлебом и хлебобулочными изделиями в специализированных магазинах"
                           },
                           {
                              id: "47.24.2",
                              title: "Торговля розничная кондитерскими изделиями в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.24.21",
                                    title: "Торговля розничная мучными кондитерскими изделиями в специализированных магазинах"
                                 },
                                 {
                                    id: "47.24.22",
                                    title: "Торговля розничная кондитерскими изделиями, включая шоколад, в специализированных магазинах"
                                 }]
                           },
                           {
                              id: "47.24.3",
                              title: "Торговля розничная мороженым и замороженными десертами в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.25",
                        title: "Торговля розничная напитками в специализированных магазинах",
                        children: [
                           {
                              id: "47.25.1",
                              title: "Торговля розничная алкогольными напитками, включая пиво, в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.25.11",
                                    title: "Торговля розничная алкогольными напитками, кроме пива, в специализированных магазинах"
                                 },
                                 {
                                    id: "47.25.12",
                                    title: "Торговля розничная пивом в специализированных магазинах"
                                 }]
                           },
                           {
                              id: "47.25.2",
                              title: "Торговля розничная безалкогольными напитками в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.26",
                        title: "Торговля розничная табачными изделиями в специализированных магазинах"
                     },
                     {
                        id: "47.29",
                        title: "Торговля розничная прочими пищевыми продуктами в специализированных магазинах",
                        children: [
                           {
                              id: "47.29.1",
                              title: "Торговля розничная молочными продуктами и яйцами в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.29.11",
                                    title: "Торговля розничная молочными продуктами в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.12",
                                    title: "Торговля розничная яйцами в специализированных магазинах"
                                 }]
                           },
                           {
                              id: "47.29.2",
                              title: "Торговля розничная пищевыми маслами и жирами в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.29.21",
                                    title: "Торговля розничная животными маслами и жирами в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.22",
                                    title: "Торговля розничная растительными маслами в специализированных магазинах"
                                 }]
                           },
                           {
                              id: "47.29.3",
                              title: "Торговля розничная прочими пищевыми продуктами в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.29.31",
                                    title: "Торговля розничная мукой и макаронными изделиями в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.32",
                                    title: "Торговля розничная крупами в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.33",
                                    title: "Торговля розничная сахаром в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.34",
                                    title: "Торговля розничная солью в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.35",
                                    title: "Торговля розничная чаем, кофе, какао в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.36",
                                    title: "Торговля розничная гомогенизированными пищевыми продуктами, детским и диетическим питанием в специализированных магазинах"
                                 },
                                 {
                                    id: "47.29.39",
                                    title: "Торговля розничная прочими пищевыми продуктами в специализированных магазинах, не включенными в другие группировки"
                                 }]
                           }]
                     }]
               },
               {
                  id: "47.3",
                  title: "Торговля розничная моторным топливом в специализированных магазинах",
                  children: [
                     {
                        id: "47.30",
                        title: "Торговля розничная моторным топливом в специализированных магазинах",
                        children: [
                           {
                              id: "47.30.1",
                              title: "Торговля розничная моторным топливом в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.30.11",
                                    title: "Торговля розничная бензином и дизельным топливом в специализированных магазинах"
                                 },
                                 {
                                    id: "47.30.12",
                                    title: "Торговля розничная газом для заправки автомобилей в специализированных магазинах"
                                 }]
                           },
                           {
                              id: "47.30.2",
                              title: "Торговля розничная смазочными материалами и охлаждающими жидкостями для автотранспортных средств"
                           }]
                     }]
               },
               {
                  id: "47.4",
                  title: "Торговля розничная информационным и коммуникационным оборудованием в специализированных магазинах",
                  children: [
                     {
                        id: "47.41",
                        title: "Торговля розничная компьютерами, периферийными устройствами к ним и программным обеспечением в специализированных магазинах",
                        children: [
                           {
                              id: "47.41.1",
                              title: "Торговля розничная компьютерами в специализированных магазинах"
                           },
                           {
                              id: "47.41.2",
                              title: "Торговля розничная программным обеспечением в специализированных магазинах"
                           },
                           {
                              id: "47.41.3",
                              title: "Торговля розничная периферийными устройствами в специализированных магазинах"
                           },
                           {
                              id: "47.41.4",
                              title: "Торговля розничная офисными машинами и оборудованием в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.42",
                        title: "Торговля розничная телекоммуникационным оборудованием, включая розничную торговлю мобильными телефонами, в специализированных магазинах"
                     },
                     {
                        id: "47.43",
                        title: "Торговля розничная аудио- и видеотехникой в специализированных магазинах"
                     }]
               },
               {
                  id: "47.5",
                  title: "Торговля розничная прочими бытовыми изделиями в специализированных магазинах",
                  children: [
                     {
                        id: "47.51",
                        title: "Торговля розничная текстильными изделиями в специализированных магазинах",
                        children: [
                           {
                              id: "47.51.1",
                              title: "Торговля розничная текстильными изделиями в специализированных магазинах"
                           },
                           {
                              id: "47.51.2",
                              title: "Торговля розничная галантерейными изделиями в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.52",
                        title: "Торговля розничная скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах",
                        children: [
                           {
                              id: "47.52.1",
                              title: "Торговля розничная скобяными изделиями в специализированных магазинах"
                           },
                           {
                              id: "47.52.2",
                              title: "Торговля розничная лакокрасочными материалами в специализированных магазинах"
                           },
                           {
                              id: "47.52.3",
                              title: "Торговля розничная стеклом в специализированных магазинах"
                           },
                           {
                              id: "47.52.4",
                              title: "Торговля розничная материалами и оборудованием для изготовления поделок в специализированных магазинах"
                           },
                           {
                              id: "47.52.5",
                              title: "Торговля розничная санитарно-техническим оборудованием в специализированных магазинах"
                           },
                           {
                              id: "47.52.6",
                              title: "Торговля розничная садово-огородной техникой и инвентарем в специализированных магазинах"
                           },
                           {
                              id: "47.52.7",
                              title: "Торговля розничная строительными материалами, не включенными в другие группировки, в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.52.71",
                                    title: "Торговля розничная пиломатериалами в специализированных магазинах"
                                 },
                                 {
                                    id: "47.52.72",
                                    title: "Торговля розничная кирпичом в специализированных магазинах"
                                 },
                                 {
                                    id: "47.52.73",
                                    title: "Торговля розничная металлическими и неметаллическими конструкциями в специализированных магазинах"
                                 },
                                 {
                                    id: "47.52.74",
                                    title: "Торговля розничная сборными деревянными строениями в специализированных магазинах"
                                 },
                                 {
                                    id: "47.52.79",
                                    title: "Торговля розничная прочими строительными материалами, не включенными в другие группировки, в специализированных магазинах"
                                 }]
                           }]
                     },
                     {
                        id: "47.53",
                        title: "Торговля розничная коврами, ковровыми изделиями, покрытиями для пола и стен в специализированных магазинах",
                        children: [
                           {
                              id: "47.53.1",
                              title: "Торговля розничная коврами и ковровыми изделиями в специализированных магазинах"
                           },
                           {
                              id: "47.53.2",
                              title: "Торговля розничная портьерами, тюлевыми занавесями в специализированных магазинах"
                           },
                           {
                              id: "47.53.3",
                              title: "Торговля розничная обоями и напольными покрытиями в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.54",
                        title: "Торговля розничная бытовыми электротоварами в специализированных магазинах"
                     },
                     {
                        id: "47.59",
                        title: "Торговля розничная мебелью, осветительными приборами и прочими бытовыми изделиями в специализированных магазинах",
                        children: [
                           {
                              id: "47.59.1",
                              title: "Торговля розничная мебелью в специализированных магазинах"
                           },
                           {
                              id: "47.59.2",
                              title: "Торговля розничная различной домашней утварью, ножевыми изделиями, посудой, изделиями из стекла и керамики, в том числе фарфора и фаянса в специализированных магазинах"
                           },
                           {
                              id: "47.59.3",
                              title: "Торговля розничная осветительными приборами в специализированных магазинах"
                           },
                           {
                              id: "47.59.4",
                              title: "Торговля розничная изделиями из дерева, пробки и плетеными изделиями в специализированных магазинах"
                           },
                           {
                              id: "47.59.5",
                              title: "Торговля розничная музыкальными инструментами и нотными изданиями в специализированных магазинах"
                           },
                           {
                              id: "47.59.6",
                              title: "Торговля розничная неэлектрическими бытовыми приборами в специализированных магазинах"
                           },
                           {
                              id: "47.59.7",
                              title: "Торговля розничная электрическими системами охранной сигнализации, такими как запорные устройства, сейфы и хранилища"
                           },
                           {
                              id: "47.59.9",
                              title: "Торговля розничная бытовыми изделиями и приборами, не включенными в другие группировки, в специализированных магазинах"
                           }]
                     }]
               },
               {
                  id: "47.6",
                  title: "Торговля розничная товарами культурно-развлекательного назначения в специализированных магазинах",
                  children: [
                     {
                        id: "47.61",
                        title: "Торговля розничная книгами в специализированных магазинах"
                     },
                     {
                        id: "47.62",
                        title: "Торговля розничная газетами и канцелярскими товарами в специализированных магазинах",
                        children: [
                           {
                              id: "47.62.1",
                              title: "Торговля розничная газетами и журналами в специализированных магазинах"
                           },
                           {
                              id: "47.62.2",
                              title: "Торговля розничная писчебумажными и канцелярскими товарами в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.63",
                        title: "Торговля розничная музыкальными и видеозаписями в специализированных магазинах",
                        children: [
                           {
                              id: "47.63.1",
                              title: "Торговля розничная музыкальными записями, аудиолентами, компакт-дисками и кассетами в специализированных магазинах"
                           },
                           {
                              id: "47.63.2",
                              title: "Торговля розничная лентами и дисками без записей в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.64",
                        title: "Торговля розничная спортивным оборудованием и спортивными товарами в специализированных магазинах",
                        children: [
                           {
                              id: "47.64.1",
                              title: "Торговля розничная спортивным оборудованием и спортивными товарами в специализированных магазинах"
                           },
                           {
                              id: "47.64.2",
                              title: "Торговля розничная рыболовными принадлежностями в специализированных магазинах"
                           },
                           {
                              id: "47.64.3",
                              title: "Торговля розничная туристическим снаряжением в специализированных магазинах"
                           },
                           {
                              id: "47.64.4",
                              title: "Торговля розничная лодками в специализированных магазинах"
                           },
                           {
                              id: "47.64.5",
                              title: "Торговля розничная велосипедами в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.65",
                        title: "Торговля розничная играми и игрушками в специализированных магазинах"
                     }]
               },
               {
                  id: "47.7",
                  title: "Торговля розничная прочими товарами в специализированных магазинах",
                  children: [
                     {
                        id: "47.71",
                        title: "Торговля розничная одеждой в специализированных магазинах",
                        children: [
                           {
                              id: "47.71.1",
                              title: "Торговля розничная мужской, женской и детской одеждой в специализированных магазинах"
                           },
                           {
                              id: "47.71.2",
                              title: "Торговля розничная нательным бельем в специализированных магазинах"
                           },
                           {
                              id: "47.71.3",
                              title: "Торговля розничная изделиями из меха в специализированных магазинах"
                           },
                           {
                              id: "47.71.4",
                              title: "Торговля розничная одеждой из кожи в специализированных магазинах"
                           },
                           {
                              id: "47.71.5",
                              title: "Торговля розничная спортивной одеждой в специализированных магазинах"
                           },
                           {
                              id: "47.71.6",
                              title: "Торговля розничная чулочно-носочными изделиями в специализированных магазинах"
                           },
                           {
                              id: "47.71.7",
                              title: "Торговля розничная головными уборами в специализированных магазинах"
                           },
                           {
                              id: "47.71.8",
                              title: "Торговля розничная аксессуарами одежды (перчатками, галстуками, шарфами, ремнями, подтяжками и т.п.) в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.72",
                        title: "Торговля розничная обувью и изделиями из кожи в специализированных магазинах",
                        children: [
                           {
                              id: "47.72.1",
                              title: "Торговля розничная обувью в специализированных магазинах"
                           },
                           {
                              id: "47.72.2",
                              title: "Торговля розничная изделиями из кожи и дорожными принадлежностями в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.73",
                        title: "Торговля розничная лекарственными средствами в специализированных магазинах (аптеках)"
                     },
                     {
                        id: "47.74",
                        title: "Торговля розничная изделиями, применяемыми в медицинских целях, ортопедическими изделиями в специализированных магазинах",
                        children: [
                           {
                              id: "47.74.1",
                              title: "Торговля розничная изделиями, применяемыми в медицинских целях, в специализированных магазинах"
                           },
                           {
                              id: "47.74.2",
                              title: "Торговля розничная ортопедическими изделиями в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.75",
                        title: "Торговля розничная косметическими и товарами личной гигиены в специализированных магазинах",
                        children: [
                           {
                              id: "47.75.1",
                              title: "Торговля розничная косметическими и парфюмерными товарами, кроме мыла в специализированных магазинах"
                           },
                           {
                              id: "47.75.2",
                              title: "Торговля розничная туалетным и хозяйственным мылом в специализированных магазинах"
                           },
                           {
                              id: "47.75.3",
                              title: "Торговля розничная предметами личной гигиены в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.76",
                        title: "Торговля розничная цветами и другими растениями, семенами, удобрениями, домашними животными и кормами для домашних животных в специализированных магазинах",
                        children: [
                           {
                              id: "47.76.1",
                              title: "Торговля розничная цветами и другими растениями, семенами и удобрениями в специализированных магазинах"
                           },
                           {
                              id: "47.76.2",
                              title: "Торговля розничная домашними животными и кормами для домашних животных в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.77",
                        title: "Торговля розничная часами и ювелирными изделиями в специализированных магазинах",
                        children: [
                           {
                              id: "47.77.1",
                              title: "Торговля розничная часами в специализированных магазинах"
                           },
                           {
                              id: "47.77.2",
                              title: "Торговля розничная ювелирными изделиями в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.78",
                        title: "Торговля розничная прочая в специализированных магазинах",
                        children: [
                           {
                              id: "47.78.1",
                              title: "Торговля розничная фотоаппаратурой, оптическими приборами и средствами измерений, кроме очков, в специализированных магазинах"
                           },
                           {
                              id: "47.78.2",
                              title: "Торговля розничная очками, включая сборку и ремонт очков в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.78.21",
                                    title: "Торговля розничная очками в специализированных магазинах"
                                 },
                                 {
                                    id: "47.78.22",
                                    title: "Сборка и ремонт очков в специализированных магазинах"
                                 }]
                           },
                           {
                              id: "47.78.3",
                              title: "Торговля розничная сувенирами, изделиями народных художественных промыслов"
                           },
                           {
                              id: "47.78.4",
                              title: "Торговля розничная предметами культового и религиозного назначения, похоронными принадлежностями в специализированных магазинах"
                           },
                           {
                              id: "47.78.5",
                              title: "Деятельность коммерческих художественных галерей, торговля розничная произведениями искусства в коммерческих художественных галереях"
                           },
                           {
                              id: "47.78.6",
                              title: "Торговля розничная бытовым жидким котельным топливом, газом в баллонах, углем, древесным топливом, топливным торфом в специализированных магазинах",
                              children: [
                                 {
                                    id: "47.78.61",
                                    title: "Торговля розничная бытовым жидким котельным топливом, углем, древесным топливом, топливным торфом в специализированных магазинах"
                                 },
                                 {
                                    id: "47.78.62",
                                    title: "Торговля розничная газом в баллонах в специализированных магазинах по регулируемым государствам ценам (тарифам)"
                                 },
                                 {
                                    id: "47.78.63",
                                    title: "Торговля розничная газом в баллонах в специализированных магазинах по нерегулируемым государством ценам (тарифам)"
                                 }]
                           },
                           {
                              id: "47.78.7",
                              title: "Торговля розничная оружием и боеприпасами в специализированных магазинах"
                           },
                           {
                              id: "47.78.8",
                              title: "Торговля розничная филателистическими и нумизматическими товарами в специализированных магазинах"
                           },
                           {
                              id: "47.78.9",
                              title: "Торговля розничная непродовольственными товарами, не включенными в другие группировки, в специализированных магазинах"
                           }]
                     },
                     {
                        id: "47.79",
                        title: "Торговля розничная бывшими в употреблении товарами в магазинах",
                        children: [
                           {
                              id: "47.79.1",
                              title: "Торговля розничная предметами антиквариата"
                           },
                           {
                              id: "47.79.2",
                              title: "Торговля розничная букинистическими книгами"
                           },
                           {
                              id: "47.79.3",
                              title: "Торговля розничная прочими бывшими в употреблении товарами"
                           },
                           {
                              id: "47.79.4",
                              title: "Деятельность аукционных домов по розничной торговле"
                           }]
                     }]
               },
               {
                  id: "47.8",
                  title: "Торговля розничная в нестационарных торговых объектах и на рынках",
                  children: [
                     {
                        id: "47.81",
                        title: "Торговля розничная в нестационарных торговых объектах и на рынках пищевыми продуктами, напитками и табачной продукцией",
                        children: [
                           {
                              id: "47.81.1",
                              title: "Торговля розничная в нестационарных торговых объектах напитками и табачной продукцией"
                           },
                           {
                              id: "47.81.2",
                              title: "Торговля розничная на рынках пищевыми продуктами, напитками и табачной продукцией"
                           }]
                     },
                     {
                        id: "47.82",
                        title: "Торговля розничная в нестационарных торговых объектах и на рынках текстилем, одеждой и обувью",
                        children: [
                           {
                              id: "47.82.1",
                              title: "Торговля розничная в нестационарных торговых объектах текстилем, одеждой и обувью"
                           },
                           {
                              id: "47.82.2",
                              title: "Торговля розничная на рынках текстилем, одеждой и обувью"
                           }]
                     },
                     {
                        id: "47.89",
                        title: "Торговля розничная в нестационарных торговых объектах и на рынках прочими товарами",
                        children: [
                           {
                              id: "47.89.1",
                              title: "Торговля розничная в нестационарных торговых объектах прочими товарами"
                           },
                           {
                              id: "47.89.2",
                              title: "Торговля розничная на рынках прочими товарами"
                           }]
                     }]
               },
               {
                  id: "47.9",
                  title: "Торговля розничная вне магазинов, палаток, рынков",
                  children: [
                     {
                        id: "47.91",
                        title: "Торговля розничная по почте или по информационно-коммуникационной сети Интернет",
                        children: [
                           {
                              id: "47.91.1",
                              title: "Торговля розничная по почте"
                           },
                           {
                              id: "47.91.2",
                              title: "Торговля розничная, осуществляемая непосредственно при помощи информационно-коммуникационной сети Интернет"
                           },
                           {
                              id: "47.91.3",
                              title: "Торговля розничная через Интернет-аукционы"
                           },
                           {
                              id: "47.91.4",
                              title: "Торговля розничная, осуществляемая непосредственно при помощи телевидения, радио, телефона"
                           }]
                     },
                     {
                        id: "47.99",
                        title: "Торговля розничная прочая вне магазинов, палаток, рынков",
                        children: [
                           {
                              id: "47.99.1",
                              title: "Деятельность по осуществлению прямых продаж или продаж торговыми агентами с доставкой"
                           },
                           {
                              id: "47.99.2",
                              title: "Деятельность по осуществлению торговли через автоматы"
                           },
                           {
                              id: "47.99.3",
                              title: "Деятельность по осуществлению прямых продаж топлива с доставкой по адресу клиента"
                           },
                           {
                              id: "47.99.4",
                              title: "Деятельность аукционов по розничной торговле вне магазинов, за исключением продаж через Интернет-аукционы"
                           },
                           {
                              id: "47.99.5",
                              title: "Деятельность по осуществлению розничных продаж комиссионными агентами вне магазинов"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел H",
      title: "Транспортировка и хранение",
      children: [
         {
            id: "49",
            title: "Деятельность сухопутного и трубопроводного транспорта",
            children: [
               {
                  id: "49.1",
                  title: "Деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки",
                  children: [
                     {
                        id: "49.10",
                        title: "Деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки",
                        children: [
                           {
                              id: "49.10.1",
                              title: "Перевозка пассажиров железнодорожным транспортом в междугородном сообщении",
                              children: [
                                 {
                                    id: "49.10.11",
                                    title: "Перевозка пассажиров железнодорожным транспортом в междугородном сообщении в регулируемом секторе"
                                 },
                                 {
                                    id: "49.10.12",
                                    title: "Перевозка пассажиров железнодорожным транспортом в междугородном сообщении в нерегулируемом секторе"
                                 }]
                           },
                           {
                              id: "49.10.2",
                              title: "Перевозка пассажиров железнодорожным транспортом в международном сообщении"
                           }]
                     }]
               },
               {
                  id: "49.2",
                  title: "Деятельность железнодорожного транспорта: грузовые перевозки",
                  children: [
                     {
                        id: "49.20",
                        title: "Деятельность железнодорожного транспорта: грузовые перевозки",
                        children: [
                           {
                              id: "49.20.1",
                              title: "Перевозка опасных грузов"
                           },
                           {
                              id: "49.20.9",
                              title: "Перевозка прочих грузов"
                           }]
                     }]
               },
               {
                  id: "49.3",
                  title: "Деятельность прочего сухопутного пассажирского транспорта",
                  children: [
                     {
                        id: "49.31",
                        title: "Деятельность сухопутного пассажирского транспорта: перевозки пассажиров в городском и пригородном сообщении",
                        children: [
                           {
                              id: "49.31.1",
                              title: "Перевозка пассажиров железнодорожным транспортом в пригородном сообщении",
                              children: [
                                 {
                                    id: "49.31.11",
                                    title: "Перевозка пассажиров железнодорожным транспортом в пригородном сообщении в регулируемом секторе"
                                 },
                                 {
                                    id: "49.31.12",
                                    title: "Перевозка пассажиров железнодорожным транспортом в пригородном сообщении в нерегулируемом секторе"
                                 }]
                           },
                           {
                              id: "49.31.2",
                              title: "Регулярные перевозки пассажиров прочим сухопутным транспортом в городском и пригородном сообщении",
                              children: [
                                 {
                                    id: "49.31.21",
                                    title: "Регулярные перевозки пассажиров автобусами в городском и пригородном сообщении"
                                 },
                                 {
                                    id: "49.31.22",
                                    title: "Регулярные перевозки пассажиров троллейбусами в городском и пригородном сообщении"
                                 },
                                 {
                                    id: "49.31.23",
                                    title: "Регулярные перевозки пассажиров трамваями в городском и пригородном сообщении"
                                 },
                                 {
                                    id: "49.31.24",
                                    title: "Перевозка пассажиров метрополитеном"
                                 },
                                 {
                                    id: "49.31.25",
                                    title: "Перевозка пассажиров фуникулерами, подвесными канатными дорогами и подъемниками, являющимися частью городской или пригородной транспортной системы"
                                 }]
                           }]
                     },
                     {
                        id: "49.32",
                        title: "Деятельность легкового такси и арендованных легковых автомобилей с водителем"
                     },
                     {
                        id: "49.39",
                        title: "Деятельность прочего сухопутного пассажирского транспорта, не включенная в другие группировки",
                        children: [
                           {
                              id: "49.39.1",
                              title: "Регулярные перевозки пассажиров сухопутным транспортом, кроме железнодорожного транспорта, в междугородном и международном сообщении, а также специальные перевозки (для собственных нужд)",
                              children: [
                                 {
                                    id: "49.39.11",
                                    title: "Регулярные перевозки пассажиров автобусами в междугородном сообщении"
                                 },
                                 {
                                    id: "49.39.12",
                                    title: "Регулярные перевозки пассажиров автобусами в международном сообщении"
                                 },
                                 {
                                    id: "49.39.13",
                                    title: "Специальные перевозки (для собственных нужд) автобусами"
                                 }]
                           },
                           {
                              id: "49.39.2",
                              title: "Перевозка пассажиров фуникулерами, подвесными канатными дорогами и лыжными подъемниками, не являющимися частью внутригородской, пригородной или городской и пригородной транспортных систем"
                           },
                           {
                              id: "49.39.3",
                              title: "Перевозки пассажиров сухопутным транспортом по заказам",
                              children: [
                                 {
                                    id: "49.39.31",
                                    title: "Перевозки пассажиров арендованными автобусами с водителем"
                                 },
                                 {
                                    id: "49.39.32",
                                    title: "Перевозка пассажиров автобусами по туристическим или экскурсионным маршрутам"
                                 },
                                 {
                                    id: "49.39.33",
                                    title: "Перевозка пассажиров автобусами в городском и пригородном сообщении по заказам, за исключением перевозки арендованными автобусами с водителем и по туристическим или экскурсионным маршрутам"
                                 },
                                 {
                                    id: "49.39.34",
                                    title: "Перевозка пассажиров автобусами в междугородном и международном сообщении по заказам, за исключением перевозки арендованными автобусами с водителем и по туристическим или экскурсионным маршрутам"
                                 },
                                 {
                                    id: "49.39.35",
                                    title: "Перевозка пассажиров транспортными средствами, приводимыми в движение человеком или животными"
                                 },
                                 {
                                    id: "49.39.39",
                                    title: "Перевозки пассажиров сухопутным транспортом прочие, не включенные в другие группировки"
                                 }]
                           }]
                     }]
               },
               {
                  id: "49.4",
                  title: "Деятельность автомобильного грузового транспорта и услуги по перевозкам",
                  children: [
                     {
                        id: "49.41",
                        title: "Деятельность автомобильного грузового транспорта",
                        children: [
                           {
                              id: "49.41.1",
                              title: "Перевозка грузов специализированными автотранспортными средствами"
                           },
                           {
                              id: "49.41.2",
                              title: "Перевозка грузов неспециализированными автотранспортными средствами"
                           },
                           {
                              id: "49.41.3",
                              title: "Аренда грузового автомобильного транспорта с водителем"
                           }]
                     },
                     {
                        id: "49.42",
                        title: "Предоставление услуг по перевозкам"
                     }]
               },
               {
                  id: "49.5",
                  title: "Деятельность трубопроводного транспорта",
                  children: [
                     {
                        id: "49.50",
                        title: "Деятельность трубопроводного транспорта",
                        children: [
                           {
                              id: "49.50.1",
                              title: "Транспортирование по трубопроводам нефти и нефтепродуктов",
                              children: [
                                 {
                                    id: "49.50.11",
                                    title: "Транспортирование по трубопроводам нефти"
                                 },
                                 {
                                    id: "49.50.12",
                                    title: "Транспортирование по трубопроводам нефтепродуктов"
                                 }]
                           },
                           {
                              id: "49.50.2",
                              title: "Транспортирование по трубопроводам газа и продуктов его переработки",
                              children: [
                                 {
                                    id: "49.50.21",
                                    title: "Транспортирование по трубопроводам газа"
                                 },
                                 {
                                    id: "49.50.22",
                                    title: "Транспортирование по трубопроводам продуктов переработки газа"
                                 }]
                           },
                           {
                              id: "49.50.3",
                              title: "Транспортирование по трубопроводам прочих видов грузов"
                           }]
                     }]
               }]
         },
         {
            id: "50",
            title: "Деятельность водного транспорта",
            children: [
               {
                  id: "50.1",
                  title: "Деятельность морского пассажирского транспорта",
                  children: [
                     {
                        id: "50.10",
                        title: "Деятельность морского пассажирского транспорта",
                        children: [
                           {
                              id: "50.10.1",
                              title: "Перевозка пассажиров морскими судами заграничного плавания",
                              children: [
                                 {
                                    id: "50.10.11",
                                    title: "Перевозка пассажиров морскими судами заграничного плавания, подчиняющимися расписанию"
                                 },
                                 {
                                    id: "50.10.12",
                                    title: "Перевозка пассажиров морскими судами заграничного плавания, не подчиняющимися расписанию"
                                 }]
                           },
                           {
                              id: "50.10.2",
                              title: "Перевозка пассажиров морскими судами каботажного плавания",
                              children: [
                                 {
                                    id: "50.10.21",
                                    title: "Перевозка пассажиров морскими судами каботажного плавания, подчиняющимися расписанию"
                                 },
                                 {
                                    id: "50.10.22",
                                    title: "Перевозка пассажиров морскими судами каботажного плавания, не подчиняющимися расписанию"
                                 }]
                           },
                           {
                              id: "50.10.3",
                              title: "Аренда морских судов заграничного и каботажного плавания для перевозки пассажиров с экипажем",
                              children: [
                                 {
                                    id: "50.10.31",
                                    title: "Аренда морских судов заграничного плавания для перевозки пассажиров с экипажем"
                                 },
                                 {
                                    id: "50.10.32",
                                    title: "Аренда морских судов каботажного плавания для перевозки пассажиров с экипажем"
                                 },
                                 {
                                    id: "50.10.39",
                                    title: "Аренда прочих морских судов для перевозки пассажиров с экипажем"
                                 }]
                           }]
                     }]
               },
               {
                  id: "50.2",
                  title: "Деятельность морского грузового транспорта",
                  children: [
                     {
                        id: "50.20",
                        title: "Деятельность морского грузового транспорта",
                        children: [
                           {
                              id: "50.20.1",
                              title: "Перевозка грузов морскими судами заграничного плавания",
                              children: [
                                 {
                                    id: "50.20.11",
                                    title: "Перевозка замороженных или охлажденных грузов судами-рефрижераторами заграничного плавания"
                                 },
                                 {
                                    id: "50.20.12",
                                    title: "Перевозка сырой нефти морскими судами-танкерами заграничного плавания"
                                 },
                                 {
                                    id: "50.20.13",
                                    title: "Перевозка прочих жидкостей или газов морскими судами-танкерами заграничного плавания"
                                 },
                                 {
                                    id: "50.20.14",
                                    title: "Перевозка контейнерных грузов судами-контейнеровозами заграничного плавания"
                                 },
                                 {
                                    id: "50.20.15",
                                    title: "Перевозка сухих сыпучих грузов морскими судами заграничного плавания"
                                 },
                                 {
                                    id: "50.20.16",
                                    title: "Транспортирование (перевозка) ядерных материалов, радиоактивных веществ, радиационных источников, частей ядерных установок, радиоактивных отходов морскими судами заграничного плавания"
                                 },
                                 {
                                    id: "50.20.19",
                                    title: "Перевозка прочих грузов морскими судами заграничного плавания"
                                 }]
                           },
                           {
                              id: "50.20.2",
                              title: "Перевозка грузов морскими судами каботажного плавания",
                              children: [
                                 {
                                    id: "50.20.21",
                                    title: "Перевозка замороженных или охлажденных грузов судами-рефрижераторами каботажного плавания"
                                 },
                                 {
                                    id: "50.20.22",
                                    title: "Перевозка сырой нефти морскими судами-танкерами каботажного плавания"
                                 },
                                 {
                                    id: "50.20.23",
                                    title: "Перевозка прочих жидкостей или газов морскими судами-танкерами каботажного плавания"
                                 },
                                 {
                                    id: "50.20.24",
                                    title: "Перевозка контейнерных грузов судами-контейнеровозами каботажного плавания"
                                 },
                                 {
                                    id: "50.20.25",
                                    title: "Перевозка сухих сыпучих грузов морскими судами каботажного плавания"
                                 },
                                 {
                                    id: "50.20.26",
                                    title: "Транспортирование (перевозка) ядерных материалов, радиоактивных веществ, радиационных источников, частей ядерных установок, радиоактивных отходов морскими судами каботажного плавания"
                                 },
                                 {
                                    id: "50.20.29",
                                    title: "Перевозка прочих грузов морскими судами каботажного плавания"
                                 }]
                           },
                           {
                              id: "50.20.3",
                              title: "Аренда морских судов заграничного и каботажного плавания для перевозки грузов с экипажем",
                              children: [
                                 {
                                    id: "50.20.31",
                                    title: "Аренда морских судов заграничного плавания для перевозки грузов с экипажем"
                                 },
                                 {
                                    id: "50.20.32",
                                    title: "Аренда морских судов каботажного плавания для перевозки грузов с экипажем"
                                 }]
                           },
                           {
                              id: "50.20.4",
                              title: "Буксировка и маневровые услуги, оказываемые судами заграничного и каботажного плавания",
                              children: [
                                 {
                                    id: "50.20.41",
                                    title: "Буксировка судами заграничного и каботажного плавания"
                                 },
                                 {
                                    id: "50.20.42",
                                    title: "Деятельность по оказанию маневровых услуг судами заграничного и каботажного плавания"
                                 }]
                           }]
                     }]
               },
               {
                  id: "50.3",
                  title: "Деятельность внутреннего водного пассажирского транспорта",
                  children: [
                     {
                        id: "50.30",
                        title: "Деятельность внутреннего водного пассажирского транспорта",
                        children: [
                           {
                              id: "50.30.1",
                              title: "Перевозка пассажиров по внутренним водным путям"
                           },
                           {
                              id: "50.30.2",
                              title: "Аренда судов внутреннего водного транспорта для перевозки пассажиров с экипажем"
                           }]
                     }]
               },
               {
                  id: "50.4",
                  title: "Деятельность внутреннего водного грузового транспорта",
                  children: [
                     {
                        id: "50.40",
                        title: "Деятельность внутреннего водного грузового транспорта",
                        children: [
                           {
                              id: "50.40.1",
                              title: "Перевозка грузов по внутренним водным путям"
                           },
                           {
                              id: "50.40.2",
                              title: "Буксировка и маневровые услуги на внутренних водных путях"
                           },
                           {
                              id: "50.40.3",
                              title: "Аренда судов внутреннего водного транспорта для перевозки грузов с экипажем"
                           }]
                     }]
               }]
         },
         {
            id: "51",
            title: "Деятельность воздушного и космического транспорта",
            children: [
               {
                  id: "51.1",
                  title: "Деятельность пассажирского воздушного транспорта",
                  children: [
                     {
                        id: "51.10",
                        title: "Деятельность пассажирского воздушного транспорта",
                        children: [
                           {
                              id: "51.10.1",
                              title: "Перевозка воздушным пассажирским транспортом, подчиняющимся расписанию"
                           },
                           {
                              id: "51.10.2",
                              title: "Перевозка воздушным пассажирским транспортом, не подчиняющимся расписанию"
                           },
                           {
                              id: "51.10.3",
                              title: "Аренда воздушного судна с экипажем для перевозки пассажиров"
                           }]
                     }]
               },
               {
                  id: "51.2",
                  title: "Деятельность грузового воздушного транспорта и космического транспорта",
                  children: [
                     {
                        id: "51.21",
                        title: "Деятельность грузового воздушного транспорта",
                        children: [
                           {
                              id: "51.21.1",
                              title: "Перевозка воздушным грузовым транспортом, подчиняющимся расписанию"
                           },
                           {
                              id: "51.21.2",
                              title: "Перевозка воздушным грузовым транспортом, не подчиняющимся расписанию"
                           },
                           {
                              id: "51.21.3",
                              title: "Аренда грузовых воздушных судов с экипажем"
                           }]
                     },
                     {
                        id: "51.22",
                        title: "Деятельность космического транспорта",
                        children: [
                           {
                              id: "51.22.1",
                              title: "Перевозка пассажиров космическим транспортом"
                           },
                           {
                              id: "51.22.2",
                              title: "Перевозка грузов космическим транспортом"
                           },
                           {
                              id: "51.22.3",
                              title: "Запуск ракет космического назначения и выведение космических объектов на орбиту"
                           },
                           {
                              id: "51.22.4",
                              title: "Деятельность космических лабораторий"
                           }]
                     }]
               }]
         },
         {
            id: "52",
            title: "Складское хозяйство и вспомогательная транспортная деятельность",
            children: [
               {
                  id: "52.1",
                  title: "Деятельность по складированию и хранению",
                  children: [
                     {
                        id: "52.10",
                        title: "Деятельность по складированию и хранению",
                        children: [
                           {
                              id: "52.10.1",
                              title: "Хранение и складирование замороженных или охлажденных грузов"
                           },
                           {
                              id: "52.10.2",
                              title: "Хранение и складирование жидких или газообразных грузов",
                              children: [
                                 {
                                    id: "52.10.21",
                                    title: "Хранение и складирование нефти и продуктов ее переработки"
                                 },
                                 {
                                    id: "52.10.22",
                                    title: "Хранение и складирование газа и продуктов его переработки"
                                 },
                                 {
                                    id: "52.10.23",
                                    title: "Хранение и складирование прочих жидких или газообразных грузов"
                                 }]
                           },
                           {
                              id: "52.10.3",
                              title: "Хранение и складирование зерна"
                           },
                           {
                              id: "52.10.4",
                              title: "Хранение ядерных материалов и радиоактивных веществ"
                           },
                           {
                              id: "52.10.9",
                              title: "Хранение и складирование прочих грузов"
                           }]
                     }]
               },
               {
                  id: "52.2",
                  title: "Деятельность транспортная вспомогательная",
                  children: [
                     {
                        id: "52.21",
                        title: "Деятельность вспомогательная, связанная с сухопутным транспортом",
                        children: [
                           {
                              id: "52.21.1",
                              title: "Деятельность вспомогательная, связанная с железнодорожным транспортом",
                              children: [
                                 {
                                    id: "52.21.11",
                                    title: "Предоставление железнодорожных маневровых или буксировочных услуг"
                                 },
                                 {
                                    id: "52.21.12",
                                    title: "Деятельность железнодорожных пассажирских вокзалов и грузовых терминалов"
                                 },
                                 {
                                    id: "52.21.13",
                                    title: "Деятельность железнодорожной инфраструктуры"
                                 },
                                 {
                                    id: "52.21.19",
                                    title: "Деятельность вспомогательная прочая, связанная с железнодорожным транспортом"
                                 }]
                           },
                           {
                              id: "52.21.2",
                              title: "Деятельность вспомогательная, связанная с автомобильным транспортом",
                              children: [
                                 {
                                    id: "52.21.21",
                                    title: "Деятельность автовокзалов и автостанций"
                                 },
                                 {
                                    id: "52.21.22",
                                    title: "Деятельность по эксплуатации автомобильных дорог и автомагистралей"
                                 },
                                 {
                                    id: "52.21.23",
                                    title: "Деятельность по эксплуатации мостов и тоннелей"
                                 },
                                 {
                                    id: "52.21.24",
                                    title: "Деятельность стоянок для транспортных средств"
                                 },
                                 {
                                    id: "52.21.25",
                                    title: "Деятельность по буксировке автотранспортных средств"
                                 },
                                 {
                                    id: "52.21.29",
                                    title: "Деятельность вспомогательная прочая, связанная с автомобильным транспортом"
                                 }]
                           },
                           {
                              id: "52.21.3",
                              title: "Деятельность вспомогательная, связанная с трубопроводным транспортом"
                           }]
                     },
                     {
                        id: "52.22",
                        title: "Деятельность вспомогательная, связанная с водным транспортом",
                        children: [
                           {
                              id: "52.22.1",
                              title: "Деятельность вспомогательная, связанная с морским транспортом",
                              children: [
                                 {
                                    id: "52.22.11",
                                    title: "Деятельность инфраструктуры морских портов, включая портовые гидротехнические сооружения (причалы, морские терминалы, доки и др.)"
                                 },
                                 {
                                    id: "52.22.12",
                                    title: "Обеспечение судоходства в морских и прибрежных водах, включая лоцманскую проводку судов"
                                 },
                                 {
                                    id: "52.22.13",
                                    title: "Деятельность по постановке судов к причалу, осуществление швартовых операций с судами в морских портах"
                                 },
                                 {
                                    id: "52.22.14",
                                    title: "Деятельность по навигационному обеспечению судоходства на морском транспорте"
                                 },
                                 {
                                    id: "52.22.15",
                                    title: "Деятельность аварийно-спасательная и судоподъемная на морском транспорте"
                                 },
                                 {
                                    id: "52.22.16",
                                    title: "Снабженческое (шипчандлерское) обслуживание судов, включая бункеровку судов топливом, обслуживание судов в период стоянки в портах: агентирование судов, обследовательское (сюрвейерское) обслуживание судов на морском транспорте"
                                 },
                                 {
                                    id: "52.22.17",
                                    title: "Производство водолазных работ по обслуживанию морских судов"
                                 },
                                 {
                                    id: "52.22.18",
                                    title: "Деятельность ледокольного флота на морском транспорте"
                                 },
                                 {
                                    id: "52.22.19",
                                    title: "Деятельность вспомогательная, связанная с морским транспортом, прочая, не включенная в другие группировки"
                                 }]
                           },
                           {
                              id: "52.22.2",
                              title: "Деятельность вспомогательная, связанная с внутренним водным транспортом",
                              children: [
                                 {
                                    id: "52.22.21",
                                    title: "Деятельность инфраструктуры речных портов и гидротехнических сооружений"
                                 },
                                 {
                                    id: "52.22.22",
                                    title: "Обеспечение судоходства по внутренним водным путям, в том числе лоцманская проводка судов"
                                 },
                                 {
                                    id: "52.22.23",
                                    title: "Деятельность по постановке судов к причалу, осуществление швартовых операций в речных портах на внутреннем водном транспорте"
                                 },
                                 {
                                    id: "52.22.24",
                                    title: "Деятельность по навигационному обеспечению судоходства на внутреннем водном транспорте"
                                 },
                                 {
                                    id: "52.22.25",
                                    title: "Деятельность аварийно-спасательная и судоподъемная на внутреннем водном транспорте"
                                 },
                                 {
                                    id: "52.22.26",
                                    title: "Снабженческое (шипчандлерское) обслуживание судов, включая бункеровку судов топливом, обслуживание судов в период стоянки в портах: агентирование судов, обследовательское (сюрвейерское) обслуживание судов на внутреннем водном транспорте"
                                 },
                                 {
                                    id: "52.22.27",
                                    title: "Производство водолазных работ по обслуживанию судов на внутреннем водном транспорте"
                                 },
                                 {
                                    id: "52.22.28",
                                    title: "Деятельность ледокольного флота на внутреннем водном транспорте"
                                 },
                                 {
                                    id: "52.22.29",
                                    title: "Деятельность вспомогательная, связанная с внутренним водным транспортом, прочая, не включенная в другие группировки"
                                 }]
                           }]
                     },
                     {
                        id: "52.23",
                        title: "Деятельность вспомогательная, связанная с воздушным и космическим транспортом",
                        children: [
                           {
                              id: "52.23.1",
                              title: "Деятельность вспомогательная, связанная с воздушным транспортом",
                              children: [
                                 {
                                    id: "52.23.11",
                                    title: "Деятельность аэропортовая"
                                 },
                                 {
                                    id: "52.23.12",
                                    title: "Обеспечение обслуживания (управления) воздушного движения"
                                 },
                                 {
                                    id: "52.23.13",
                                    title: "Выполнение авиационных работ"
                                 },
                                 {
                                    id: "52.23.19",
                                    title: "Деятельность вспомогательная прочая, связанная с воздушным транспортом"
                                 }]
                           },
                           {
                              id: "52.23.2",
                              title: "Деятельность вспомогательная, связанная с космическим транспортом",
                              children: [
                                 {
                                    id: "52.23.21",
                                    title: "Деятельность наземных центров управления полетами космических объектов в космическом пространстве и центров (пунктов) космической связи"
                                 },
                                 {
                                    id: "52.23.22",
                                    title: "Деятельность поисковых и аварийно-спасательных служб, в том числе по эвакуации спускаемых аппаратов (капсул), составных частей ракет космического назначения"
                                 },
                                 {
                                    id: "52.23.23",
                                    title: "Деятельность, связанная с подготовкой космонавтов для работы непосредственно в космическом пространстве"
                                 },
                                 {
                                    id: "52.23.29",
                                    title: "Деятельность вспомогательная прочая, связанная с космическим транспортом"
                                 }]
                           }]
                     },
                     {
                        id: "52.24",
                        title: "Транспортная обработка грузов",
                        children: [
                           {
                              id: "52.24.1",
                              title: "Транспортная обработка контейнеров"
                           },
                           {
                              id: "52.24.2",
                              title: "Транспортная обработка прочих грузов"
                           }]
                     },
                     {
                        id: "52.29",
                        title: "Деятельность вспомогательная прочая, связанная с перевозками"
                     }]
               }]
         },
         {
            id: "53",
            title: "Деятельность почтовой связи и курьерская деятельность",
            children: [
               {
                  id: "53.1",
                  title: "Деятельность почтовой связи общего пользования",
                  children: [
                     {
                        id: "53.10",
                        title: "Деятельность почтовой связи общего пользования",
                        children: [
                           {
                              id: "53.10.1",
                              title: "Деятельность почтовой связи, связанная с пересылкой газет и других периодических изданий"
                           },
                           {
                              id: "53.10.2",
                              title: "Деятельность почтовой связи, связанная с пересылкой письменной корреспонденции"
                           },
                           {
                              id: "53.10.3",
                              title: "Деятельность почтовой связи, связанная с пересылкой посылочной почты"
                           },
                           {
                              id: "53.10.4",
                              title: "Деятельность почтовой связи дополнительная"
                           },
                           {
                              id: "53.10.9",
                              title: "Деятельность почтовой связи общего пользования прочая"
                           }]
                     }]
               },
               {
                  id: "53.2",
                  title: "Деятельность почтовой связи прочая и курьерская деятельность",
                  children: [
                     {
                        id: "53.20",
                        title: "Деятельность почтовой связи прочая и курьерская деятельность",
                        children: [
                           {
                              id: "53.20.1",
                              title: "Деятельность специальной почтовой связи"
                           },
                           {
                              id: "53.20.2",
                              title: "Деятельность фельдъегерской связи",
                              children: [
                                 {
                                    id: "53.20.21",
                                    title: "Деятельность федеральной фельдъегерской связи"
                                 },
                                 {
                                    id: "53.20.22",
                                    title: "Деятельность фельдъегерско-почтовой связи"
                                 },
                                 {
                                    id: "53.20.29",
                                    title: "Деятельность почтовой связи прочая, не включенная в другие группировки"
                                 }]
                           },
                           {
                              id: "53.20.3",
                              title: "Деятельность курьерская",
                              children: [
                                 {
                                    id: "53.20.31",
                                    title: "Деятельность по курьерской доставке различными видами транспорта"
                                 },
                                 {
                                    id: "53.20.32",
                                    title: "Деятельность по доставке еды на дом"
                                 },
                                 {
                                    id: "53.20.39",
                                    title: "Деятельность курьерская прочая"
                                 }]
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел I",
      title: "Деятельность гостиниц и предприятий общественного питания",
      children: [
         {
            id: "55",
            title: "Деятельность по предоставлению мест для временного проживания",
            children: [
               {
                  id: "55.1",
                  title: "Деятельность гостиниц и прочих мест для временного проживания",
                  children: [
                     {
                        id: "55.10",
                        title: "Деятельность гостиниц и прочих мест для временного проживания"
                     }]
               },
               {
                  id: "55.2",
                  title: "Деятельность по предоставлению мест для краткосрочного проживания",
                  children: [
                     {
                        id: "55.20",
                        title: "Деятельность по предоставлению мест для краткосрочного проживания"
                     }]
               },
               {
                  id: "55.3",
                  title: "Деятельность по предоставлению мест для временного проживания в кемпингах, жилых автофургонах и туристических автоприцепах",
                  children: [
                     {
                        id: "55.30",
                        title: "Деятельность по предоставлению мест для временного проживания в кемпингах, жилых автофургонах и туристических автоприцепах"
                     }]
               },
               {
                  id: "55.9",
                  title: "Деятельность по предоставлению прочих мест для временного проживания",
                  children: [
                     {
                        id: "55.90",
                        title: "Деятельность по предоставлению прочих мест для временного проживания"
                     }]
               }]
         },
         {
            id: "56",
            title: "Деятельность по предоставлению продуктов питания и напитков",
            children: [
               {
                  id: "56.1",
                  title: "Деятельность ресторанов и услуги по доставке продуктов питания",
                  children: [
                     {
                        id: "56.10",
                        title: "Деятельность ресторанов и услуги по доставке продуктов питания",
                        children: [
                           {
                              id: "56.10.1",
                              title: "Деятельность ресторанов и кафе с полным ресторанным обслуживанием, кафетериев, ресторанов быстрого питания и самообслуживания"
                           },
                           {
                              id: "56.10.2",
                              title: "Деятельность по приготовлению и/или продаже пищи, готовой к непосредственному употреблению на месте, с транспортных средств или передвижных лавок",
                              children: [
                                 {
                                    id: "56.10.21",
                                    title: "Деятельность предприятий общественного питания с обслуживанием на вынос"
                                 },
                                 {
                                    id: "56.10.22",
                                    title: "Деятельность передвижных продовольственных лавок по приготовлению и/или продаже пищи, готовой к употреблению"
                                 },
                                 {
                                    id: "56.10.23",
                                    title: "Деятельность вагончиков, палаток по приготовлению и продаже мороженого"
                                 },
                                 {
                                    id: "56.10.24",
                                    title: "Деятельность рыночных киосков и торговых палаток по приготовлению пищи"
                                 }]
                           },
                           {
                              id: "56.10.3",
                              title: "Деятельность ресторанов и баров по обеспечению питанием в железнодорожных вагонах-ресторанах и на судах"
                           }]
                     }]
               },
               {
                  id: "56.2",
                  title: "Деятельность предприятий общественного питания по обслуживанию торжественных мероприятий и прочим видам организации питания",
                  children: [
                     {
                        id: "56.21",
                        title: "Деятельность предприятий общественного питания по обслуживанию торжественных мероприятий"
                     },
                     {
                        id: "56.29",
                        title: "Деятельность предприятий общественного питания по прочим видам организации питания",
                        children: [
                           {
                              id: "56.29.1",
                              title: "Деятельность организаций общественного питания, поставляющих готовую пищу (для транспортных и строительных компаний, туристическим группам, личному составу вооруженных сил, предприятиям розничной торговли и другим группам потребителей) по договору"
                           },
                           {
                              id: "56.29.2",
                              title: "Деятельность столовых и буфетов при предприятиях и учреждениях"
                           },
                           {
                              id: "56.29.3",
                              title: "Деятельность по доставке продуктов питания учебным, спортивным и прочим учреждениям (по льготным ценам)"
                           },
                           {
                              id: "56.29.4",
                              title: "Деятельность социальных столовых, буфетов или кафетериев (в офисах, больницах, школах, институтах и пр.) на основе льготных цен на питание"
                           }]
                     }]
               },
               {
                  id: "56.3",
                  title: "Подача напитков",
                  children: [
                     {
                        id: "56.30",
                        title: "Подача напитков"
                     }]
               }]
         }]
   },
   {
      id: "Раздел J",
      title: "Деятельность в области информации и связи",
      children: [
         {
            id: "58",
            title: "Деятельность издательская",
            children: [
               {
                  id: "58.1",
                  title: "Издание книг, периодических публикаций и другие виды издательской деятельности",
                  children: [
                     {
                        id: "58.11",
                        title: "Издание книг",
                        children: [
                           {
                              id: "58.11.1",
                              title: "Издание книг, брошюр, рекламных буклетов и аналогичных изданий, включая издание словарей и энциклопедий, в том числе для слепых, в печатном виде"
                           },
                           {
                              id: "58.11.2",
                              title: "Издание книг, брошюр, рекламных буклетов и аналогичных изданий, включая издание словарей и энциклопедий на электронных носителях"
                           },
                           {
                              id: "58.11.3",
                              title: "Издание атласов, карт и таблиц, в том числе для слепых, в печатном виде"
                           },
                           {
                              id: "58.11.4",
                              title: "Издание атласов, карт и таблиц на электронных носителях"
                           }]
                     },
                     {
                        id: "58.12",
                        title: "Издание адресных справочников и списков адресатов",
                        children: [
                           {
                              id: "58.12.1",
                              title: "Издание справочников в печатном виде"
                           },
                           {
                              id: "58.12.2",
                              title: "Издание справочников на электронных носителях"
                           }]
                     },
                     {
                        id: "58.13",
                        title: "Издание газет",
                        children: [
                           {
                              id: "58.13.1",
                              title: "Издание газет в печатном виде"
                           },
                           {
                              id: "58.13.2",
                              title: "Издание газет на электронных носителях"
                           }]
                     },
                     {
                        id: "58.14",
                        title: "Издание журналов и периодических изданий",
                        children: [
                           {
                              id: "58.14.1",
                              title: "Издание журналов и периодических публикаций в печатном виде"
                           },
                           {
                              id: "58.14.2",
                              title: "Издание журналов и периодических публикаций на электронных носителях"
                           }]
                     },
                     {
                        id: "58.19",
                        title: "Виды издательской деятельности прочие"
                     }]
               },
               {
                  id: "58.2",
                  title: "Издание программного обеспечения",
                  children: [
                     {
                        id: "58.21",
                        title: "Издание компьютерных игр"
                     },
                     {
                        id: "58.29",
                        title: "Издание прочих программных продуктов"
                     }]
               }]
         },
         {
            id: "59",
            title: "Производство кинофильмов, видеофильмов и телевизионных программ, издание звукозаписей и нот",
            children: [
               {
                  id: "59.1",
                  title: "Производство кинофильмов, видеофильмов и телевизионных программ",
                  children: [
                     {
                        id: "59.11",
                        title: "Производство кинофильмов, видеофильмов и телевизионных программ"
                     },
                     {
                        id: "59.12",
                        title: "Деятельность монтажно-компоновочная в области производства кинофильмов, видеофильмов и телевизионных программ"
                     },
                     {
                        id: "59.13",
                        title: "Деятельность по распространению кинофильмов, видеофильмов и телевизионных программ"
                     },
                     {
                        id: "59.14",
                        title: "Деятельность в области демонстрации кинофильмов"
                     }]
               },
               {
                  id: "59.2",
                  title: "Деятельность в области звукозаписи и издания музыкальных произведений",
                  children: [
                     {
                        id: "59.20",
                        title: "Деятельность в области звукозаписи и издания музыкальных произведений",
                        children: [
                           {
                              id: "59.20.1",
                              title: "Издание аудиовизуальных произведений на магнитных, электронных и цифровых носителях"
                           },
                           {
                              id: "59.20.2",
                              title: "Деятельность студий звукозаписи"
                           },
                           {
                              id: "59.20.3",
                              title: "Издание музыкальных и нотных тетрадей, в том числе для слепых"
                           }]
                     }]
               }]
         },
         {
            id: "60",
            title: "Деятельность в области телевизионного и радиовещания",
            children: [
               {
                  id: "60.1",
                  title: "Деятельность в области радиовещания",
                  children: [
                     {
                        id: "60.10",
                        title: "Деятельность в области радиовещания"
                     }]
               },
               {
                  id: "60.2",
                  title: "Деятельность в области телевизионного вещания",
                  children: [
                     {
                        id: "60.20",
                        title: "Деятельность в области телевизионного вещания"
                     }]
               }]
         },
         {
            id: "61",
            title: "Деятельность в сфере телекоммуникаций",
            children: [
               {
                  id: "61.1",
                  title: "Деятельность в области связи на базе проводных технологий",
                  children: [
                     {
                        id: "61.10",
                        title: "Деятельность в области связи на базе проводных технологий",
                        children: [
                           {
                              id: "61.10.1",
                              title: "Деятельность по предоставлению услуг телефонной связи"
                           },
                           {
                              id: "61.10.2",
                              title: "Деятельность по предоставлению услуг по передаче данных для целей передачи голосовой информации (IP-телефония)"
                           },
                           {
                              id: "61.10.3",
                              title: "Деятельность по предоставлению услуг по передаче данных и услуг доступа к информационно-коммуникационной сети Интернет"
                           },
                           {
                              id: "61.10.4",
                              title: "Деятельность в области документальной электросвязи"
                           },
                           {
                              id: "61.10.5",
                              title: "Деятельность по трансляции телерадиоканалов по сетям кабельного телерадиовещания"
                           },
                           {
                              id: "61.10.6",
                              title: "Деятельность операторов связи по присоединению и пропуску трафика"
                           },
                           {
                              id: "61.10.8",
                              title: "Деятельность операторов связи по присоединению и пропуску международного трафика"
                           },
                           {
                              id: "61.10.9",
                              title: "Деятельность в области связи на базе проводных технологий прочая"
                           }]
                     }]
               },
               {
                  id: "61.2",
                  title: "Деятельность в области связи на базе беспроводных технологий",
                  children: [
                     {
                        id: "61.20",
                        title: "Деятельность в области связи на базе беспроводных технологий",
                        children: [
                           {
                              id: "61.20.1",
                              title: "Деятельность по предоставлению услуг подвижной связи для целей передачи голоса"
                           },
                           {
                              id: "61.20.2",
                              title: "Деятельность по предоставлению услуг подвижной связи для целей передачи данных"
                           },
                           {
                              id: "61.20.3",
                              title: "Деятельность по предоставлению услуг подвижной связи для доступа к информационно-коммуникационной сети Интернет"
                           },
                           {
                              id: "61.20.4",
                              title: "Деятельность по предоставлению услуг связи для целей открытого эфирного вещания"
                           },
                           {
                              id: "61.20.5",
                              title: "Деятельность по предоставлению услуг цифрового телерадиовещания на базе беспроводных технологий"
                           }]
                     }]
               },
               {
                  id: "61.3",
                  title: "Деятельность в области спутниковой связи",
                  children: [
                     {
                        id: "61.30",
                        title: "Деятельность в области спутниковой связи",
                        children: [
                           {
                              id: "61.30.1",
                              title: "Деятельность по предоставлению услуг доступа к информационно-коммуникационной сети Интернет оператором спутниковой связи"
                           },
                           {
                              id: "61.30.2",
                              title: "Деятельность по предоставлению услуг трансляции телерадиоканалов по сетям спутникового телерадиовещания"
                           }]
                     }]
               },
               {
                  id: "61.9",
                  title: "Деятельность в области телекоммуникаций прочая",
                  children: [
                     {
                        id: "61.90",
                        title: "Деятельность в области телекоммуникаций прочая"
                     }]
               }]
         },
         {
            id: "62",
            title: "Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги",
            children: [
               {
                  id: "62.0",
                  title: "Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги",
                  children: [
                     {
                        id: "62.01",
                        title: "Разработка компьютерного программного обеспечения"
                     },
                     {
                        id: "62.02",
                        title: "Деятельность консультативная и работы в области компьютерных технологий",
                        children: [
                           {
                              id: "62.02.1",
                              title: "Деятельность по планированию, проектированию компьютерных систем"
                           },
                           {
                              id: "62.02.2",
                              title: "Деятельность по обследованию и экспертизе компьютерных систем"
                           },
                           {
                              id: "62.02.3",
                              title: "Деятельность по обучению пользователей"
                           },
                           {
                              id: "62.02.4",
                              title: "Деятельность по подготовке компьютерных систем к эксплуатации"
                           },
                           {
                              id: "62.02.9",
                              title: "Деятельность консультативная в области компьютерных технологий прочая"
                           }]
                     },
                     {
                        id: "62.03",
                        title: "Деятельность по управлению компьютерным оборудованием",
                        children: [
                           {
                              id: "62.03.1",
                              title: "Деятельность по управлению компьютерными системами",
                              children: [
                                 {
                                    id: "62.03.11",
                                    title: "Деятельность по управлению компьютерными системами непосредственно"
                                 },
                                 {
                                    id: "62.03.12",
                                    title: "Деятельность по управлению компьютерными системами дистанционно"
                                 },
                                 {
                                    id: "62.03.13",
                                    title: "Деятельность по сопровождению компьютерных систем"
                                 },
                                 {
                                    id: "62.03.19",
                                    title: "Деятельность по управлению компьютерным оборудованием прочая, не включенная в другие группировки"
                                 }]
                           }]
                     },
                     {
                        id: "62.09",
                        title: "Деятельность, связанная с использованием вычислительной техники и информационных технологий, прочая"
                     }]
               }]
         },
         {
            id: "63",
            title: "Деятельность в области информационных технологий",
            children: [
               {
                  id: "63.1",
                  title: "Деятельность по обработке данных, предоставление услуг по размещению информации, деятельность порталов в информационно-коммуникационной сети Интернет",
                  children: [
                     {
                        id: "63.11",
                        title: "Деятельность по обработке данных, предоставление услуг по размещению информации и связанная с этим деятельность",
                        children: [
                           {
                              id: "63.11.1",
                              title: "Деятельность по созданию и использованию баз данных и информационных ресурсов"
                           },
                           {
                              id: "63.11.9",
                              title: "Деятельность по предоставлению услуг по размещению информации прочая"
                           }]
                     },
                     {
                        id: "63.12",
                        title: "Деятельность web-порталов",
                        children: [
                           {
                              id: "63.12.1",
                              title: "Деятельность сетевых изданий"
                           }]
                     }]
               },
               {
                  id: "63.9",
                  title: "Деятельность в области информационных услуг прочая",
                  children: [
                     {
                        id: "63.91",
                        title: "Деятельность информационных агентств"
                     },
                     {
                        id: "63.99",
                        title: "Деятельность информационных служб прочая, не включенная в другие группировки",
                        children: [
                           {
                              id: "63.99.1",
                              title: "Деятельность по оказанию консультационных и информационных услуг",
                              children: [
                                 {
                                    id: "63.99.11",
                                    title: "Деятельность по оказанию компьютерных информационных услуг телефонной связи"
                                 },
                                 {
                                    id: "63.99.12",
                                    title: "Деятельность по оказанию услуг службами информационного поиска по договору или на платной основе"
                                 }]
                           },
                           {
                              id: "63.99.2",
                              title: "Деятельность по оказанию услуг по составлению обзоров новостей, услуг по подборке печатных изданий и подобной информации"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел K",
      title: "Деятельность финансовая и страховая",
      children: [
         {
            id: "64",
            title: "Деятельность по предоставлению финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению",
            children: [
               {
                  id: "64.1",
                  title: "Денежное посредничество",
                  children: [
                     {
                        id: "64.11",
                        title: "Деятельность Центрального банка Российской Федерации (Банка России)"
                     },
                     {
                        id: "64.19",
                        title: "Денежное посредничество прочее"
                     }]
               },
               {
                  id: "64.2",
                  title: "Деятельность холдинговых компаний",
                  children: [
                     {
                        id: "64.20",
                        title: "Деятельность холдинговых компаний"
                     }]
               },
               {
                  id: "64.3",
                  title: "Деятельность инвестиционных фондов и аналогичных финансовых организаций",
                  children: [
                     {
                        id: "64.30",
                        title: "Деятельность инвестиционных фондов и аналогичных финансовых организаций"
                     }]
               },
               {
                  id: "64.9",
                  title: "Деятельность по предоставлению прочих финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению",
                  children: [
                     {
                        id: "64.91",
                        title: "Деятельность по финансовой аренде (лизингу/сублизингу)",
                        children: [
                           {
                              id: "64.91.1",
                              title: "Деятельность по финансовой аренде (лизингу/сублизингу) племенных животных"
                           },
                           {
                              id: "64.91.2",
                              title: "Деятельность по финансовой аренде (лизингу/сублизингу) в прочих областях, кроме племенных животных"
                           }]
                     },
                     {
                        id: "64.92",
                        title: "Предоставление займов и прочих видов кредита",
                        children: [
                           {
                              id: "64.92.1",
                              title: "Деятельность по предоставлению потребительского кредита"
                           },
                           {
                              id: "64.92.2",
                              title: "Деятельность по предоставлению займов промышленности"
                           },
                           {
                              id: "64.92.3",
                              title: "Деятельность по предоставлению денежных ссуд под залог недвижимого имущества"
                           },
                           {
                              id: "64.92.4",
                              title: "Деятельность по предоставлению кредитов на покупку домов специализированными учреждениями, не принимающими депозиты"
                           },
                           {
                              id: "64.92.6",
                              title: "Деятельность по предоставлению ломбардами краткосрочных займов под залог движимого имущества"
                           },
                           {
                              id: "64.92.7",
                              title: "Деятельность микрофинансовая"
                           }]
                     },
                     {
                        id: "64.99",
                        title: "Предоставление прочих финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению, не включенных в другие группировки",
                        children: [
                           {
                              id: "64.99.1",
                              title: "Вложения в ценные бумаги"
                           },
                           {
                              id: "64.99.2",
                              title: "Деятельность дилерская"
                           },
                           {
                              id: "64.99.3",
                              title: "Капиталовложения в уставные капиталы, венчурное инвестирование, в том числе посредством инвестиционных компаний"
                           },
                           {
                              id: "64.99.4",
                              title: "Заключение свопов, опционов и других срочных сделок"
                           },
                           {
                              id: "64.99.5",
                              title: "Предоставление факторинговых услуг"
                           },
                           {
                              id: "64.99.6",
                              title: "Деятельность по финансовой взаимопомощи"
                           },
                           {
                              id: "64.99.7",
                              title: "Деятельность специализированного депозитария инвестиционных фондов, паевых инвестиционных фондов, негосударственных пенсионных фондов"
                           },
                           {
                              id: "64.99.8",
                              title: "Деятельность ипотечных агентов, управляющих ипотечным покрытием; деятельность специализированных депозитариев ипотечного покрытия"
                           },
                           {
                              id: "64.99.9",
                              title: "Деятельность жилищных накопительных кооперативов"
                           }]
                     }]
               }]
         },
         {
            id: "65",
            title: "Страхование, перестрахование, деятельность негосударственных пенсионных фондов, кроме обязательного социального обеспечения",
            children: [
               {
                  id: "65.1",
                  title: "Страхование",
                  children: [
                     {
                        id: "65.11",
                        title: "Страхование жизни"
                     },
                     {
                        id: "65.12",
                        title: "Страхование, кроме страхования жизни",
                        children: [
                           {
                              id: "65.12.1",
                              title: "Страхование медицинское"
                           },
                           {
                              id: "65.12.2",
                              title: "Страхование имущества"
                           },
                           {
                              id: "65.12.3",
                              title: "Страхование гражданской ответственности"
                           },
                           {
                              id: "65.12.4",
                              title: "Страхование от несчастных случаев и болезней"
                           },
                           {
                              id: "65.12.5",
                              title: "Страхование рисков"
                           },
                           {
                              id: "65.12.6",
                              title: "Страхование для путешественника, выезжающего за пределы постоянного проживания"
                           },
                           {
                              id: "65.12.9",
                              title: "Прочие виды страхования, не включенные в другие группировки"
                           }]
                     }]
               },
               {
                  id: "65.2",
                  title: "Перестрахование",
                  children: [
                     {
                        id: "65.20",
                        title: "Перестрахование"
                     }]
               },
               {
                  id: "65.3",
                  title: "Деятельность негосударственных пенсионных фондов",
                  children: [
                     {
                        id: "65.30",
                        title: "Деятельность негосударственных пенсионных фондов"
                     }]
               }]
         },
         {
            id: "66",
            title: "Деятельность вспомогательная в сфере финансовых услуг и страхования",
            children: [
               {
                  id: "66.1",
                  title: "Деятельность вспомогательная в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
                  children: [
                     {
                        id: "66.11",
                        title: "Управление финансовыми рынками",
                        children: [
                           {
                              id: "66.11.1",
                              title: "Деятельность по организации торговли на финансовых рынках"
                           },
                           {
                              id: "66.11.2",
                              title: "Управление и контроль за деятельностью фондовых, товарных, валютных и валютно-фондовых бирж"
                           },
                           {
                              id: "66.11.3",
                              title: "Деятельность регистраторов по ведению реестра владельцев ценных бумаг"
                           },
                           {
                              id: "66.11.4",
                              title: "Деятельность по обеспечению эффективности функционирования финансовых рынков"
                           },
                           {
                              id: "66.11.5",
                              title: "Деятельность по определению взаимных обязательств (клиринг)"
                           }]
                     },
                     {
                        id: "66.12",
                        title: "Деятельность брокерская по сделкам с ценными бумагами и товарами",
                        children: [
                           {
                              id: "66.12.1",
                              title: "Деятельность биржевых посредников и биржевых брокеров, совершающих товарные фьючерсные и опционные сделки в биржевой торговле"
                           },
                           {
                              id: "66.12.2",
                              title: "Деятельность по управлению ценными бумагами"
                           },
                           {
                              id: "66.12.3",
                              title: "Деятельность эмиссионная"
                           }]
                     },
                     {
                        id: "66.19",
                        title: "Деятельность вспомогательная прочая в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
                        children: [
                           {
                              id: "66.19.1",
                              title: "Деятельность по предоставлению брокерских услуг по ипотечным операциям"
                           },
                           {
                              id: "66.19.3",
                              title: "Деятельность по предоставлению услуг по обработке наличных денег"
                           },
                           {
                              id: "66.19.4",
                              title: "Деятельность по предоставлению консультационных услуг по вопросам финансового посредничества"
                           },
                           {
                              id: "66.19.5",
                              title: "Предоставление услуг по хранению ценностей, депозитарная деятельность"
                           },
                           {
                              id: "66.19.6",
                              title: "Деятельность по приему платежей физических лиц платежными агентами",
                              children: [
                                 {
                                    id: "66.19.61",
                                    title: "Деятельность операторов по приему платежей физических лиц"
                                 },
                                 {
                                    id: "66.19.62",
                                    title: "Деятельность платежных субагентов по приему платежей физических лиц"
                                 }]
                           },
                           {
                              id: "66.19.7",
                              title: "Рейтинговая деятельность"
                           }]
                     }]
               },
               {
                  id: "66.2",
                  title: "Деятельность вспомогательная в сфере страхования и пенсионного обеспечения",
                  children: [
                     {
                        id: "66.21",
                        title: "Оценка рисков и ущерба"
                     },
                     {
                        id: "66.22",
                        title: "Деятельность страховых агентов и брокеров"
                     },
                     {
                        id: "66.29",
                        title: "Деятельность вспомогательная прочая в сфере страхования и пенсионного обеспечения",
                        children: [
                           {
                              id: "66.29.1",
                              title: "Деятельность страховых актуариев"
                           },
                           {
                              id: "66.29.2",
                              title: "Деятельность распорядителей спасательными работами"
                           },
                           {
                              id: "66.29.9",
                              title: "Деятельность вспомогательная прочая в сфере страхования, кроме обязательного социального страхования"
                           }]
                     }]
               },
               {
                  id: "66.3",
                  title: "Деятельность по управлению фондами",
                  children: [
                     {
                        id: "66.30",
                        title: "Деятельность по управлению фондами",
                        children: [
                           {
                              id: "66.30.1",
                              title: "Управление инвестиционными фондами"
                           },
                           {
                              id: "66.30.2",
                              title: "Управление фондами денежного рынка"
                           },
                           {
                              id: "66.30.3",
                              title: "Управление пенсионными накоплениями негосударственных пенсионных фондов"
                           },
                           {
                              id: "66.30.4",
                              title: "Управление пенсионными резервами негосударственных пенсионных фондов"
                           },
                           {
                              id: "66.30.5",
                              title: "Управление страховыми резервами субъектов страхового дела"
                           },
                           {
                              id: "66.30.6",
                              title: "Управление на основе индивидуальных договоров доверительного управления активами"
                           },
                           {
                              id: "66.30.9",
                              title: "Другие виды деятельности по управлению активами"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел L",
      title: "Деятельность по операциям с недвижимым имуществом",
      children: [
         {
            id: "68",
            title: "Операции с недвижимым имуществом",
            children: [
               {
                  id: "68.1",
                  title: "Покупка и продажа собственного недвижимого имущества",
                  children: [
                     {
                        id: "68.10",
                        title: "Покупка и продажа собственного недвижимого имущества",
                        children: [
                           {
                              id: "68.10.1",
                              title: "Подготовка к продаже собственного недвижимого имущества",
                              children: [
                                 {
                                    id: "68.10.11",
                                    title: "Подготовка к продаже собственного жилого недвижимого имущества"
                                 },
                                 {
                                    id: "68.10.12",
                                    title: "Подготовка к продаже собственного нежилого недвижимого имущества"
                                 }]
                           },
                           {
                              id: "68.10.2",
                              title: "Покупка и продажа собственного недвижимого имущества",
                              children: [
                                 {
                                    id: "68.10.21",
                                    title: "Покупка и продажа собственного жилого недвижимого имущества"
                                 },
                                 {
                                    id: "68.10.22",
                                    title: "Покупка и продажа собственных нежилых зданий и помещений"
                                 },
                                 {
                                    id: "68.10.23",
                                    title: "Покупка и продажа земельных участков"
                                 }]
                           }]
                     }]
               },
               {
                  id: "68.2",
                  title: "Аренда и управление собственным или арендованным недвижимым имуществом",
                  children: [
                     {
                        id: "68.20",
                        title: "Аренда и управление собственным или арендованным недвижимым имуществом",
                        children: [
                           {
                              id: "68.20.1",
                              title: "Аренда и управление собственным или арендованным жилым недвижимым имуществом"
                           },
                           {
                              id: "68.20.2",
                              title: "Аренда и управление собственным или арендованным нежилым недвижимым имуществом"
                           }]
                     }]
               },
               {
                  id: "68.3",
                  title: "Операции с недвижимым имуществом за вознаграждение или на договорной основе",
                  children: [
                     {
                        id: "68.31",
                        title: "Деятельность агентств недвижимости за вознаграждение или на договорной основе",
                        children: [
                           {
                              id: "68.31.1",
                              title: "Предоставление посреднических услуг при купле-продаже недвижимого имущества за вознаграждение или на договорной основе",
                              children: [
                                 {
                                    id: "68.31.11",
                                    title: "Предоставление посреднических услуг при купле-продаже жилого недвижимого имущества за вознаграждение или на договорной основе"
                                 },
                                 {
                                    id: "68.31.12",
                                    title: "Предоставление посреднических услуг при купле-продаже нежилого недвижимого имущества за вознаграждение или на договорной основе"
                                 }]
                           },
                           {
                              id: "68.31.2",
                              title: "Предоставление посреднических услуг по аренде недвижимого имущества за вознаграждение или на договорной основе",
                              children: [
                                 {
                                    id: "68.31.21",
                                    title: "Предоставление посреднических услуг по аренде жилого недвижимого имущества за вознаграждение или на договорной основе"
                                 },
                                 {
                                    id: "68.31.22",
                                    title: "Предоставление посреднических услуг по аренде нежилого недвижимого имущества за вознаграждение или на договорной основе"
                                 }]
                           },
                           {
                              id: "68.31.3",
                              title: "Предоставление консультационных услуг при купле-продаже недвижимого имущества за вознаграждение или на договорной основе",
                              children: [
                                 {
                                    id: "68.31.31",
                                    title: "Предоставление консультационных услуг при купле-продаже жилого недвижимого имущества за вознаграждение или на договорной основе"
                                 },
                                 {
                                    id: "68.31.32",
                                    title: "Предоставление консультационных услуг при купле-продаже нежилого недвижимого имущества за вознаграждение или на договорной основе"
                                 }]
                           },
                           {
                              id: "68.31.4",
                              title: "Предоставление консультационных услуг по аренде недвижимого имущества за вознаграждение или на договорной основе",
                              children: [
                                 {
                                    id: "68.31.41",
                                    title: "Предоставление консультационных услуг по аренде жилого недвижимого имущества за вознаграждение или на договорной основе"
                                 },
                                 {
                                    id: "68.31.42",
                                    title: "Предоставление консультационных услуг по аренде нежилого недвижимого имущества за вознаграждение или на договорной основе"
                                 }]
                           },
                           {
                              id: "68.31.5",
                              title: "Предоставление посреднических услуг при оценке недвижимого имущества за вознаграждение или на договорной основе",
                              children: [
                                 {
                                    id: "68.31.51",
                                    title: "Предоставление посреднических услуг при оценке жилого недвижимого имущества за вознаграждение или на договорной основе"
                                 },
                                 {
                                    id: "68.31.52",
                                    title: "Предоставление посреднических услуг при оценке нежилого недвижимого имущества за вознаграждение или на договорной основе"
                                 }]
                           }]
                     },
                     {
                        id: "68.32",
                        title: "Управление недвижимым имуществом за вознаграждение или на договорной основе",
                        children: [
                           {
                              id: "68.32.1",
                              title: "Управление эксплуатацией жилого фонда за вознаграждение или на договорной основе"
                           },
                           {
                              id: "68.32.2",
                              title: "Управление эксплуатацией нежилого фонда за вознаграждение или на договорной основе"
                           },
                           {
                              id: "68.32.3",
                              title: "Деятельность по технической инвентаризации недвижимого имущества"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел M",
      title: "Деятельность профессиональная, научная и техническая",
      children: [
         {
            id: "69",
            title: "Деятельность в области права и бухгалтерского учета",
            children: [
               {
                  id: "69.1",
                  title: "Деятельность в области права",
                  children: [
                     {
                        id: "69.10",
                        title: "Деятельность в области права"
                     }]
               },
               {
                  id: "69.2",
                  title: "Деятельность по оказанию услуг в области бухгалтерского учета, по проведению финансового аудита, по налоговому консультированию",
                  children: [
                     {
                        id: "69.20",
                        title: "Деятельность по оказанию услуг в области бухгалтерского учета, по проведению финансового аудита, по налоговому консультированию",
                        children: [
                           {
                              id: "69.20.1",
                              title: "Деятельность по проведению финансового аудита"
                           },
                           {
                              id: "69.20.2",
                              title: "Деятельность по оказанию услуг в области бухгалтерского учета"
                           },
                           {
                              id: "69.20.3",
                              title: "Деятельность в области налогового консультирования"
                           }]
                     }]
               }]
         },
         {
            id: "70",
            title: "Деятельность головных офисов; консультирование по вопросам управления",
            children: [
               {
                  id: "70.1",
                  title: "Деятельность головных офисов",
                  children: [
                     {
                        id: "70.10",
                        title: "Деятельность головных офисов",
                        children: [
                           {
                              id: "70.10.1",
                              title: "Деятельность по управлению финансово-промышленными группами"
                           },
                           {
                              id: "70.10.2",
                              title: "Деятельность по управлению холдинг-компаниями"
                           }]
                     }]
               },
               {
                  id: "70.2",
                  title: "Консультирование по вопросам управления",
                  children: [
                     {
                        id: "70.21",
                        title: "Деятельность в сфере связей с общественностью"
                     },
                     {
                        id: "70.22",
                        title: "Консультирование по вопросам коммерческой деятельности и управления"
                     }]
               }]
         },
         {
            id: "71",
            title: "Деятельность в области архитектуры и инженерно-технического проектирования; технических испытаний, исследований и анализа",
            children: [
               {
                  id: "71.1",
                  title: "Деятельность в области архитектуры, инженерных изысканий и предоставление технических консультаций в этих областях",
                  children: [
                     {
                        id: "71.11",
                        title: "Деятельность в области архитектуры",
                        children: [
                           {
                              id: "71.11.1",
                              title: "Деятельность в области архитектуры, связанная с созданием архитектурного объекта"
                           },
                           {
                              id: "71.11.2",
                              title: "Деятельность по территориальному планированию и планировке территории"
                           },
                           {
                              id: "71.11.3",
                              title: "Деятельность в области ландшафтной архитектуры и консультативные услуги в области архитектуры"
                           }]
                     },
                     {
                        id: "71.12",
                        title: "Деятельность в области инженерных изысканий, инженерно-технического проектирования, управления проектами строительства, выполнения строительного контроля и авторского надзора, предоставление технических консультаций в этих областях",
                        children: [
                           {
                              id: "71.12.1",
                              title: "Деятельность, связанная с инженерно-техническим проектированием, управлением проектами строительства, выполнением строительного контроля и авторского надзора",
                              children: [
                                 {
                                    id: "71.12.11",
                                    title: "Разработка проектов тепло-, водо-, газоснабжения"
                                 },
                                 {
                                    id: "71.12.12",
                                    title: "Разработка проектов промышленных процессов и производств, относящихся к электротехнике, электронной технике, горному делу, химической технологии, машиностроению, а также в области промышленного строительства, системотехники и техники безопасности"
                                 },
                                 {
                                    id: "71.12.13",
                                    title: "Разработка проектов по кондиционированию воздуха, холодильной технике, санитарной технике и мониторингу загрязнения окружающей среды, строительной акустике"
                                 },
                                 {
                                    id: "71.12.14",
                                    title: "Разработка инженерно-технических проектов и контроль при строительстве и модернизации объектов использования атомной энергии"
                                 }]
                           },
                           {
                              id: "71.12.2",
                              title: "Деятельность заказчика-застройщика, генерального подрядчика"
                           },
                           {
                              id: "71.12.3",
                              title: "Работы геолого-разведочные, геофизические и геохимические в области изучения недр и воспроизводства минерально-сырьевой базы"
                           },
                           {
                              id: "71.12.4",
                              title: "Деятельность геодезическая и картографическая",
                              children: [
                                 {
                                    id: "71.12.41",
                                    title: "Деятельность топографо-геодезическая"
                                 },
                                 {
                                    id: "71.12.42",
                                    title: "Деятельность картографическая, включая деятельность в областях наименований географических объектов и создания и ведения картографо-геодезического фонда"
                                 },
                                 {
                                    id: "71.12.43",
                                    title: "Работы гидрографические изыскательские"
                                 },
                                 {
                                    id: "71.12.44",
                                    title: "Деятельность, связанная со сбором, обработкой и подготовкой картографической и космической информации, включая аэросъемку"
                                 },
                                 {
                                    id: "71.12.45",
                                    title: "Инженерные изыскания в строительстве"
                                 },
                                 {
                                    id: "71.12.46",
                                    title: "Землеустройство"
                                 }]
                           },
                           {
                              id: "71.12.5",
                              title: "Деятельность в области гидрометеорологии и смежных с ней областях, мониторинга состояния окружающей среды, ее загрязнения",
                              children: [
                                 {
                                    id: "71.12.51",
                                    title: "Деятельность наблюдательной гидрометеорологической сети"
                                 },
                                 {
                                    id: "71.12.52",
                                    title: "Проведение гелиофизических и геофизических работ"
                                 },
                                 {
                                    id: "71.12.53",
                                    title: "Деятельность по мониторингу загрязнения окружающей среды для физических и юридических лиц"
                                 },
                                 {
                                    id: "71.12.54",
                                    title: "Работы полевые и изыскания в области гидрометеорологии и смежных с ней областях, экспедиционные обследования объектов окружающей среды с целью оценки уровней загрязнения"
                                 },
                                 {
                                    id: "71.12.55",
                                    title: "Деятельность по обработке и предоставлению гидрометеорологической информации органам государственной власти и населению"
                                 },
                                 {
                                    id: "71.12.56",
                                    title: "Обеспечение гидрометеорологическое деятельности физических и юридических лиц"
                                 },
                                 {
                                    id: "71.12.57",
                                    title: "Деятельность, связанная с активными воздействиями на метеорологические и геофизические процессы и явления"
                                 }]
                           },
                           {
                              id: "71.12.6",
                              title: "Деятельность в области технического регулирования, стандартизации, метрологии, аккредитации, каталогизации продукции",
                              children: [
                                 {
                                    id: "71.12.61",
                                    title: "Деятельность в области технического регулирования и стандартизации"
                                 },
                                 {
                                    id: "71.12.62",
                                    title: "Деятельность в области метрологии"
                                 },
                                 {
                                    id: "71.12.63",
                                    title: "Деятельность в области аккредитации"
                                 },
                                 {
                                    id: "71.12.64",
                                    title: "Государственный контроль (надзор) за соблюдением требований технических регламентов"
                                 },
                                 {
                                    id: "71.12.65",
                                    title: "Федеральный государственный метрологический надзор"
                                 },
                                 {
                                    id: "71.12.66",
                                    title: "Деятельность в области каталогизации продукции"
                                 }]
                           },
                           {
                              id: "71.12.7",
                              title: "Кадастровая деятельность"
                           },
                           {
                              id: "71.12.8",
                              title: "Деятельность по предоставлению инженерно-технических консультаций по энергосбережению и повышению энергетической эффективности"
                           }]
                     }]
               },
               {
                  id: "71.2",
                  title: "Технические испытания, исследования, анализ и сертификация",
                  children: [
                     {
                        id: "71.20",
                        title: "Технические испытания, исследования, анализ и сертификация",
                        children: [
                           {
                              id: "71.20.1",
                              title: "Испытания и анализ состава и чистоты материалов и веществ: анализ химических и биологических свойств материалов и веществ; испытания и анализ в области гигиены питания, включая ветеринарный контроль и контроль за производством продуктов питания"
                           },
                           {
                              id: "71.20.2",
                              title: "Судебно-экспертная деятельность"
                           },
                           {
                              id: "71.20.3",
                              title: "Испытания и анализ физико-механических свойств материалов и веществ"
                           },
                           {
                              id: "71.20.4",
                              title: "Испытания, исследования и анализ целостных механических и электрических систем, энергетическое обследование"
                           },
                           {
                              id: "71.20.5",
                              title: "Технический осмотр автотранспортных средств"
                           },
                           {
                              id: "71.20.6",
                              title: "Экспертиза проектной документации и результатов инженерных изысканий",
                              children: [
                                 {
                                    id: "71.20.61",
                                    title: "Экспертиза проектной документации и результатов инженерных изысканий государственная"
                                 },
                                 {
                                    id: "71.20.62",
                                    title: "Экспертиза проектной документации и результатов инженерных изысканий негосударственная"
                                 }]
                           },
                           {
                              id: "71.20.7",
                              title: "Деятельность по оценке условий труда"
                           },
                           {
                              id: "71.20.8",
                              title: "Сертификация продукции, услуг и организаций"
                           },
                           {
                              id: "71.20.9",
                              title: "Деятельность по техническому контролю, испытаниям и анализу прочая"
                           }]
                     }]
               }]
         },
         {
            id: "72",
            title: "Научные исследования и разработки",
            children: [
               {
                  id: "72.1",
                  title: "Научные исследования и разработки в области естественных и технических наук",
                  children: [
                     {
                        id: "72.11",
                        title: "Научные исследования и разработки в области биотехнологии"
                     },
                     {
                        id: "72.19",
                        title: "Научные исследования и разработки в области естественных и технических наук прочие",
                        children: [
                           {
                              id: "72.19.1",
                              title: "Проведение фундаментальных исследований и научно-исследовательских и опытно-конструкторских работ в области использования атомной энергии и в области ядерной оружейной продукции",
                              children: [
                                 {
                                    id: "72.19.11",
                                    title: "Проведение фундаментальных исследований, научно-исследовательских и опытно-конструкторских работ в области использования атомной энергии"
                                 },
                                 {
                                    id: "72.19.12",
                                    title: "Научные исследования и разработки в области ядерной оружейной продукции"
                                 }]
                           },
                           {
                              id: "72.19.2",
                              title: "Научные исследования и разработки в области технических наук"
                           },
                           {
                              id: "72.19.3",
                              title: "Научные исследования и разработки в области нанотехнологий"
                           },
                           {
                              id: "72.19.4",
                              title: "Научные исследования и разработки в области защиты информации"
                           },
                           {
                              id: "72.19.9",
                              title: "Научные исследования и разработки в области естественных и технических наук прочие, не включенные в другие группировки"
                           }]
                     }]
               },
               {
                  id: "72.2",
                  title: "Научные исследования и разработки в области общественных и гуманитарных наук",
                  children: [
                     {
                        id: "72.20",
                        title: "Научные исследования и разработки в области общественных и гуманитарных наук",
                        children: [
                           {
                              id: "72.20.1",
                              title: "Научные исследования и разработки в области общественных наук"
                           },
                           {
                              id: "72.20.2",
                              title: "Научные исследования и разработки в области гуманитарных наук"
                           }]
                     }]
               }]
         },
         {
            id: "73",
            title: "Деятельность рекламная и исследование конъюнктуры рынка",
            children: [
               {
                  id: "73.1",
                  title: "Деятельность рекламная",
                  children: [
                     {
                        id: "73.11",
                        title: "Деятельность рекламных агентств"
                     },
                     {
                        id: "73.12",
                        title: "Представление в средствах массовой информации"
                     }]
               },
               {
                  id: "73.2",
                  title: "Исследование конъюнктуры рынка и изучение общественного мнения",
                  children: [
                     {
                        id: "73.20",
                        title: "Исследование конъюнктуры рынка и изучение общественного мнения",
                        children: [
                           {
                              id: "73.20.1",
                              title: "Исследование конъюнктуры рынка"
                           },
                           {
                              id: "73.20.2",
                              title: "Деятельность по изучению общественного мнения"
                           }]
                     }]
               }]
         },
         {
            id: "74",
            title: "Деятельность профессиональная научная и техническая прочая",
            children: [
               {
                  id: "74.1",
                  title: "Деятельность специализированная в области дизайна",
                  children: [
                     {
                        id: "74.10",
                        title: "Деятельность специализированная в области дизайна"
                     }]
               },
               {
                  id: "74.2",
                  title: "Деятельность в области фотографии",
                  children: [
                     {
                        id: "74.20",
                        title: "Деятельность в области фотографии"
                     }]
               },
               {
                  id: "74.3",
                  title: "Деятельность по письменному и устному переводу",
                  children: [
                     {
                        id: "74.30",
                        title: "Деятельность по письменному и устному переводу"
                     }]
               },
               {
                  id: "74.9",
                  title: "Деятельность профессиональная, научная и техническая прочая, не включенная в другие группировки",
                  children: [
                     {
                        id: "74.90",
                        title: "Деятельность профессиональная, научная и техническая прочая, не включенная в другие группировки",
                        children: [
                           {
                              id: "74.90.1",
                              title: "Предоставление посреднических услуг по организации покупки и продажи мелких или средних коммерческих предприятий, включая профессиональную практику"
                           },
                           {
                              id: "74.90.2",
                              title: "Деятельность, направленная на установление рыночной или иной стоимости (оценочная деятельность), кроме оценки, связанной с недвижимым имуществом или страхованием",
                              children: [
                                 {
                                    id: "74.90.21",
                                    title: "Деятельность, направленная на установление рыночной или иной стоимости отдельных материальных объектов (вещей)"
                                 },
                                 {
                                    id: "74.90.22",
                                    title: "Деятельность, направленная на установление рыночной или иной стоимости совокупности вещей, составляющих имущество лица, в том числе имущество определенного вида (движимое или недвижимое, в том числе предприятия)"
                                 },
                                 {
                                    id: "74.90.23",
                                    title: "Деятельность, направленная на установление рыночной или иной стоимости права собственности или иных вещных прав на имущество или отдельные вещи из состава имущества"
                                 },
                                 {
                                    id: "74.90.24",
                                    title: "Деятельность, направленная на установление рыночной или иной стоимости прав требования, обязательств (долгов)"
                                 },
                                 {
                                    id: "74.90.25",
                                    title: "Деятельность, направленная на установление рыночной или иной стоимости работ, услуг, информации"
                                 },
                                 {
                                    id: "74.90.26",
                                    title: "Деятельность, направленная на установление рыночной или иной стоимости иных объектов гражданских прав, в отношении которых законодательством Российской Федерации установлена возможность их участия в гражданском обороте"
                                 }]
                           },
                           {
                              id: "74.90.3",
                              title: "Предоставление консультационных услуг по вопросам безопасности",
                              children: [
                                 {
                                    id: "74.90.31",
                                    title: "Предоставление услуг по проведению оценки уязвимости объектов транспортной инфраструктуры и транспортных средств"
                                 },
                                 {
                                    id: "74.90.32",
                                    title: "Предоставление услуг по проведению оценки уязвимости объектов промышленного назначения, связи, здравоохранения и т.д."
                                 }]
                           },
                           {
                              id: "74.90.4",
                              title: "Предоставление консультационных услуг в области сельского хозяйства"
                           },
                           {
                              id: "74.90.5",
                              title: "Предоставление консультационных услуг в области экологии"
                           },
                           {
                              id: "74.90.6",
                              title: "Предоставление прочих технических консультаций, деятельность консультантов, кроме архитекторов, проектировщиков и консультантов по управлению"
                           },
                           {
                              id: "74.90.7",
                              title: "Деятельность по подготовке метеорологических прогнозов"
                           },
                           {
                              id: "74.90.8",
                              title: "Деятельность агентств и агентов, действующих от имени физических лиц, и обычно связанную с заключением контрактов (договоров) на участие в кинофильмах, театральных постановках и других развлекательных или спортивных мероприятиях, а также с предложением книг, пьес, предметов изобразительного искусства, фотографий и аналогичных предметов издателям, продюсерам"
                           },
                           {
                              id: "74.90.9",
                              title: "Деятельность в области защиты информации",
                              children: [
                                 {
                                    id: "74.90.91",
                                    title: "Деятельность по разработке средств защиты информации"
                                 },
                                 {
                                    id: "74.90.92",
                                    title: "Деятельность по разработке информационных и телекоммуникационных систем, защищенных с использованием средств защиты информации"
                                 },
                                 {
                                    id: "74.90.99",
                                    title: "Деятельность в области защиты информации прочая"
                                 }]
                           }]
                     }]
               }]
         },
         {
            id: "75",
            title: "Деятельность ветеринарная",
            children: [
               {
                  id: "75.0",
                  title: "Деятельность ветеринарная",
                  children: [
                     {
                        id: "75.00",
                        title: "Деятельность ветеринарная",
                        children: [
                           {
                              id: "75.00.1",
                              title: "Деятельность ветеринарная для сельскохозяйственных животных"
                           },
                           {
                              id: "75.00.2",
                              title: "Деятельность ветеринарная для домашних животных"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел N",
      title: "Деятельность административная и сопутствующие дополнительные услуги",
      children: [
         {
            id: "77",
            title: "Аренда и лизинг",
            children: [
               {
                  id: "77.1",
                  title: "Аренда и лизинг автотранспортных средств",
                  children: [
                     {
                        id: "77.11",
                        title: "Аренда и лизинг легковых автомобилей и легких автотранспортных средств"
                     },
                     {
                        id: "77.12",
                        title: "Аренда и лизинг грузовых транспортных средств"
                     }]
               },
               {
                  id: "77.2",
                  title: "Прокат и аренда предметов личного пользования и хозяйственно-бытового назначения",
                  children: [
                     {
                        id: "77.21",
                        title: "Прокат и аренда товаров для отдыха и спортивных товаров"
                     },
                     {
                        id: "77.22",
                        title: "Прокат видеокассет и аудиокассет, грампластинок, компакт-дисков (CD), цифровых видеодисков (DVD)"
                     },
                     {
                        id: "77.29",
                        title: "Прокат и аренда прочих предметов личного пользования и хозяйственно-бытового назначения",
                        children: [
                           {
                              id: "77.29.1",
                              title: "Прокат телевизоров, радиоприемников, устройств видеозаписи, аудиозаписи и подобного оборудования"
                           },
                           {
                              id: "77.29.2",
                              title: "Прокат мебели, электрических и неэлектрических бытовых приборов"
                           },
                           {
                              id: "77.29.3",
                              title: "Прокат музыкальных инструментов"
                           },
                           {
                              id: "77.29.9",
                              title: "Прокат прочих бытовых изделий и предметов личного пользования для домашних хозяйств, предприятий и организаций, не включенных в другие группировки"
                           }]
                     }]
               },
               {
                  id: "77.3",
                  title: "Аренда и лизинг прочих машин и оборудования и материальных средств",
                  children: [
                     {
                        id: "77.31",
                        title: "Аренда и лизинг сельскохозяйственных машин и оборудования"
                     },
                     {
                        id: "77.32",
                        title: "Аренда и лизинг строительных машин и оборудования"
                     },
                     {
                        id: "77.33",
                        title: "Аренда и лизинг офисных машин и оборудования, включая вычислительную технику",
                        children: [
                           {
                              id: "77.33.1",
                              title: "Аренда и лизинг офисных машин и оборудования"
                           },
                           {
                              id: "77.33.2",
                              title: "Аренда и лизинг вычислительных машин и оборудования"
                           }]
                     },
                     {
                        id: "77.34",
                        title: "Аренда и лизинг водных транспортных средств и оборудования"
                     },
                     {
                        id: "77.35",
                        title: "Аренда и лизинг воздушных судов и авиационного оборудования"
                     },
                     {
                        id: "77.39",
                        title: "Аренда и лизинг прочих видов транспорта, оборудования и материальных средств, не включенных в другие группировки",
                        children: [
                           {
                              id: "77.39.1",
                              title: "Аренда и лизинг прочих сухопутных транспортных средств и оборудования",
                              children: [
                                 {
                                    id: "77.39.11",
                                    title: "Аренда и лизинг прочего автомобильного транспорта и оборудования"
                                 },
                                 {
                                    id: "77.39.12",
                                    title: "Аренда и лизинг железнодорожного транспорта и оборудования"
                                 }]
                           },
                           {
                              id: "77.39.2",
                              title: "Аренда и лизинг прочих машин и оборудования, не включенных в другие группировки",
                              children: [
                                 {
                                    id: "77.39.21",
                                    title: "Аренда и лизинг двигателей, турбин и станков"
                                 },
                                 {
                                    id: "77.39.22",
                                    title: "Аренда и лизинг горного и нефтепромыслового оборудования"
                                 },
                                 {
                                    id: "77.39.23",
                                    title: "Аренда и лизинг подъемно-транспортного оборудования"
                                 },
                                 {
                                    id: "77.39.24",
                                    title: "Аренда и лизинг профессиональной радио- и телевизионной аппаратуры и аппаратуры связи"
                                 },
                                 {
                                    id: "77.39.25",
                                    title: "Аренда и лизинг контрольно-измерительной аппаратуры"
                                 },
                                 {
                                    id: "77.39.26",
                                    title: "Аренда и лизинг приборов, аппаратов и прочего оборудования, применяемого в медицинских целях"
                                 },
                                 {
                                    id: "77.39.27",
                                    title: "Аренда и лизинг торгового оборудования"
                                 },
                                 {
                                    id: "77.39.29",
                                    title: "Аренда и лизинг прочих машин и оборудования научного и промышленного назначения"
                                 }]
                           },
                           {
                              id: "77.39.3",
                              title: "Аренда и лизинг племенных сельскохозяйственных животных"
                           }]
                     }]
               },
               {
                  id: "77.4",
                  title: "Аренда интеллектуальной собственности и подобной продукции, кроме авторских прав",
                  children: [
                     {
                        id: "77.40",
                        title: "Аренда интеллектуальной собственности и подобной продукции, кроме авторских прав"
                     }]
               }]
         },
         {
            id: "78",
            title: "Деятельность по трудоустройству и подбору персонала",
            children: [
               {
                  id: "78.1",
                  title: "Деятельность агентств по подбору персонала",
                  children: [
                     {
                        id: "78.10",
                        title: "Деятельность агентств по подбору персонала"
                     }]
               },
               {
                  id: "78.2",
                  title: "Деятельность агентств по временному трудоустройству",
                  children: [
                     {
                        id: "78.20",
                        title: "Деятельность агентств по временному трудоустройству"
                     }]
               },
               {
                  id: "78.3",
                  title: "Деятельность по подбору персонала прочая",
                  children: [
                     {
                        id: "78.30",
                        title: "Деятельность по подбору персонала прочая"
                     }]
               }]
         },
         {
            id: "79",
            title: "Деятельность туристических агентств и прочих организаций, предоставляющих услуги в сфере туризма",
            children: [
               {
                  id: "79.1",
                  title: "Деятельность туристических агентств и туроператоров",
                  children: [
                     {
                        id: "79.11",
                        title: "Деятельность туристических агентств"
                     },
                     {
                        id: "79.12",
                        title: "Деятельность туроператоров"
                     }]
               },
               {
                  id: "79.9",
                  title: "Услуги по бронированию прочие и сопутствующая деятельность",
                  children: [
                     {
                        id: "79.90",
                        title: "Услуги по бронированию прочие и сопутствующая деятельность",
                        children: [
                           {
                              id: "79.90.1",
                              title: "Деятельность по предоставлению туристических информационных услуг"
                           },
                           {
                              id: "79.90.2",
                              title: "Деятельность по предоставлению экскурсионных туристических услуг",
                              children: [
                                 {
                                    id: "79.90.21",
                                    title: "Деятельность туристических агентств по предоставлению экскурсионных туристических услуг"
                                 },
                                 {
                                    id: "79.90.22",
                                    title: "Деятельность самостоятельных экскурсоводов и гидов по предоставлению экскурсионных туристических услуг"
                                 }]
                           },
                           {
                              id: "79.90.3",
                              title: "Деятельность по предоставлению туристических услуг, связанных с бронированием",
                              children: [
                                 {
                                    id: "79.90.31",
                                    title: "Деятельность по бронированию билетов на культурно-развлекательные мероприятия"
                                 },
                                 {
                                    id: "79.90.32",
                                    title: "Деятельность по оказанию прочих услуг, связанных со службой предварительных заказов"
                                 }]
                           }]
                     }]
               }]
         },
         {
            id: "80",
            title: "Деятельность по обеспечению безопасности и проведению расследований",
            children: [
               {
                  id: "80.1",
                  title: "Деятельность частных охранных служб",
                  children: [
                     {
                        id: "80.10",
                        title: "Деятельность частных охранных служб"
                     }]
               },
               {
                  id: "80.2",
                  title: "Деятельность систем обеспечения безопасности",
                  children: [
                     {
                        id: "80.20",
                        title: "Деятельность систем обеспечения безопасности"
                     }]
               },
               {
                  id: "80.3",
                  title: "Деятельность по расследованию",
                  children: [
                     {
                        id: "80.30",
                        title: "Деятельность по расследованию"
                     }]
               }]
         },
         {
            id: "81",
            title: "Деятельность по обслуживанию зданий и территорий",
            children: [
               {
                  id: "81.1",
                  title: "Деятельность по комплексному обслуживанию помещений",
                  children: [
                     {
                        id: "81.10",
                        title: "Деятельность по комплексному обслуживанию помещений"
                     }]
               },
               {
                  id: "81.2",
                  title: "Деятельность по чистке и уборке",
                  children: [
                     {
                        id: "81.21",
                        title: "Деятельность по общей уборке зданий",
                        children: [
                           {
                              id: "81.21.1",
                              title: "Деятельность по уборке квартир и частных домов"
                           },
                           {
                              id: "81.21.9",
                              title: "Деятельность по уборке прочих типов зданий и помещений"
                           }]
                     },
                     {
                        id: "81.22",
                        title: "Деятельность по чистке и уборке жилых зданий и нежилых помещений прочая"
                     },
                     {
                        id: "81.29",
                        title: "Деятельность по чистке и уборке прочая",
                        children: [
                           {
                              id: "81.29.1",
                              title: "Дезинфекция, дезинсекция, дератизация зданий, промышленного оборудования"
                           },
                           {
                              id: "81.29.2",
                              title: "Подметание улиц и уборка снега"
                           },
                           {
                              id: "81.29.9",
                              title: "Деятельность по чистке и уборке прочая, не включенная в другие группировки"
                           }]
                     }]
               },
               {
                  id: "81.3",
                  title: "Предоставление услуг по благоустройству ландшафта",
                  children: [
                     {
                        id: "81.30",
                        title: "Деятельность по благоустройству ландшафта"
                     }]
               }]
         },
         {
            id: "82",
            title: "Деятельность административно-хозяйственная, вспомогательная деятельность по обеспечению функционирования организации, деятельность по предоставлению прочих вспомогательных услуг для бизнеса",
            children: [
               {
                  id: "82.1",
                  title: "Деятельность административно-хозяйственная и вспомогательная деятельность по обеспечению функционирования организации",
                  children: [
                     {
                        id: "82.11",
                        title: "Деятельность административно-хозяйственная комплексная по обеспечению работы организации"
                     },
                     {
                        id: "82.19",
                        title: "Деятельность по фотокопированию и подготовке документов и прочая специализированная вспомогательная деятельность по обеспечению деятельности офиса"
                     }]
               },
               {
                  id: "82.2",
                  title: "Деятельность центров обработки телефонных вызовов",
                  children: [
                     {
                        id: "82.20",
                        title: "Деятельность центров обработки телефонных вызовов"
                     }]
               },
               {
                  id: "82.3",
                  title: "Деятельность по организации конференций и выставок",
                  children: [
                     {
                        id: "82.30",
                        title: "Деятельность по организации конференций и выставок"
                     }]
               },
               {
                  id: "82.9",
                  title: "Деятельность по предоставлению вспомогательных услуг для бизнеса, не включенная в другие группировки",
                  children: [
                     {
                        id: "82.91",
                        title: "Деятельность агентств по сбору платежей и бюро кредитной информации"
                     },
                     {
                        id: "82.92",
                        title: "Деятельность по упаковыванию товаров"
                     },
                     {
                        id: "82.99",
                        title: "Деятельность по предоставлению прочих вспомогательных услуг для бизнеса, не включенная в другие группировки"
                     }]
               }]
         }]
   },
   {
      id: "Раздел O",
      title: "Государственное управление и обеспечение военной безопасности; социальное обеспечение",
      children: [
         {
            id: "84",
            title: "Деятельность органов государственного управления по обеспечению военной безопасности, обязательному социальному обеспечению",
            children: [
               {
                  id: "84.1",
                  title: "Деятельность органов государственного управления и местного самоуправления по вопросам общего и социально-экономического характера",
                  children: [
                     {
                        id: "84.11",
                        title: "Деятельность органов государственного управления и местного самоуправления по вопросам общего характера",
                        children: [
                           {
                              id: "84.11.1",
                              title: "Деятельность федеральных органов государственной власти по управлению вопросами общего характера, кроме судебной власти",
                              children: [
                                 {
                                    id: "84.11.11",
                                    title: "Деятельность федеральных органов государственной власти, кроме полномочных представителей Президента Российской Федерации и территориальных органов федеральных органов исполнительной власти"
                                 },
                                 {
                                    id: "84.11.12",
                                    title: "Деятельность полномочных представителей Президента Российской Федерации в регионах Российской Федерации и территориальных органов федеральных органов исполнительной власти в субъектах Российской Федерации (республиках, краях, областях)"
                                 },
                                 {
                                    id: "84.11.13",
                                    title: "Деятельность территориальных органов федеральных органов исполнительной власти в городах и районах субъектов Российской Федерации"
                                 }]
                           },
                           {
                              id: "84.11.2",
                              title: "Деятельность органов государственной власти по управлению вопросами общего характера, кроме судебной власти, субъектов Российской Федерации",
                              children: [
                                 {
                                    id: "84.11.21",
                                    title: "Деятельность органов государственной власти субъектов Российской Федерации (республик, краев, областей), кроме судебной власти, представительств исполнительных органов государственной власти субъектов Российской Федерации при Президенте Российской Федерации"
                                 },
                                 {
                                    id: "84.11.22",
                                    title: "Деятельность органов государственной власти субъектов Российской Федерации по осуществлению своих полномочий в городах и районах"
                                 },
                                 {
                                    id: "84.11.23",
                                    title: "Деятельность органов государственной власти субъектов Российской Федерации по осуществлению своих полномочий в сельских населенных пунктах"
                                 }]
                           },
                           {
                              id: "84.11.3",
                              title: "Деятельность органов местного самоуправления по управлению вопросами общего характера",
                              children: [
                                 {
                                    id: "84.11.31",
                                    title: "Деятельность органов местного самоуправления муниципальных районов"
                                 },
                                 {
                                    id: "84.11.32",
                                    title: "Деятельность органов местного самоуправления городских округов"
                                 },
                                 {
                                    id: "84.11.33",
                                    title: "Деятельность органов местного самоуправления внутригородских территорий городов федерального значения"
                                 },
                                 {
                                    id: "84.11.34",
                                    title: "Деятельность органов местного самоуправления городских поселений"
                                 },
                                 {
                                    id: "84.11.35",
                                    title: "Деятельность органов местного самоуправления сельских поселений"
                                 }]
                           },
                           {
                              id: "84.11.4",
                              title: "Управление финансовой деятельностью и деятельностью в сфере налогообложения"
                           },
                           {
                              id: "84.11.5",
                              title: "Управление деятельностью в области прогнозирования и планирования"
                           },
                           {
                              id: "84.11.6",
                              title: "Управление деятельностью в области фундаментальных исследований"
                           },
                           {
                              id: "84.11.7",
                              title: "Управление деятельностью в области статистики"
                           },
                           {
                              id: "84.11.8",
                              title: "Управление имуществом, находящимся в государственной собственности"
                           },
                           {
                              id: "84.11.9",
                              title: "Управление деятельностью в области антимонопольного контроля"
                           }]
                     },
                     {
                        id: "84.12",
                        title: "Государственное регулирование деятельности в области здравоохранения, образования, социально-культурного развития и других социальных услуг, кроме социального обеспечения"
                     },
                     {
                        id: "84.13",
                        title: "Регулирование и содействие эффективному ведению экономической деятельности предприятий"
                     }]
               },
               {
                  id: "84.2",
                  title: "Предоставление государственных услуг обществу",
                  children: [
                     {
                        id: "84.21",
                        title: "Деятельность международная"
                     },
                     {
                        id: "84.22",
                        title: "Деятельность, связанная с обеспечением военной безопасности"
                     },
                     {
                        id: "84.23",
                        title: "Деятельность в области юстиции и правосудия",
                        children: [
                           {
                              id: "84.23.1",
                              title: "Деятельность федеральных судов",
                              children: [
                                 {
                                    id: "84.23.11",
                                    title: "Деятельность Конституционного суда Российской Федерации"
                                 },
                                 {
                                    id: "84.23.12",
                                    title: "Деятельность Верховного суда Российской Федерации"
                                 },
                                 {
                                    id: "84.23.13",
                                    title: "Деятельность кассационных судов общей юрисдикции, апелляционных судов общей юрисдикции, верховных судов республик, краевых, областных судов, судов городов федерального значения, суда автономной области, судов автономных округов"
                                 },
                                 {
                                    id: "84.23.14",
                                    title: "Деятельность районных судов"
                                 },
                                 {
                                    id: "84.23.15",
                                    title: "Деятельность военных судов"
                                 },
                                 {
                                    id: "84.23.16",
                                    title: "Деятельность Высшего арбитражного суда Российской Федерации"
                                 },
                                 {
                                    id: "84.23.17",
                                    title: "Деятельность федеральных арбитражных судов округов"
                                 },
                                 {
                                    id: "84.23.18",
                                    title: "Деятельность арбитражных апелляционных судов, арбитражных судов субъектов Российской Федерации"
                                 },
                                 {
                                    id: "84.23.19",
                                    title: "Деятельность специализированных судов"
                                 }]
                           },
                           {
                              id: "84.23.2",
                              title: "Деятельность судов субъектов Российской Федерации",
                              children: [
                                 {
                                    id: "84.23.21",
                                    title: "Деятельность конституционных (уставных) судов"
                                 },
                                 {
                                    id: "84.23.22",
                                    title: "Деятельность мировых судей"
                                 }]
                           },
                           {
                              id: "84.23.3",
                              title: "Деятельность органов прокуратуры Российской Федерации",
                              children: [
                                 {
                                    id: "84.23.31",
                                    title: "Деятельность Генеральной прокуратуры Российской Федерации"
                                 },
                                 {
                                    id: "84.23.32",
                                    title: "Деятельность прокуратур субъектов Российской Федерации"
                                 },
                                 {
                                    id: "84.23.33",
                                    title: "Деятельность прокуратур городов и районов"
                                 }]
                           },
                           {
                              id: "84.23.4",
                              title: "Деятельность по управлению и эксплуатации тюрем, исправительных колоний и других мест лишения свободы, а также по оказанию реабилитационной помощи бывшим заключенным"
                           },
                           {
                              id: "84.23.5",
                              title: "Деятельность Следственного комитета Российской Федерации",
                              children: [
                                 {
                                    id: "84.23.51",
                                    title: "Деятельность центрального аппарата Следственного комитета Российской Федерации"
                                 },
                                 {
                                    id: "84.23.52",
                                    title: "Деятельность Главного военного следственного управления, главных следственных управлений и следственных управлений Следственного комитета Российской Федерации по субъектам Российской Федерации (в том числе подразделений указанных управлений по административным округам) и приравненных к ним специализированных (в том числе военных) следственных управлений и следственных отделов Следственного комитета Российской Федерации"
                                 }]
                           }]
                     },
                     {
                        id: "84.24",
                        title: "Деятельность по обеспечению общественного порядка и безопасности"
                     },
                     {
                        id: "84.25",
                        title: "Деятельность по обеспечению безопасности в чрезвычайных ситуациях; деятельность по обеспечению безопасности в области использования атомной энергии",
                        children: [
                           {
                              id: "84.25.1",
                              title: "Деятельность по обеспечению пожарной безопасности"
                           },
                           {
                              id: "84.25.2",
                              title: "Деятельность по обеспечению безопасности на водных объектах"
                           },
                           {
                              id: "84.25.3",
                              title: "Деятельность по обеспечению безопасности в области использования атомной энергии"
                           },
                           {
                              id: "84.25.9",
                              title: "Деятельность по обеспечению безопасности в чрезвычайных ситуациях прочая"
                           }]
                     }]
               },
               {
                  id: "84.3",
                  title: "Деятельность в области обязательного социального обеспечения",
                  children: [
                     {
                        id: "84.30",
                        title: "Деятельность в области обязательного социального обеспечения"
                     }]
               }]
         }]
   },
   {
      id: "Раздел P",
      title: "Образование",
      children: [
         {
            id: "85",
            title: "Образование",
            children: [
               {
                  id: "85.1",
                  title: "Образование общее",
                  children: [
                     {
                        id: "85.11",
                        title: "Образование дошкольное"
                     },
                     {
                        id: "85.12",
                        title: "Образование начальное общее"
                     },
                     {
                        id: "85.13",
                        title: "Образование основное общее"
                     },
                     {
                        id: "85.14",
                        title: "Образование среднее общее"
                     }]
               },
               {
                  id: "85.2",
                  title: "Образование профессиональное",
                  children: [
                     {
                        id: "85.21",
                        title: "Образование профессиональное среднее"
                     },
                     {
                        id: "85.22",
                        title: "Образование высшее",
                        children: [
                           {
                              id: "85.22.1",
                              title: "Образование высшее - бакалавриат"
                           },
                           {
                              id: "85.22.2",
                              title: "Образование высшее - специалитет"
                           },
                           {
                              id: "85.22.3",
                              title: "Образование высшее - магистратура"
                           }]
                     },
                     {
                        id: "85.23",
                        title: "Подготовка кадров высшей квалификации"
                     }]
               },
               {
                  id: "85.3",
                  title: "Обучение профессиональное",
                  children: [
                     {
                        id: "85.30",
                        title: "Обучение профессиональное"
                     }]
               },
               {
                  id: "85.4",
                  title: "Образование дополнительное",
                  children: [
                     {
                        id: "85.41",
                        title: "Образование дополнительное детей и взрослых",
                        children: [
                           {
                              id: "85.41.1",
                              title: "Образование в области спорта и отдыха"
                           },
                           {
                              id: "85.41.2",
                              title: "Образование в области культуры"
                           },
                           {
                              id: "85.41.9",
                              title: "Образование дополнительное детей и взрослых прочее, не включенное в другие группировки"
                           }]
                     },
                     {
                        id: "85.42",
                        title: "Образование профессиональное дополнительное",
                        children: [
                           {
                              id: "85.42.1",
                              title: "Деятельность школ подготовки водителей автотранспортных средств"
                           },
                           {
                              id: "85.42.2",
                              title: "Деятельность школ обучения вождению воздушных и плавательных судов, без выдачи коммерческих сертификатов и лицензий"
                           },
                           {
                              id: "85.42.9",
                              title: "Деятельность по дополнительному профессиональному образованию прочая, не включенная в другие группировки"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел Q",
      title: "Деятельность в области здравоохранения и социальных услуг",
      children: [
         {
            id: "86",
            title: "Деятельность в области здравоохранения",
            children: [
               {
                  id: "86.1",
                  title: "Деятельность больничных организаций",
                  children: [
                     {
                        id: "86.10",
                        title: "Деятельность больничных организаций"
                     }]
               },
               {
                  id: "86.2",
                  title: "Медицинская и стоматологическая практика",
                  children: [
                     {
                        id: "86.21",
                        title: "Общая врачебная практика"
                     },
                     {
                        id: "86.22",
                        title: "Специальная врачебная практика"
                     },
                     {
                        id: "86.23",
                        title: "Стоматологическая практика"
                     }]
               },
               {
                  id: "86.9",
                  title: "Деятельность в области медицины прочая",
                  children: [
                     {
                        id: "86.90",
                        title: "Деятельность в области медицины прочая",
                        children: [
                           {
                              id: "86.90.1",
                              title: "Деятельность организаций санитарно-эпидемиологической службы"
                           },
                           {
                              id: "86.90.2",
                              title: "Деятельность организаций судебно-медицинской экспертизы"
                           },
                           {
                              id: "86.90.3",
                              title: "Деятельность массажных салонов"
                           },
                           {
                              id: "86.90.4",
                              title: "Деятельность санаторно-курортных организаций"
                           },
                           {
                              id: "86.90.9",
                              title: "Деятельность в области медицины прочая, не включенная в другие группировки"
                           }]
                     }]
               }]
         },
         {
            id: "87",
            title: "Деятельность по уходу с обеспечением проживания",
            children: [
               {
                  id: "87.1",
                  title: "Деятельность по медицинскому уходу с обеспечением проживания",
                  children: [
                     {
                        id: "87.10",
                        title: "Деятельность по медицинскому уходу с обеспечением проживания"
                     }]
               },
               {
                  id: "87.2",
                  title: "Деятельность по оказанию помощи на дому для лиц с ограниченными возможностями развития, душевнобольным и наркозависимым",
                  children: [
                     {
                        id: "87.20",
                        title: "Деятельность по оказанию помощи на дому для лиц с ограниченными возможностями развития, душевнобольным и наркозависимым"
                     }]
               },
               {
                  id: "87.3",
                  title: "Деятельность по уходу за престарелыми и инвалидами с обеспечением проживания",
                  children: [
                     {
                        id: "87.30",
                        title: "Деятельность по уходу за престарелыми и инвалидами с обеспечением проживания"
                     }]
               },
               {
                  id: "87.9",
                  title: "Деятельность по уходу с обеспечением проживания прочая",
                  children: [
                     {
                        id: "87.90",
                        title: "Деятельность по уходу с обеспечением проживания прочая"
                     }]
               }]
         },
         {
            id: "88",
            title: "Предоставление социальных услуг без обеспечения проживания",
            children: [
               {
                  id: "88.1",
                  title: "Предоставление социальных услуг без обеспечения проживания престарелым и инвалидам",
                  children: [
                     {
                        id: "88.10",
                        title: "Предоставление социальных услуг без обеспечения проживания престарелым и инвалидам"
                     }]
               },
               {
                  id: "88.9",
                  title: "Предоставление прочих социальных услуг без обеспечения проживания",
                  children: [
                     {
                        id: "88.91",
                        title: "Предоставление услуг по дневному уходу за детьми"
                     },
                     {
                        id: "88.99",
                        title: "Предоставлению прочих социальных услуг без обеспечения проживания, не включенных в другие группировки"
                     }]
               }]
         }]
   },
   {
      id: "Раздел R",
      title: "Деятельность в области культуры, спорта, организации досуга и развлечений",
      children: [
         {
            id: "90",
            title: "Деятельность творческая, деятельность в области искусства и организации развлечений",
            children: [
               {
                  id: "90.0",
                  title: "Деятельность творческая, деятельность в области искусства и организации развлечений",
                  children: [
                     {
                        id: "90.01",
                        title: "Деятельность в области исполнительских искусств"
                     },
                     {
                        id: "90.02",
                        title: "Деятельность вспомогательная, связанная с исполнительскими искусствами"
                     },
                     {
                        id: "90.03",
                        title: "Деятельность в области художественного творчества"
                     },
                     {
                        id: "90.04",
                        title: "Деятельность учреждений культуры и искусства",
                        children: [
                           {
                              id: "90.04.1",
                              title: "Деятельность концертных залов, театров, оперных зданий, мюзик-холлов, включая услуги билетных касс"
                           },
                           {
                              id: "90.04.2",
                              title: "Деятельность многоцелевых центров и подобных заведений с преобладанием культурного обслуживания"
                           },
                           {
                              id: "90.04.3",
                              title: "Деятельность учреждений клубного типа: клубов, дворцов и домов культуры, домов народного творчества"
                           }]
                     }]
               }]
         },
         {
            id: "91",
            title: "Деятельность библиотек, архивов, музеев и прочих объектов культуры",
            children: [
               {
                  id: "91.0",
                  title: "Деятельность библиотек, архивов, музеев и прочих объектов культуры",
                  children: [
                     {
                        id: "91.01",
                        title: "Деятельность библиотек и архивов"
                     },
                     {
                        id: "91.02",
                        title: "Деятельность музеев"
                     },
                     {
                        id: "91.03",
                        title: "Деятельность по охране исторических мест и зданий, памятников культуры"
                     },
                     {
                        id: "91.04",
                        title: "Деятельность ботанических садов, зоопарков, государственных природных заповедников и национальных парков",
                        children: [
                           {
                              id: "91.04.1",
                              title: "Деятельность зоопарков"
                           },
                           {
                              id: "91.04.2",
                              title: "Деятельность государственных природных заповедников (в том числе биосферных)"
                           },
                           {
                              id: "91.04.3",
                              title: "Деятельность национальных парков"
                           },
                           {
                              id: "91.04.4",
                              title: "Деятельность природных парков"
                           },
                           {
                              id: "91.04.5",
                              title: "Деятельность природных заказников"
                           },
                           {
                              id: "91.04.6",
                              title: "Деятельность дендрологических парков и ботанических садов"
                           }]
                     }]
               }]
         },
         {
            id: "92",
            title: "Деятельность по организации и проведению азартных игр и заключению пари, по организации и проведению лотерей",
            children: [
               {
                  id: "92.1",
                  title: "Деятельность по организации и проведению азартных игр и заключения пари",
                  children: [
                     {
                        id: "92.11",
                        title: "Деятельность казино"
                     },
                     {
                        id: "92.12",
                        title: "Деятельность залов игровых автоматов"
                     },
                     {
                        id: "92.13",
                        title: "Деятельность по организации заключения пари"
                     }]
               },
               {
                  id: "92.2",
                  title: "Деятельность по организации и проведению лотерей",
                  children: [
                     {
                        id: "92.21",
                        title: "Деятельность организаторов лотерей"
                     },
                     {
                        id: "92.22",
                        title: "Деятельность операторов лотерей"
                     },
                     {
                        id: "92.23",
                        title: "Деятельность распространителей лотерейных билетов"
                     }]
               }]
         },
         {
            id: "93",
            title: "Деятельность в области спорта, отдыха и развлечений",
            children: [
               {
                  id: "93.1",
                  title: "Деятельность в области спорта",
                  children: [
                     {
                        id: "93.11",
                        title: "Деятельность спортивных объектов"
                     },
                     {
                        id: "93.12",
                        title: "Деятельность спортивных клубов"
                     },
                     {
                        id: "93.13",
                        title: "Деятельность фитнес-центров"
                     },
                     {
                        id: "93.19",
                        title: "Деятельность в области спорта прочая"
                     }]
               },
               {
                  id: "93.2",
                  title: "Деятельность в области отдыха и развлечений",
                  children: [
                     {
                        id: "93.21",
                        title: "Деятельность парков культуры и отдыха и тематических парков"
                     },
                     {
                        id: "93.29",
                        title: "Деятельность зрелищно-развлекательная прочая",
                        children: [
                           {
                              id: "93.29.1",
                              title: "Деятельность парков отдыха и пляжей"
                           },
                           {
                              id: "93.29.2",
                              title: "Деятельность танцплощадок, дискотек, школ танцев"
                           },
                           {
                              id: "93.29.3",
                              title: "Организация обрядов (свадеб, юбилеев), в т.ч. музыкальное сопровождение"
                           },
                           {
                              id: "93.29.9",
                              title: "Деятельность зрелищно-развлекательная прочая, не включенная в другие группировки"
                           }]
                     }]
               }]
         }]
   },
   {
      id: "Раздел S",
      title: "Предоставление прочих видов услуг",
      children: [
         {
            id: "94",
            title: "Деятельность общественных организаций",
            children: [
               {
                  id: "94.1",
                  title: "Деятельность коммерческих, предпринимательских и профессиональных организаций",
                  children: [
                     {
                        id: "94.11",
                        title: "Деятельность коммерческих и предпринимательских членских организаций"
                     },
                     {
                        id: "94.12",
                        title: "Деятельность профессиональных членских организаций"
                     }]
               },
               {
                  id: "94.2",
                  title: "Деятельность профессиональных союзов",
                  children: [
                     {
                        id: "94.20",
                        title: "Деятельность профессиональных союзов"
                     }]
               },
               {
                  id: "94.9",
                  title: "Деятельность прочих общественных организаций",
                  children: [
                     {
                        id: "94.91",
                        title: "Деятельность религиозных организаций"
                     },
                     {
                        id: "94.92",
                        title: "Деятельность политических организаций"
                     },
                     {
                        id: "94.99",
                        title: "Деятельность прочих общественных организаций, не включенных в другие группировки"
                     }]
               }]
         },
         {
            id: "95",
            title: "Ремонт компьютеров, предметов личного потребления и хозяйственно-бытового назначения",
            children: [
               {
                  id: "95.1",
                  title: "Ремонт компьютеров и коммуникационного оборудования",
                  children: [
                     {
                        id: "95.11",
                        title: "Ремонт компьютеров и периферийного компьютерного оборудования"
                     },
                     {
                        id: "95.12",
                        title: "Ремонт коммуникационного оборудования"
                     }]
               },
               {
                  id: "95.2",
                  title: "Ремонт предметов личного потребления и хозяйственно-бытового назначения",
                  children: [
                     {
                        id: "95.21",
                        title: "Ремонт электронной бытовой техники"
                     },
                     {
                        id: "95.22",
                        title: "Ремонт бытовых приборов, домашнего и садового инвентаря",
                        children: [
                           {
                              id: "95.22.1",
                              title: "Ремонт бытовой техники"
                           },
                           {
                              id: "95.22.2",
                              title: "Ремонт домашнего и садового оборудования"
                           }]
                     },
                     {
                        id: "95.23",
                        title: "Ремонт обуви и прочих изделий из кожи"
                     },
                     {
                        id: "95.24",
                        title: "Ремонт мебели и предметов домашнего обихода",
                        children: [
                           {
                              id: "95.24.1",
                              title: "Ремонт мебели"
                           },
                           {
                              id: "95.24.2",
                              title: "Ремонт предметов домашнего обихода"
                           }]
                     },
                     {
                        id: "95.25",
                        title: "Ремонт часов и ювелирных изделий",
                        children: [
                           {
                              id: "95.25.1",
                              title: "Ремонт часов"
                           },
                           {
                              id: "95.25.2",
                              title: "Ремонт ювелирных изделий"
                           }]
                     },
                     {
                        id: "95.29",
                        title: "Ремонт прочих предметов личного потребления и бытовых товаров",
                        children: [
                           {
                              id: "95.29.1",
                              title: "Ремонт одежды и текстильных изделий",
                              children: [
                                 {
                                    id: "95.29.11",
                                    title: "Ремонт одежды"
                                 },
                                 {
                                    id: "95.29.12",
                                    title: "Ремонт текстильных изделий"
                                 },
                                 {
                                    id: "95.29.13",
                                    title: "Ремонт трикотажных изделий"
                                 }]
                           },
                           {
                              id: "95.29.2",
                              title: "Ремонт спортивного и туристского оборудования"
                           },
                           {
                              id: "95.29.3",
                              title: "Ремонт игрушек и подобных им изделий"
                           },
                           {
                              id: "95.29.4",
                              title: "Ремонт металлоизделий бытового и хозяйственного назначения",
                              children: [
                                 {
                                    id: "95.29.41",
                                    title: "Ремонт предметов и изделий из металла"
                                 },
                                 {
                                    id: "95.29.42",
                                    title: "Ремонт металлической галантереи, ключей, номерных знаков, указателей улиц"
                                 },
                                 {
                                    id: "95.29.43",
                                    title: "Заточка пил, чертежных и других инструментов, ножей, ножниц, бритв, коньков и т.п."
                                 }]
                           },
                           {
                              id: "95.29.5",
                              title: "Ремонт бытовых осветительных приборов"
                           },
                           {
                              id: "95.29.6",
                              title: "Ремонт велосипедов"
                           },
                           {
                              id: "95.29.7",
                              title: "Ремонт и настройка музыкальных инструментов (кроме органов и исторических музыкальных инструментов)"
                           },
                           {
                              id: "95.29.9",
                              title: "Ремонт прочих бытовых изделий и предметов личного пользования, не вошедших в другие группировки"
                           }]
                     }]
               }]
         },
         {
            id: "96",
            title: "Деятельность по предоставлению прочих персональных услуг",
            children: [
               {
                  id: "96.0",
                  title: "Деятельность по предоставлению прочих персональных услуг",
                  children: [
                     {
                        id: "96.01",
                        title: "Стирка и химическая чистка текстильных и меховых изделий"
                     },
                     {
                        id: "96.02",
                        title: "Предоставление услуг парикмахерскими и салонами красоты",
                        children: [
                           {
                              id: "96.02.1",
                              title: "Предоставление парикмахерских услуг"
                           },
                           {
                              id: "96.02.2",
                              title: "Предоставление косметических услуг парикмахерскими и салонами красоты"
                           }]
                     },
                     {
                        id: "96.03",
                        title: "Организация похорон и предоставление связанных с ними услуг"
                     },
                     {
                        id: "96.04",
                        title: "Деятельность физкультурно-оздоровительная"
                     },
                     {
                        id: "96.09",
                        title: "Предоставление прочих персональных услуг, не включенных в другие группировки"
                     }]
               }]
         }]
   },
   {
      id: "Раздел T",
      title: "Деятельность домашних хозяйств как работодателей; недифференцированная деятельность частных домашних хозяйств по производству товаров и оказанию услуг для собственного потребления",
      children: [
         {
            id: "97",
            title: "Деятельность домашних хозяйств с наемными работниками",
            children: [
               {
                  id: "97.0",
                  title: "Деятельность домашних хозяйств с наемными работниками",
                  children: [
                     {
                        id: "97.00",
                        title: "Деятельность домашних хозяйств с наемными работниками"
                     }]
               }]
         },
         {
            id: "98",
            title: "Деятельность недифференцированная частных домашних хозяйств по производству товаров и предоставлению услуг для собственного потребления",
            children: [
               {
                  id: "98.1",
                  title: "Деятельность недифференцированная частных домашних хозяйств по производству товаров для собственного потребления",
                  children: [
                     {
                        id: "98.10",
                        title: "Деятельность недифференцированная частных домашних хозяйств по производству товаров для собственного потребления"
                     }]
               },
               {
                  id: "98.2",
                  title: "Деятельность недифференцированная частных домашних хозяйств по предоставлению услуг для собственного потребления",
                  children: [
                     {
                        id: "98.20",
                        title: "Деятельность недифференцированная частных домашних хозяйств по предоставлению услуг для собственного потребления"
                     }]
               }]
         }]
   },
   {
      id: "Раздел U",
      title: "Деятельность экстерриториальных организаций и органов",
      children: [
         {
            id: "99",
            title: "Деятельность экстерриториальных организаций и органов",
            children: [
               {
                  id: "99.0",
                  title: "Деятельность экстерриториальных организаций и органов",
                  children: [
                     {
                        id: "99.00",
                        title: "Деятельность экстерриториальных организаций и органов"
                     }]
               }]
         }]
   }];
